{
    "Program Description": "Program Description\n\n\nThis major prepares students for careers in public, corporate, not-for-profit, and governmental accounting and also provides an appropriate background for those planning to enter law school or graduate school. Accountants develop and interpret historical and prospective financial data required for decision-making by managers, investors, regulators, and other stakeholders. To perform their functions, accountants must synthesize both numerical and qualitative information, communicate it clearly, and function effectively as individuals and in teams. The field of Accounting is diverse and offers students the opportunity to be generalists or concentrate in one of the following:\n \nCorporate Control & Financial Management \n- Courses in this concentration prepare students for positions in industry, government, and business advisory services doing financial planning, analysis, control, and decision support. Students can obtain such designations as \nCertified Management Accountant (CMA)\n. Management accountants provide forecasts, compute costs and benefits, perform variance analysis, and review and monitor performance. Managerial accountants also design systems that provide information to decision makers.\n \nInternal Auditing & Assessment\n - Courses in this concentration prepare students for positions in industry and government as internal auditors. Students can obtain such designations as \nCertified Internal Auditor (CIA). \nInternal auditors are employed by the organization they audit. Internal auditing is a systematic approach to evaluating and improving the effectiveness of risk management, control, and governance processes. Internal auditors also review compliance with standards and assess the organization's risks.\n \nPublic Accounting\n - Public accounting is carried on by independent practitioners, most of whom are Certified Public Accountants (CPAs). In addition to statutory audits, CPAs render other assurance, tax, and management advisory services. To be licensed as a CPA in nearly every state, including Pennsylvania, individuals must complete 150 credit-hours of education, pass a demanding professional examination, and meet certain experience requirements. One way to accomplish this is to enroll in the Integrated B.S. in Accounting and Master of Accounting Program.\n\n\nWhat is Accounting?\n\n\nAccountants develop and interpret financial data required for decision-making by managers, investors, regulators, and other stakeholders. To perform their functions, accountants must work with both numerical information and concepts, and they must be able to function effectively as individuals and in teams. Accountants work with people in their own specialized departments, and with users of financial information throughout their organization. Because of this close association with other parts of the organization, the accountant is in a unique position to develop a broad business perspective.\n\n\nMORE INFORMATION ABOUT ACCOUNTING",
    "Entrance to Major": "Entrance to Major\n\n\nTo be eligible for entrance into the Accounting (ACCTG) major, a degree candidate must be enrolled in the Smeal College of Business or the Division of Undergraduate Studies and satisfy requirements for entrance to the major.\n\n\nAdministrative Enrollment Controls\n\n\nThis program currently has administrative enrollment controls. Administrative Enrollment Controls are initiated when limitations of space, faculty, or other resources in a major prevent accommodating all students who request them. Students must follow the administrative enrollment controls that are in effect for the semester that they enter the university.\n \nFirst-Year Students Entering Summer 2024, Fall 2024, Spring 2025\n \nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n\n\n\n\n36-59 graded Penn State credits (excludes transfer and AP credits)\n\n\ncompleted with a grade of C or better:\n\t\n\n\nEnglish - \nENGL 15\n or \nENGL 30H\n or \nESL 15\n or \nENGL 137H\n or \nCAS 137H\n\n\nMathematics - \nMATH 110\n or \nMATH 140\n or \nMATH 140B\n\n\nStatistics - \nSCM 200\n or \nSCM 200H\n or \nSTAT 200\n\n\n\n\n\n\ncompleted \nECON 102\n or \nECON 102H\n\n\ncompleted at Penn State (no substitutions or transfers), in addition with a quality grade of \"C\" or better and no alternative or Pass/Fail (PS) grading:\n\t\n\n\nAccounting - \nACCTG 211\n or \nACCTG 211H\n or (\nACCTG 201\n and \nACCTG 202\n)\n\n\nManagement - \nMGMT 301\n or \nMGMT 301H\n or \nMGMT 301M\n or \nMGMT 301W\n\n\nMarketing - \nMKTG 301\n or \nMKTG 301H\n or \nMKTG 301W\n\n\nFinance - \nFIN 301\n or \nFIN 301H\n\n\n\n\n\n\nearned a minimum cumulative grade-point average (GPA) of 3.20\n\n\n\n\nStudents Who Entered Prior to Summer 2024\n \nStudents who entered the University from Summer 2018 through Spring 2024 should view the administrative enrollment controls in the appropriate \nUndergraduate Bulletin archive\n. Students who entered the University prior to the summer 2018 semester should consult with their academic adviser about the administrative enrollment controls in effect for the semester they entered the university.",
    "Degree Requirements": "Degree Requirements\n\n\nFor the Bachelor of Science degree in Accounting, a minimum of 120 credits is required with at least 15 credits at the 400 level:\n \n \nProgram Requirements\n \n \n \n \nRequirement\n \n Credits\n \n \n \n \nGeneral Education\n \n45\n \n \nElectives\n \n11\n \n \nRequirements for the Major\n \n76\n \n \n \n \n12 of the 45 credits for General Education are included in the Requirements for the Major. This includes: 3 credits of GWS courses (\nENGL 202D\n); 6 credits of GQ courses (\nMATH 110\n or \nMATH 140\n and \nSCM 200\n or \nSTAT 200\n); 3 credits of GS courses (\nECON 102\n).\n \n \nRequirements for the Major\n \nTo graduate, a student enrolled in the major must earn a grade of C or better in each course designated by the major as a C-required course, as specified by \nSenate Policy 82-44\n.\n \n \nCourse List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nACCTG 403W\nAuditing\n3\n \nACCTG 404\nManagerial Accounting: Economic Perspective\n3\n \nBA 342\nSocially Responsible, Sustainable and Ethical Business Practice\n3\n \nBA 411\nAnalyzing Business and Industry\n3\n \nBLAW 341\nBusiness Law I: Introduction to Contracts, Liability Issues, and           Intellectual Property\n3\n \nECON 102\nIntroductory Microeconomic Analysis and Policy \n3\n \nECON 104\nIntroductory Macroeconomic Analysis and Policy \n3\n \nMIS 250\nIntroduction to Problem Solving with Spreadsheet Analysis and Information Systems Management\n3\n \nSCM 301\nSupply Chain Management\n3\n \nPrescribed Courses: Require a grade of C or better\n \nACCTG 211\nFinancial and Managerial Accounting for Decision Making\n4\n \nACCTG 405\nPrinciples of Taxation I\n3\n \nACCTG 471\nIntermediate Financial Accounting I\n3\n \nACCTG 472\nIntermediate Financial Accounting II\n3\n \nENGL 202D\nEffective Writing: Business Writing \n3\n \nFIN 301\nCorporation Finance\n3\n \nMGMT 301\nBasic Management Concepts\n3\n \nMKTG 301\nPrinciples of Marketing\n3\n \nAdditional Courses\n \nSelect 6 credits from the following:\n6\n \nACCTG 406\nPrinciples of Taxation II\n \nACCTG 432\nAccounting Information Systems\n \nACCTG 440\nAdvanced Management Accounting\n \nACCTG 473\nAdvanced Financial Accounting\n \nACCTG 481\nFinancial Statement Analysis: Accounting Based Evaluation and Decision     Making\n \nACCTG 483\nForensic Accounting\n \nAdditional Courses: Require a grade of C or better\n \nMATH 110\nTechniques of Calculus I \n4\n \nor \nMATH 140\n Calculus With Analytic Geometry I \n \nSCM 200\nIntroduction to Statistics for Business \n4\n \nor \nSTAT 200\n Elementary Statistics \n \nSupporting Courses and Related Areas\n \nSelect 4 credits: Attainment of 12th credit level proficiency in a single world language. Proficiency must be demonstrated by either examination or course work.\n4\n \nSelect 6 credits of supporting coursework. See Department List.\n6\n \n \n\n\nGeneral Education\n \nConnecting career and curiosity, the General Education curriculum provides the opportunity for students to acquire transferable skills necessary to be successful in the future and to thrive while living in interconnected contexts. General Education aids students in developing intellectual curiosity, a strengthened ability to think, and a deeper sense of aesthetic appreciation. These are requirements for all baccalaureate students and are often partially incorporated into the requirements of a program. For additional information, see the \nGeneral Education Requirements\n section of the Bulletin and consult your academic adviser.\n \nThe keystone symbol \n appears next to the title of any course that is designated as a General Education course. Program requirements may also satisfy General Education requirements and vary for each program.\n \nFoundations (grade of C or better is required and Inter-Domain courses do not meet this requirement.)\n \n \nQuantification (GQ):\n 6 credits\n \nWriting and Speaking (GWS):\n 9 credits\n \n \nBreadth in the Knowledge Domains (Inter-Domain courses do not meet this requirement.)\n \n \nArts (GA):\n 3 credits\n \nHealth and Wellness (GHW):\n 3 credits\n \nHumanities (GH):\n 3 credits\n \nSocial and Behavioral Sciences (GS):\n 3 credits\n \nNatural Sciences (GN):\n 3 credits\n \n \nIntegrative Studies\n \n \nInter-Domain Courses (Inter-Domain):\n 6 credits\n \n \nExploration\n \n \nGN, \nmay be completed with Inter-Domain courses: 3 credits\n \nGA, GH, GN, GS, Inter-Domain courses. \nThis may include 3 credits of World Language course work beyond the 12th credit level or the requirements for the student’s degree program, whichever is higher\n:\n 6 credits\n \n\n\nUniversity Degree Requirements\n \nFirst Year Engagement\n \nAll students enrolled in a college or the Division of Undergraduate Studies at University Park, and the World Campus are required to take 1 to 3 credits of the First-Year Seminar, as specified by their college First-Year Engagement Plan.\n \nOther Penn State colleges and campuses may require the First-Year Seminar; colleges and campuses that do not require a First-Year Seminar provide students with a first-year engagement experience.\n \nFirst-year baccalaureate students entering Penn State should consult their academic adviser for these requirements.\n \nCultures Requirement\n \n6 credits are required and may satisfy other requirements\n \n \nUnited States Cultures: 3 credits\n \nInternational Cultures: 3 credits\n \n \nWriting Across the Curriculum\n \n3 credits required from the college of graduation and likely prescribed as part of major requirements.\n \nTotal Minimum Credits\n \nA minimum of 120 degree credits must be earned for a baccalaureate degree. The requirements for some programs may exceed 120 credits. Students should consult with their college or department adviser for information on specific credit requirements.\n \nQuality of Work\n \nCandidates must complete the degree requirements for their major and earn at least a 2.00 grade-point average for all courses completed within their degree program.\n \nLimitations on Source and Time for Credit Acquisition\n \nThe college dean or campus chancellor and program faculty may require up to 24 credits of course work in the major to be taken at the location or in the college or program where the degree is earned. Credit used toward degree programs may need to be earned from a particular source or within time constraints (see \nSenate Policy 83-80\n). For more information, check the Suggested Academic Plan for your intended program.",
    "Suggested Academic Plan": "Suggested Academic Plan\n\n\nThe suggested academic plan(s) listed on this page are the plan(s) that are in effect during the 2024-25 academic year. To access previous years' suggested academic plans, please visit the \narchive\n to view the appropriate Undergraduate Bulletin edition.\n\n\nAccounting, B.S. at University Park Campus\n\n\nThe course series listed below provides \nonly one\n of the many possible ways to move through this curriculum. The University may make changes in policies, procedures, educational offerings, and requirements at any time. This plan should be used in conjunction with your degree audit (accessible in LionPATH as either an \nAcademic Requirements\n or \nWhat If \nreport). Please consult with a Penn State academic adviser on a regular basis to develop and refine an academic plan that is appropriate for you.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\n\n\n\n\nPSU 6\n1\nMGMT 301\n1,2\n3\n\n\n\n\n(MATH 110 or MATH 140) or (SCM 200 or STAT 200) (GQ)\n1,2\n4\n(SCM 200 or STAT 200) or (MATH 110 or MATH 140) (GQ)\n1,2\n4\n\n\n\n\nENGL 15\n, \n 30H\n, \nESL  15\n, \nENGL  137H\n, or \nCAS  137H\n1,2\n3\nWorld Language - Level Two (8th credit level)\n3\n4\n\n\n\n\nECON 102\n (GS)\n2\n3\nGeneral Education Course (US)\n4\n3\n\n\n\n\nWorld Language - Level One (4th credit level)\n3\n4\n \n\n\n \n15\n \n14\n\n\nSecond Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nMKTG 301\n1,2\n3\nFIN 301\n1,2\n3\n\n\n\n\nACCTG 211\n1,2\n4\nSCM 301\n3\n\n\n\n\nECON 104\n3\nCAS 100, \nENGL  138T\n, or \nCAS  138T\n1\n3\n\n\n\n\nWorld Language - Level Three (12th credit level)\n3\n4\nMIS 250\n3\n\n\n\n\nGeneral Education Course (IL)\n4\n3\nGeneral Education Course\n4\n3\n\n\n \n17\n \n15\n\n\nThird Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nACCTG 471\n1\n3\nACCTG 472\n1\n3\n\n\n\n\nACCTG 404\n3\nACCTG 405\n1\n3\n\n\n\n\nENGL 202D\n1\n3\nGeneral Education Course (N)\n4\n3\n\n\n\n\nBLAW 341\n or \nBA  342\n3\nBA 342\n or \nBLAW  341\n3\n\n\n\n\nGeneral Education Course\n4\n3\nGeneral Education Course\n4\n3\n\n\n \n15\n \n15\n\n\nFourth Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nACCTG 403W\n (or ACCTG 4XX - Accounting Elective)\n6\n3\nACCTG 403W\n (or ACCTG 4XX - Accounting Elective)\n6\n3\n\n\n\n\nBA 411\n (or ACCTG 4XX - Accounting Elective)\n6\n3\nBA 411\n (or ACCTG 4XX - Accounting Elective)\n6\n3\n\n\n\n\nBusiness Breadth Course\n5\n3\nBusiness Breadth Course\n5\n3\n\n\n\n\nGeneral Education Course (N)\n4\n3\nGeneral Education Course\n4\n3\n\n\n\n\nElective \n4\n2\nGeneral Education Course\n4\n3\n\n\n \n14\n \n15\n\n\nTotal Credits 120\n\n\n\n\n\n\n \n 1 \n \nCourse requires a grade of C or better\n \n 2 \n \nEntrance-to-Major Course – complete prior to attaining 59 cumulative credits at Penn State\n \n 3 \n \nAttain 12\nth\n credit level proficiency in a world language (0-12 credits). Credits required vary based on predetermined skill level. Balance of remaining credits are taken as electives. American Sign Language does not satisfy the Smeal College world language requirement.\n \n 4 \n \nWhen planning general education and elective courses, students should factor in the following requirements:\n \n \n3 credits of United States Culture (US)\n \n3 credits of International Culture (IL)\n \n6 credits of Inter-Domain (N) coursework\n \n \n 5 \n \nSee the Business Breadth Course list on the Smeal College website.\n \n 6 \n \nSee the Accounting Elective (ACCTG 4XX) courses on the Accounting Department website.\n\n\nUniversity Requirements and General Education Notes:\n \nUS and IL are abbreviations used to designate courses that satisfy Cultural Diversity Requirements (United States and International Cultures).\n \nW, M, X, and Y are the suffixes at the end of a course number used to designate courses that satisfy University Writing Across the Curriculum requirement.\n \nGeneral Education includes Foundations (GWS and GQ), Knowledge Domains (GHW, GN, GA, GH, GS) and Integrative Studies (Inter-domain) requirements. N or Q (Honors) is the suffix at the end of a course number used to help identify an Inter-domain course, but the inter-domain attribute is used to fill audit requirements. Foundations courses (GWS and GQ) require a grade of 'C' or better.\n \nAll incoming Schreyer Honors College first-year students at University Park will take \nENGL 137H\n/\nCAS 137H\n in the fall semester and \nENGL 138T\n/\nCAS 138T\n in the spring semester. These courses carry the GWS designation and satisfy a portion of that General Education requirement. If the student’s program prescribes GWS these courses will replace both \nENGL 15\n/\nENGL 30H\n and \nCAS 100A\n/\nCAS 100B\n/\nCAS 100C\n. Each course is 3 credits.\n\n\nCollege and Department Notes:\n\n\n\n\nThe Smeal College of Business requires that the following entrance-to-major courses be taken at Penn State: \nACCTG 211\n, \nMGMT 301\n, \nMKTG 301\n, and \nFIN 301\n.\n\n\nPursuant to the Association to Advance Collegiate Schools of Business (AACSB) accreditation standards, the Smeal College of Business requires that all upper division courses within the departments sponsoring the major be completed in residence at University Park under the instruction of Smeal College faculty.\n\n\nPublic Accounting\n – Students interested in public accounting should take \nACCTG 406\n and \nACCTG 473\n for the Additional ACCTG courses requirement and \nBLAW 444\n in the supporting course or electives area. These courses aid in preparation for the CPA (Certified Public Accountant) examination. To sit for the CPA exam, students must complete 150 specified credits. The Smeal College Integrated MAcc (Master of Accounting) and/or One-Year MAcc program are designed to fully prepare students for the CPA Exam.\n\n\nCorporate Accounting \n– Students interested in corporate accounting should take \nACCTG 440\n and \nACCTG 481\n for the Additional ACCTG courses requirement. \nACCTG 417\n is also recommended as an elective. These courses can be used in the optional Corporate Control and Analysis certificate offered by the Smeal Accounting Department.\n\n\n\n\n\n\nAccounting, B.S. at Commonwealth Campuses\n\n\nThe course series listed below provides \nonly one\n of the many possible ways to move through this curriculum. The University may make changes in policies, procedures, educational offerings, and requirements at any time. This plan should be used in conjunction with your degree audit (accessible in LionPATH as either an \nAcademic Requirements\n or \nWhat If \nreport). Please consult with a Penn State academic adviser on a regular basis to develop and refine an academic plan that is appropriate for you.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\n\n\n\n\nFirst-Year Seminar (if required by Campus)\n1-0\nMGMT 301\n1,2\n3\n\n\n\n\n(MATH 110 or MATH 140) or (SCM 200 or STAT 200) (GQ)\n1,2\n4\n(SCM 200 or STAT 200) or (MATH 110 or MATH 140) (GQ)\n1,2\n4\n\n\n\n\nENGL 15\n, \n 30H\n, \nESL  15\n, \nENGL  137H\n, or \nCAS  137H\n1,2\n3\nWorld Language - Level Two (8th credit level)\n3\n4\n\n\n\n\nECON 102\n (GS)\n2\n3\nGeneral Education Course (US)\n4\n3\n\n\n\n\nWorld Language - Level One (4th credit level)\n3\n4\n \n\n\n \n15-14\n \n14\n\n\nSecond Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nMKTG 301\n1,2\n3\nFIN 301\n1,2\n3\n\n\n\n\nACCTG 211\n1,2\n4\nENGL 202D\n1\n3\n\n\n\n\nECON 104\n3\nCAS 100, \nENGL  138T\n, or \nCAS  138T\n1\n3\n\n\n\n\nWorld Language - Level Three (12th credit level)\n3\n4\nGeneral Education Course\n4\n3\n\n\n\n\nGeneral Education Course (IL)\n4\n3\nGeneral Education Course\n4\n3\n\n\n \n17\n \n15\n\n\nThird Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nACCTG 471\n1\n3\nACCTG 472\n1\n3\n\n\n\n\nACCTG 404\n3\nACCTG 405\n1\n3\n\n\n\n\nSCM 301\n3\nGeneral Education Course (N)\n4\n3\n\n\n\n\nBLAW 341\n or \nBA  342\n3\nBA 342\n or \nBLAW  341\n3\n\n\n\n\nMIS 250\n3\nGeneral Education Course\n4\n3\n\n\n \n15\n \n15\n\n\nFourth Year\nFall\nCredits\nSpring\nCredits\n\n\n\n\nACCTG 403W\n (or ACCTG 4XX - Accounting Elective)\n6\n3\nACCTG 403W\n (or ACCTG 4XX - Accounting Elective)\n6\n3\n\n\n\n\nBA 411\n (or ACCTG 4XX - Accounting Elective)\n6\n3\nBA 411\n (or ACCTG 4XX - Accounting Elective)\n6\n3\n\n\n\n\nBusiness Breadth Course\n5\n3\nBusiness Breadth Course\n5\n3\n\n\n\n\nGeneral Education Course (N)\n4\n3\nGeneral Education Course\n4\n3\n\n\n\n\nElective \n4\n2-3\nGeneral Education Course\n4\n3\n\n\n \n14-15\n \n15\n\n\nTotal Credits 120\n\n\n\n\n\n\n \n 1 \n \nCourse requires a grade of C or better\n \n 2 \n \nEntrance-to-Major Course – complete prior to attaining 59 cumulative credits at Penn State\n \n 3 \n \nAttain 12\nth\n credit level proficiency in a world language (0-12 credits). Credits required vary based on predetermined skill level. Balance of remaining credits are taken as electives. American Sign Language does not satisfy the Smeal College world language requirement.\n \n 4 \n \nWhen planning general education and elective courses, students should factor in the following requirements:\n \n \n3 credits of United States Culture (US)\n \n3 credits of International Culture (IL)\n \n6 credits of Inter-Domain (N) coursework\n \n \n 5 \n \nSee the Business Breadth Course list on the Smeal College website.\n \n 6 \n \nSee the Accounting Elective (ACCTG 4XX) courses on the Accounting Department website.\n\n\nUniversity Requirements and General Education Notes:\n \nUS and IL are abbreviations used to designate courses that satisfy Cultural Diversity Requirements (United States and International Cultures).\n \nW, M, X, and Y are the suffixes at the end of a course number used to designate courses that satisfy University Writing Across the Curriculum requirement.\n \nGeneral Education includes Foundations (GWS and GQ), Knowledge Domains (GHW, GN, GA, GH, GS) and Integrative Studies (Inter-domain) requirements. N or Q (Honors) is the suffix at the end of a course number used to help identify an Inter-domain course, but the inter-domain attribute is used to fill audit requirements. Foundations courses (GWS and GQ) require a grade of 'C' or better.\n\n\nCollege and Department Notes:\n\n\n\n\nThe Smeal College of Business requires that the following entrance-to-major courses be taken at Penn State: \nACCTG 211\n, \nMGMT 301\n, \nMKTG 301\n, and \nFIN 301\n.\n\n\nPursuant to the Association to Advance Collegiate Schools of Business (AACSB) accreditation standards, the Smeal College of Business requires that all upper division courses within the departments sponsoring the major be completed in residence at University Park under the instruction of Smeal College faculty.\n\n\nPublic Accounting\n – Students interested in public accounting should take \nACCTG 406\n and \nACCTG 473\n for the Additional ACCTG courses requirement and \nBLAW 444\n in the supporting course or electives area. These courses aid in preparation for the CPA (Certified Public Accountant) examination. To sit for the CPA exam, students must complete 150 specified credits. The Smeal College Integrated MAcc (Master of Accounting) and/or One-Year MAcc program are designed to fully prepare students for the CPA Exam.\n\n\nCorporate Accounting \n– Students interested in corporate accounting should take \nACCTG 440\n and \nACCTG 481\n for the Additional ACCTG courses requirement. \nACCTG 417\n is also recommended as an elective. These courses can be used in the optional Corporate Control and Analysis certificate offered by the Smeal Accounting Department."
}