{
    "Aerospace engineering bs": {
        "program_description": "Program Description\n\n\nThis major emphasizes the analysis, design, and operation of aircraft and spacecraft. Students learn the theories and practices in the fundamental subjects of aeronautics, astronautics, aerodynamics and fluid dynamics, aerospace materials and structures, dynamics and automatic control, aircraft stability and control and/or orbital and attitude dynamics and control, air-breathing and rocket propulsion, aircraft systems design and /or spacecraft systems design. All of these place significant weight on the development and use of teamwork and communications skills for effective problem-solving. Graduates in aerospace engineering find employment in the customary settings such as government laboratories, large and small aerospace firms, and in nontraditional positions that also require the use of systems-engineering approaches to problem-solving; they can also pursue graduate study in aerospace engineering and related fields.\n\n\nWhat is Aerospace Engineering?\n\n\nAerospace engineering is the primary field of engineering concerned with the design, development, testing, and production of aircraft, spacecraft, and related systems and equipment. The field has traditionally focused on problems related to atmospheric and space flight, with two major and overlapping branches: aeronautical engineering and astronautical engineering. Aerospace engineers develop leading-edge technologies and integrate them into aerospace vehicle systems used for transportation, communications, exploration, and defense applications. This involves the design and manufacturing of aircraft, spacecraft, propulsion systems, satellites, and missiles, as well as the design and testing of aircraft and aerospace products, components, and subassemblies. Successful aerospace engineers possess in-depth skills in, and an understanding of, aerodynamics, materials and structures, propulsion, vehicle dynamics and control, and software.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in developing leading-edge technologies and integrating them into aerospace vehicle systems used for transportation, communications, exploration, and defense applications.\n\n\nYou want to obtain a solid understanding of the foundations of aerospace systems: aerodynamics, structures, propulsion, dynamics and controls, and software, as well as unmanned air vehicles (UAVs), nano-materials, autonomous systems, and wind energy.\n\n\nYou want to develop professional excellence, engineering thinking, and gain deep technical knowledge in the core disciplines and integrative systems of aerospace engineering through an innovative curriculum and world-class instruction.\n\n\nYou want to make a significant global impact.",
        "entrance_to_major": "Entrance to Major\n\n\nThis program currently has administrative enrollment controls. Administrative Enrollment Controls are initiated when limitations of space, faculty, or other resources in a major prevent accommodating all students who request them. Students must follow the administrative enrollment controls that are in effect for the semester that they enter the university.\n \nFirst-Year Students Entering Summer 2024, Fall 2024, Spring 2025\n \nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n\n\n\n\nbe enrolled in the College of Engineering or the Division of Undergraduate Studies\n\n\n29-55 graded Penn State credits (excludes transfer and AP credits)\n\n\ncompleted with a grade of C or better: \nCHEM 110\n, \nEDSGN 100\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n\n\nearned a minimum cumulative grade-point average (GPA) of 2.90\n\n\n\n\nStudents Who Entered Prior to Summer 2024\n \nStudents who entered the University from Summer 2018 through Spring 2024 should view the administrative enrollment controls in the appropriate \nUndergraduate Bulletin archive\n. Students who entered the University prior to the summer 2018 semester should consult with their academic adviser about the administrative enrollment controls in effect for the semester they entered the university.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Architectural engineering bae": {
        "program_description": "Program Description\n\n\nThis major emphasizes the application of scientific and engineering principles to the planning, design, and construction of buildings and building systems. The goal of the program is to provide engineering graduates with the best education available for careers in the building professions. Graduates will have the ability to practice as registered professional engineers in a variety of areas, both public and private, related to the planning, design, construction, and operation of buildings and to assume a place of leadership in society.\n \nFour options are available in the ten-semester major:\n \n \nthe Construction option, which emphasizes building construction engineering and construction management;\n \nthe Lighting/Electrical option, which emphasizes the design of lighting and electrical systems for buildings;\n \nthe Mechanical option, which emphasizes the design of heating, ventilating and air-conditioning systems in buildings; and\n \nthe Structural option, which emphasizes the analysis and design of building structural systems.\n \n \nCourses in architectural design are included in all options to give the engineering student an understanding of architectural design and its relation to engineering. Courses in engineering design are provided throughout the program. The design experience is culminated in a year-long capstone design course.\n \nThe professional degree, Bachelor of Architectural Engineering, is granted upon the satisfactory completion of the five-year program.\n\n\nWhat is Architectural Engineering?\n\n\nArchitectural Engineering is an interdisciplinary field focused on creating integrated building solutions, both in outcome and design process, to produce optimally engineered building systems. This is achieved through close coordination between several primary focus areas, including Structural, Mechanical, Lighting, Electrical, Acoustical, and Construction. The interdisciplinary approach of Architectural Engineering seeks to reduce the carbon footprint of buildings while improving the health, comfort, and productivity of building occupants. This interdisciplinary approach is necessary to respond to the most urgent societal and environmental challenges emerging from urbanization across the globe.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou have aptitude in math and science.\n\n\nYou appreciate the artistic and emotive aspects of architecture.\n\n\nYou are passionate about human-centric design, indoor environmental quality, sustainability, energy conservation, or net-zero and high-performance buildings.\n\n\nYou like to organize parts of a system or process, a handy skill in the planning, coordinating, budgeting, design, construction, and operation of building projects.\n\n\nYou seek a team-oriented work environment with excellent prospects for advancement into project management and corporate leadership.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nEDSGN 100\n or \nEDSGN 130\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 2.60\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.\n \nTransfer Students\n \nUnder the new Entrance to Major (ETM) parameters, transfer students requesting admission to the College of Engineering at University Park will be evaluated in the following way:\n \nTransfer Admission into College of Engineering Pre-Major Status\n \nApplicants who have attempted or completed 18 or more credits but no more than 2 full-time academic semesters at another college or university after high school graduation may apply for transfer admission to pre-major status in the College of Engineering (ENGR_PMAJ). A minimum cumulative grade point average (GPA) of 3.00 and at least 4 credits of college calculus, completed with a C or better, are required for consideration.\n \nAfter Penn State admission, to be eligible for entrance into a College of Engineering major, transfer students (TRN admit status) must meet all the ETM course and GPA requirements and have completed at least 12 credits earned at Penn State but not more than 25 credits.\n \nTransfer Admission Directly into a College of Engineering Major\n \nMajors Not Under Administrative Enrollment Controls\n \nApplicants who have more than one year (2 full-time academic semesters) of attempted college coursework post-high school may only apply for admission directly into a College of Engineering major that does not have administrative enrollment controls. These students are not eligible to enter College of Engineering pre-major status (ENGR_PMAJ). A minimum cumulative grade point average (GPA) of 3.00 and the following coursework completed with a C or better are required for consideration:\n \n \n8 credits of college calculus\n \n3 credits of college chemistry\n \n4 credits of college physics - mechanics\n \n \nThe individual department will make the final admission determination, considering possible alternatives for Penn State specific ETM course requirements (such as EDSGN 100).\n \nMajors under Administrative Enrollment Controls\n \nApplicants who have more than one year (2 full-time academic semesters) of attempted college coursework post-high school may not apply for admission to any College of Engineering major under administrative enrollment controls.",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nAE 202\nIntroduction to Architectural Engineering Concepts\n3\n \nAE 221\nArchitectural Building Materials\n3\n \nAE 222\nBuilding Materials, Methods and Modeling II\n3\n \nAE 240\nProgramming and Data Science for Architectural Engineering\n3\n \nAE 309\nFundamentals of Architectural Acoustics\n3\n \nAE 441\nEngineering Lifecycle Economic Analysis for Buildings\n1\n \nAE 481W\nComprehensive Architectural Engineering Senior Project I\n4\n \nAE 482\nComprehensive Architectural Engineering Senior Project II\n4\n \nARCH 130A\nBasic Design and Research I\n3\n \nARCH 130B\nBasic Design and Research II\n3\n \nARCH 441\nArchitectural Design Analysis\n3\n \nARTH 202N\nRenaissance to Modern Architecture \n3\n \nCHEM 111\nExperimental Chemistry I \n1\n \nEMCH 211\nStatics\n3\n \nEMCH 212\nDynamics\n3\n \nEMCH 213\nStrength of Materials\n3\n \nMATH 220\nMatrices \n3\n \nPHYS 212\nGeneral Physics:  Electricity and Magnetism \n4\n \nPHYS 213\nGeneral Physics:  Fluids and Thermal Physics \n2\n \nPrescribed Courses: Require a grade of C or better\n \nAE 308\nIntroduction to Structural Analysis\n4\n \nAE 310\nFundamentals of Heating, Ventilating, and Air Conditioning\n3\n \nAE 311\nFundamentals of Electrical and Illumination Systems for Building\n3\n \nAE 372\nIntroduction to the Building Construction Industry\n3\n \nCHEM 110\nChemical Principles I \n3\n \nEDSGN 100\nCornerstone Engineering Design\n3\n \nENGL 202C\nEffective Writing: Technical Writing \n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nPHYS 211\nGeneral Physics:  Mechanics \n4\n \nAdditional Courses\n \nARCH 100\nArchitecture and Ideas \n3\n \nor \nLARCH 60\n Cultural History of Designed Places \n \nMATH 231\nCalculus of Several Variables\n2-4\n \nor \nMATH 230\n Calculus and Vector Analysis\n \nMATH 250\nOrdinary Differential Equations\n3-4\n \nor \nMATH 251\n Ordinary and Partial Differential Equations\n \nME 201\nIntroduction to Thermal Science\n3\n \nor \nME 300\n Engineering Thermodynamics I\n \nSTAT 401\nExperimental Methods\n3\n \nor \nIE 424\n Process Quality Engineering\n \nSelect one of the following:\n1\n \nAE 124\nArchitectural Engineering Orientation\n \n1 credit of another First-Year Seminar\n \nSelect one of the following:\n3\n \nECON 14\nPrinciples of Economics \n \nECON 102\nIntroductory Microeconomic Analysis and Policy \n \nECON 104\nIntroductory Macroeconomic Analysis and Policy \n \nAdditional Courses: Require a grade of C or better\n \nSelect one of the following:\n3\n \nCAS 100A\nEffective Speech \n \nCAS 100B\nEffective Speech \n \nCAS/ENGL 138T\nRhetoric and Civic Life II \n \nSelect one of the following:\n3\n \nENGL 15\nRhetoric and Composition \n \nENGL 30H\nHonors Rhetoric and Composition \n \nENGL/CAS 137H\nRhetoric and Civic Life I \n \nRequirements for the Option\n \nSelect an option\n35",
            "specific_requirements": {
                "Construction Option (35 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nAE 404\nBuilding Structural Systems in Steel and Concrete\n3\n \nAE 405\nGeotechnical Engineering\n4\n \nAE 472\nBuilding Construction Planning and Management\n3\n \nAE 473\nBuilding Construction Management and Control\n3\n \nAE 475\nBuilding Construction Engineering I\n3\n \nAE 476\nBuilding Construction Engineering II\n3\n \nCE 209\nFundamentals of Surveying\n2\n \nMGMT 326\nOrganizational Behavior and Design \n1\n3\n \nAdditional Courses\n \nAE 477\nMaterial Science for Architectural Engineers\n3-4\n \nor \nCE 336\n& \nCE 337\n Materials Science for Civil Engineers\nand Civil Engineering Materials Laboratory\n \nSupporting Courses and Related Areas\n \nSelect 7-8 credits from technical courses on department list\n \n1\n7-8",
                "Lighting/Electrical Option (35 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nAE 404\nBuilding Structural Systems in Steel and Concrete\n3\n \nAE 461\nArchitectural Illumination Systems & Design\n3\n \nAE 462\nArchitectural Lighting Controls\n3\n \nAE 464\nAdvanced Architectural Illumination Systems & Design\n3\n \nAE 466\nComputer Aided Lighting Design\n3\n \nAE 467\nAdvanced Building Electrical System Design\n3\n \nAE 468\nAdvanced Building Electrical and Communication Systems\n3\n \nAdditional Courses\n \nAE 453\nLoad and Energy Use Simulations for Buildings\n3\n \nor \nAE 454\n Advanced Heating, Ventilating, and Air Conditioning\n \nSupporting Courses and Related Areas\n \nSelect 11 credits from technical courses on department option list\n \n1\n11",
                "Mechanical Option (35 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nAE 404\nBuilding Structural Systems in Steel and Concrete\n3\n \nAE 453\nLoad and Energy Use Simulations for Buildings\n3\n \nAE 454\nAdvanced Heating, Ventilating, and Air Conditioning\n3\n \nAE 455\nAdvanced Heating, Ventilating, and Air Conditioning System Design\n3\n \nAE 457\nHVAC Control Systems\n3\n \nAE 458\nAdvanced Architectural Acoustics and Noise Control\n3\n \nAE 467\nAdvanced Building Electrical System Design\n3\n \nME 320\nFluid Flow\n3\n \nME 410\nHeat Transfer\n3\n \nSupporting Courses and Related Areas\n \nSelect 8 credits from technical courses on department option list \n \n1\n8",
                "Structural Option (35 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nAE 401\nDesign of Steel and Wood Structures for Buildings\n3\n \nAE 402\nDesign of Concrete Structures for Buildings\n3\n \nAE 403\nAdvanced Steel Design for Buildings\n3\n \nAE 405\nGeotechnical Engineering\n4\n \nAE 430\nIndeterminate Structures\n3\n \nAE 431\nAdvanced Concrete Design for Buildings\n3\n \nCE 209\nFundamentals of Surveying\n2\n \nEMCH 315\nMechanical Response of Engineering Materials\n2\n \nEMCH 316\nExperimental Determination of Mechanical Response of Materials\n1\n \nSupporting Courses and Related Areas\n \nSelect 11 credits from technical courses on department list\n \n1\n11"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Biological engineering bs": {
        "program_description": "Program Description\n\n\nThis major helps prepare students for careers involving the application of engineering principles to agricultural and biological production systems, processing systems, and conservation of land and water resources. Education in mathematics, physics, and engineering sciences common to all engineering disciplines is provided along with specialized training in biological and agricultural sciences. The curriculum covers all areas of biological engineering, including development of machines for biological processing and agriculture, postharvest handling and processing, natural resource management and utilization, biological processes, food engineering, and structures and their environmental modifications. A student must select the Agricultural Engineering option, Food and Biological Processing Engineering option, or the Natural Resources Engineering option.\n \nPrinciples of engineering design experiences are integrated throughout the third-year curriculum by having students solve problems typical of those encountered in the agricultural and biological engineering profession. A year-long major design experience in the fourth year emphasizes that biological engineers must learn not only how to develop engineering solutions to unique, practical problems using the newest technology, but also to assess and integrate the social and ethical implications of their solutions.\n \nCareers for graduates include design, development, and research engineering positions involving biological processes, machinery development, natural resources management, materials handling, biological product development, and structural systems for animals, plants, and crop storage. Biological engineers are employed in industry, consulting firms, and governmental agencies in the United States and abroad. Graduates deal with the various engineering aspects associated with production and processing of food, fiber, and other biological materials, within the constraints of environmental protection and natural resource conservation.\n\n\nWhat is Biological Engineering?\n\n\nBiological Engineering involves the study of engineering fundamentals, very similar to traditional engineering disciplines like chemical, civil, or mechanical engineering. What makes Biological Engineering unique is the integration of these engineering fundamentals with biological, agricultural, and environmental sciences and the holistic approach taken to studying agricultural production, processing of food and other bio-based materials, and natural resource protection. Problem-solving skills are developed and then applied to grand engineering challenges such as sustainably providing safe food and clean water.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy quantitative problem solving and working with your hands and/or working outdoors.\n\n\nYou are interested in a career where you address challenges related to fundamental societal needs, like food, water, fiber, and renewable energy.\n\n\nYou are passionate about sustainability.\n\n\nYou want to take application-focused classes with interactive labs and hands-on learning opportunities.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 2.60\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBE 404\nEngineering Properties of Food and Biological Materials\n3\n \nBE 460W\nBiological Engineering Design I\n2\n \nBE 466W\nBiological Engineering Design II\n2\n \nCHEM 111\nExperimental Chemistry I \n1\n \nMATH 231\nCalculus of Several Variables\n2\n \nPHYS 212\nGeneral Physics:  Electricity and Magnetism \n4\n \nPrescribed Courses: Require a grade of C or better\n \nBE 301\nMathematical Modeling of Biological and Physical Systems\n3\n \nBE 302\nHeat and Mass Transfer in Biological Systems\n4\n \nBE 305\nAgricultural Measurements and Control Systems\n3\n \nBE 308\nEngineering Elements of Biochemistry and Microbiology\n3\n \nBE 391\nCommunication Skills for BE and ABSM Students \n2\n \nBE 392\nLeadership and Ethics for BE and ABSM Students \n2\n \nCHEM 110\nChemical Principles I \n3\n \nEDSGN 100\nCornerstone Engineering Design\n3\n \nEMCH 211\nStatics\n3\n \nEMCH 212\nDynamics\n3\n \nEMCH 213\nStrength of Materials\n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nME 300\nEngineering Thermodynamics I\n3\n \nPHYS 211\nGeneral Physics:  Mechanics \n4\n \nAdditional Courses\n \nSelect one of the following:\n3\n \nIE 424\nProcess Quality Engineering\n \nSTAT 240\nIntroduction to Biometry \n \nSTAT 250\nIntroduction to Biostatistics \n \nSTAT/MATH 318\nElementary Probability\n \nSTAT 401\nExperimental Methods\n \nSTAT/MATH 418\nIntroduction to Probability and Stochastic Processes for Engineering\n \nAdditional Courses: Require a grade of C or better\n \nSelect one of the following:\n3\n \nCAS 100A\nEffective Speech \n \nCAS 100B\nEffective Speech \n \nCAS 100C\nEffective Speech \n \nCAS/ENGL 138T\nRhetoric and Civic Life II \n \nSelect one of the following:\n3\n \nENGL 15\nRhetoric and Composition \n \nENGL 30H\nHonors Rhetoric and Composition \n \nENGL/CAS 137H\nRhetoric and Civic Life I \n \nSelect one of the following:\n4\n \nMATH 251\nOrdinary and Partial Differential Equations\n \nMATH 250\n& \nMATH 252\nOrdinary Differential Equations\nand Partial Differential Equations\n \nRequirements for the Option\n \nSelect an option\n33-34",
            "specific_requirements": {
                "Agricultural Engineering Option (33 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nAdditional Courses\n \nAdditional Courses: Require a grade of C or better\n \nCE 360\nFluid Mechanics\n3\n \nor \nME 320\n Fluid Flow\n \nSupporting Courses and Related Areas\n \nSelect 3 credits in math/basic science\n \n1\n3\n \nSelect 6 credits in engineering science/design\n \n1\n6\n \nSelect 3 credits in agricultural/biological science\n \n1\n3\n \nSelect 6 credits in biological engineering\n \n1\n6\n \nSelect 6 credits in technical elective\n \n1,2\n6\n \nSupporting Courses and Related Area: Require a grade of C or better\n \nSelect 6 credits from the following:\n6\n \nBE 303\nStructural Systems in Agriculture\n \nBE 306\nMachines for Agricultural and Biological Processing\n \nBE 307\nPrinciples of Soil and Water Engineering",
                "Food and Biological Processing Engineering Option (33-34 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBE 465\nFood and Biological Process Engineering\n3\n \nBE 468\nMicrobiological Engineering\n3\n \nAdditional Courses\n \nCHEM 202\nFundamentals of Organic Chemistry I\n3\n \nor \nCHEM 210\n Organic Chemistry I\n \nSelect one of the following:\n3-4\n \nBIOL 230W\nBiology:  Molecules and Cells\n \nBMB 211\nElementary Biochemistry\n \nBMB/MICRB 251\nMolecular and Cell Biology I\n \nBME 201\nFundamentals of Cells and Molecules\n \nAdditional Courses: Require a grade of C or better\n \nCE 360\nFluid Mechanics\n3\n \nor \nME 320\n Fluid Flow\n \nSupporting Courses and Related Areas\n \nSelect 6 credits in biological/food science\n \n1\n6\n \nSelect 6 credits in engineering science/design\n \n1\n6\n \nSelect 6 credits in technical elective\n \n1,2\n6",
                "Natural Resources Engineering Option (33 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBE 467\nDesign of Stormwater and Erosion Control Facilities\n3\n \nBE 477\nLand-Based Waste Disposal\n3\n \nBE 487\nSimulation Modeling for Water Resources Management\n3\n \nSOILS 101\nIntroductory Soil Science \n3\n \nPrescribed Courses: Require a grade of C or better\n \nABSM 309\nMeasurement & Monitoring of Hydrologic Systems\n3\n \nBE 307\nPrinciples of Soil and Water Engineering\n3\n \nCE 360\nFluid Mechanics\n3\n \nSupporting Courses and Related Areas\n \nSelect 6 credits in engineering science/design\n \n1\n6\n \nSelect 3 credits in biological/environmental science\n \n1\n3\n \nSelect 3 credits in technical elective\n \n1,2\n3"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Biological engineering minor": {
        "program_description": "Program Description\n\n\nThis minor provides students with an opportunity to apply engineering principles to agricultural and biological production and processing systems and to the management of our natural resources. Courses may be selected by students to gain a better understanding of power and machinery, microbiological engineering, soil conservation and water quality, food process engineering, or structures and their environments.\n \nThe minor is particularly suitable for students pursuing an undergraduate degree in a different engineering major. Additional prerequisites for courses in the minor may be required including calculus through differential equations, engineering mechanics, fluid dynamics, or thermodynamics. Students interested in pursuing this minor should follow up with the contact provided under Academic Advising to discuss how the minor might integrate with their major and any other questions.\n\n\nWhat is Biological Engineering?\n\n\nBiological Engineering involves the study of engineering fundamentals, very similar to traditional engineering disciplines like chemical, civil, or mechanical engineering. What makes Biological Engineering unique is the integration of these engineering fundamentals with biological, agricultural, and environmental sciences and the holistic approach taken to studying agricultural production, processing of food and other bio-based materials, and natural resource protection. Problem-solving skills are developed and then applied to grand engineering challenges such as sustainably providing safe food and clean water.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are pursuing an engineering major and want to complement it with an engineering minor that offers a different perspective on the connections between agriculture, food, and environment.\n\n\nYou want to take application-focused classes with interactive labs and hands-on learning opportunities.\n\n\nYou are interested in solving problems related to fundamental societal needs, like food, water, fiber, and renewable energy.\n\n\nYou are passionate about sustainability.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Biomedical engineering technology aet": {
        "program_description": "Program Description\n\n\nThe medical community has grown to depend on medical devices and systems to diagnose, treat and monitor patients in health care. These medical devices have become very complex systems, as they are becoming microprocessor controlled, PC based, and networked to share information. Biomedical Equipment Technicians (BETs) are specialized individuals who are educated and trained on the methods of: physiological measurement; equipment application and operation; safety, performance and preventive maintenance testing; calibration; problem solving; and troubleshooting. In addition, BETs may be involved in equipment and technology management programs, selection and installation of medical equipment, manufacturer and FDA recalls of medical devices, quality improvement programs, and training programs for hospital personnel in the safe and proper use of medical equipment. The classroom and laboratory portions of this major focus on electronically and PC based medical devices for patient monitoring and life-support equipment. The student is exposed to a much broader spectrum of medical equipment through a 400-hour (ten-week) practical internship in an approved health care facility.\n \nStudents completing the 2BET degree need only complete several additional courses to obtain the Associate in Engineering Technology degree in Electrical Engineering Technology. Graduates of the program may qualify for admission to the baccalaureate degree major in Electrical Engineering Technology offered at Penn State Harrisburg, Electrical and Computer Engineering Technology offered at Penn State Erie, and Electro-Mechanical Engineering Technology offered at Penn State Altoona, Berks, New Kensington and York.\n\n\nWhat is Biomedical Engineering Technology?\n\n\nTechnicians in the biomedical engineering technology field are highly skilled, trained professionals who are responsible for functional and safety inspections, preventive maintenance, calibration, troubleshooting, equipment repair, and the training of hospital personnel in the safe and proper use of medical equipment.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in the healthcare industry.\n\n\nYou are passionate about technology and electronics.\n\n\nYou enjoy working both in a team and individually.\n\n\nYou know you want to work in a setting in which you operate, install, test, maintain and inspect mechanical and electronic equipment.",
        "entrance_to_major": "Entrance to Major\n\n\nStudents must have a minimum 2.0 GPA to change to this Associate degree after admission to the University.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Biomedical engineering bs": {
        "program_description": "Program Description\n\n\nThe Biomedical Engineering curriculum emphasizes the continuous integration of classical and modern engineering principles with the life sciences and health care. Biomedical Engineers apply these skills to innovation in the health care industry, basic biological sciences, and the underpinning of medical practice.\n \nConsistent with the mission of Penn State University and the College of Engineering, the Penn State Bachelor of Science program in Biomedical Engineering aims to create world-class engineers who will, after graduation, contribute to social and economic development through the application of engineering to the solution of problems in medicine and biology.\n\n\nWhat is Biomedical Engineering?\n\n\nBiomedical engineering is the application of the life sciences, mathematics, and engineering principals to define and solve problems in biology, medicine, healthcare, and other related fields. Biomedical engineers work to design, create, and improve medical devices such as prosthetics, artificial organs and medical imaging devices. They also develop instrumentation, medical information systems, and health management and care delivery systems to improve health care organizations. Many graduates of the biomedical engineering Bachelor of Science program also go on to pursue advanced degrees in medicine, engineering and related fields such as biostatistics, public health, and health administration.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou like applying traditional engineering skills and analysis to understand biological systems.\n\n\nYou want to emphasize the integration of classical and modern engineering principles with the life sciences and healthcare.\n\n\nYou are passionate about bridging the gap between medical professionals and the engineering community.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBME 303\nBio-continuum Mechanics\n3\n \nBME 403\nBiomedical Instrumentation Laboratory\n1\n \nBME 429\nBiomedical Mechanics and Techniques Laboratory\n2\n \nBME 440\nBiomedical Engineering Professional Seminar\n1\n \nBME 450W\nBiomedical Senior Design\n3\n \nCHEM 111\nExperimental Chemistry I \n1\n \nCHEM 112\nChemical Principles II \n3\n \nCHEM 113\nExperimental Chemistry II \n1\n \nEMCH 210\nStatics and Strength of Materials\n5\n \nMATH 230\nCalculus and Vector Analysis\n4\n \nPrescribed Courses: Require a grade of C or better\n \nBME 201\nFundamentals of Cells and Molecules\n3\n \nBME 301\nAnalysis of Physiological Systems\n4\n \nBME 313\nThermodynamics for Biomedical Engineering\n3\n \nBME 401\nNumerical Simulations in Biomedical Engineering\n3\n \nBME 402\nBiomedical Instrumentation and Measurements\n3\n \nCHEM 110\nChemical Principles I \n3\n \nCMPSC 200\nProgramming for Engineers with MATLAB \n3\n \nEDSGN 100\nCornerstone Engineering Design\n3\n \nENGL 202C\nEffective Writing: Technical Writing \n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nMATH 251\nOrdinary and Partial Differential Equations\n4\n \nPHYS 211\nGeneral Physics:  Mechanics \n4\n \nPHYS 212\nGeneral Physics:  Electricity and Magnetism \n4\n \nAdditional Courses\n \nSelect 1 credit of First-Year Seminar\n1\n \nECON 102\nIntroductory Microeconomic Analysis and Policy \n3\n \nor \nECON 104\n Introductory Macroeconomic Analysis and Policy \n \nAdditional Courses: Require a grade of C or better\n \nCAS 100A\nEffective Speech \n3\n \nor \nCAS 100B\n Effective Speech \n \nENGL 15\nRhetoric and Composition \n3\n \nor \nENGL 30H\n Honors Rhetoric and Composition \n \nSelect one of the following:\n4\n \nBIOL 141\n& \nBIOL 142\nIntroduction to Human Physiology \nand Physiology Laboratory\n \nBIOL 141\n& \nBIOL 162\nIntroduction to Human Physiology \nand Human Anatomy and Physiology I - Laboratory \n \nBIOL 141\n& \nBIOL 164\nIntroduction to Human Physiology \nand Human Anatomy and Physiology II - Laboratory \n \nBIOL 240W\nBiology:  Function and Development of Organisms\n \nSupporting Courses and Related Areas\n \nSelect 3 credits of Science or Engineering Elective courses from departmental list\n3\n \nRequirements for the Option\n \nSelect an option\n23-24",
            "specific_requirements": {
                "Biochemical Option (24 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBME 409\nBiofluid Mechanics\n3\n \nBME 413\nMass Transport in Biological Systems\n3\n \nBME 423\nReaction Kinetics of Biological Systems\n3\n \nAdditional Courses\n \nCHEM 202\nFundamentals of Organic Chemistry I\n3\n \nor \nCHEM 210\n Organic Chemistry I\n \nSupporting Courses and Related Areas\n \nSelect 9 credits from Biochemical Option department list\n9\n \nSelect 3 credits from Related Electives department list\n3",
                "Medical Imaging and Devices Option (23 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBME 406\nMedical Imaging\n3\n \nEE 210\nCircuits and Devices\n4\n \nAdditional Courses\n \nSelect 4 credits from the following:\n4\n \nCMPEN 270\nDigital Design: Theory and Practice\n \nCMPEN 271\n& \nCMPEN 275\nIntroduction to Digital Systems\nand Digital Design Laboratory\n \nEE 310\nElectronic Circuit Design I\n \nEE 330\nEngineering Electromagnetics\n \nSupporting Courses and Related Areas\n \nSelect 6 credits from the Related Electives department list\n6\n \nSelect 6 credits from Medical Imaging and Device Option department list\n6",
                "Biomaterials Option (24 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBME 443\nBiomedical Materials\n3\n \nBME 446\nPolymers in Biomedical Engineering\n3\n \nMATSE 201\nIntroduction to Materials Science\n3\n \nAdditional Courses\n \nBME 408\nSolid Mechanics of Biological Materials\n3\n \nor \nBME 409\n Biofluid Mechanics\n \nor \nBME 413\n Mass Transport in Biological Systems\n \nCHEM 202\nFundamentals of Organic Chemistry I\n3\n \nor \nCHEM 210\n Organic Chemistry I\n \nSupporting Courses and Related Areas\n \nSelect 3 credits from Related Electives department list\n3\n \nSelect 6 credits from Biomaterials Option department list\n6",
                "Biomechanics Option (24 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nBME 408\nSolid Mechanics of Biological Materials\n3\n \nBME 409\nBiofluid Mechanics\n3\n \nEMCH 212\nDynamics\n3\n \nEMCH 315\nMechanical Response of Engineering Materials\n2\n \nEMCH 316\nExperimental Determination of Mechanical Response of Materials\n1\n \nSupporting Courses and Related Areas\n \nSelect 9 credits from Biomechanics Option department list\n9\n \nSelect 3 credits from Related Electives department list\n3"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Biomedical engineering minor": {
        "program_description": "Program Description\n\n\nThis interdisciplinary minor is designed for students interested in the application of engineering principles to medical and biological problems. The minor is particularly suitable for students pursuing an undergraduate degree in a different engineering major, physics, or other applied science who are seeking careers in health-related professions. Students interested in pursuing this minor should contact the Department of Biomedical Engineering with any questions or for more information.\n\n\nWhat is Biomedical Engineering?\n\n\nBiomedical engineering is the application of the life sciences, mathematics, and engineering principals to define and solve problems in biology, medicine, healthcare, and other related fields. Biomedical engineers work to design, create, and improve medical devices such as prosthetics, artificial organs and medical imaging devices. They also develop instrumentation, medical information systems, and health management and care delivery systems to improve health care organizations. Many graduates of the biomedical engineering Bachelor of Science program also go on to pursue advanced degrees in medicine, engineering and related fields such as biostatistics, public health, and health administration.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou like applying traditional engineering skills and analysis to understand biological systems.\n\n\nYou want to emphasize the integration of classical and modern engineering principles with the life sciences and healthcare.\n\n\nYou are passionate about bridging the gap between medical professionals and the engineering community.\n\n\nYou're interested in medical research, teaching, industrial and government healthcare and medical practice.",
        "entrance_to_major": "Entrance to Minor\n\n\nPHYS 211\n, \nPHYS 212\n, and calculus through differential equations (\nMATH 250\n or \nMATH 251\n) are required for entrance to the minor. Additional prerequisites for prescribed and supporting courses may be required and should be researched prior to applying for the minor (e.g. \nCHEM 112\n and \nCMPSC 200\n).",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Chemical engineering bs": {
        "program_description": "Program Description\n\n\nChemical Engineering is one of the most versatile professions--you'll find Chemical Engineers employed in a broad array of industries ranging from pharmaceutical and biotechnical companies to semiconductor manufacturing to start-up companies converting the latest laboratory discoveries to large-scale commercial production. Chemical Engineers work with catalysts to develop new ways to manufacture medicines and plastics; they develop control systems that enable the safe production of products from semiconductors to household soap; they design chemical and petroleum plants; they research the effects of artificial organs on blood flow; and they develop the equipment and processes necessary for advances in biotechnology. While chemistry emphasizes the facts and principles of science, chemical engineering emphasizes its practical application for the development of new products and processes.\n \nThe undergraduate program in Chemical Engineering provides students with fundamental skills in problem solving, analysis, and design, along with hands-on experience in practical applications. The curriculum builds upon the traditional foundation in the chemical and energy-related industries and introduces new material in the life sciences, polymers, and environmental fields.\n\n\nWhat is Chemical Engineering?\n\n\nChemical engineers draw extensively on a strong foundation in the chemical, physical, and biological sciences. They focus on the processes involved in making new products or treating the environment, such as pharmaceuticals, plastics, alternative fuels, therapeutic proteins, and artificial organs. Chemical engineering is a broad discipline that encompasses many different scientific principles in engineering and technology. Chemical engineers apply the principles of chemistry, biology, and physics to solve problems involving the production of chemicals, fuel, drugs, food and energy solutions.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou like to problem solve using chemistry and mathematics in critical global challenges in a variety of areas including pharmaceuticals, food, energy, environmental sustainability, medicine, law, and finance.\n\n\nYou like to work with others to design processes and equipment to create chemical products safely and economically.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Civil engineering bs": {
        "program_description": "Program Description\n\n\nThe program in Civil and Environmental Engineering is designed to provide the basic undergraduate education required for private practice and public service in civil engineering and/or continue formal education. Emphasis is placed on the fundamentals of civil engineering principles and design techniques. Students utilize basic engineering science concepts in several of the different specialty areas (e.g., construction/management, environmental, materials/pavement design/geotechnical, structures, transportation, and water resources). Finally the students are able to choose an area of specialization for professional practice or graduate studies.\n \nThe program is broadened by courses in communication, arts, humanities, social and behavioral sciences, as well as other engineering disciplines. Students gain experience in working as members of a team and using interdisciplinary approaches to solve problems. These experiences, as well as those related to engineering principles and design, are provided through exercises in the classroom, laboratory, and field. The program culmination is a capstone design course wherein the students' knowledge and skills are applied to actual engineering problems.\n\n\nWhat is Civil Engineering?\n\n\nCivil engineering is one of the oldest and most socially-relevant engineering disciplines. Grounded in mathematics and science, civil engineers make a lasting impact as they plan, design, construct, operate, and maintain the everyday, yet critical, infrastructure systems needed in our daily lives. In this challenging and diverse field, civil engineers also find solutions for critical environmental issues, including slowing the progress and mitigating the effects of climate change, eliminating the causes and treating the effects of environmental pollutants, and providing access to clean water. In recent years, the rapid application of new technologies has fostered the development of autonomous vehicles, 3D printing, smart structures, advanced materials, and new forms of renewable energy.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to design and build large-scale projects that last a long time.\n\n\nYou care about the quality of the water that comes out of the faucet.\n\n\nYou are interested in the operations and safety of future transportation systems.\n\n\nYou try to find sustainable solutions for every challenge, big or small.\n\n\nYou would like to use your technical skills in an exciting, people-serving profession.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Computational sciences minor": {
        "program_description": "Program Description\n\n\nThe Computational Sciences minor provides the necessary skills to use computers to study and solve scientific, engineering and data-centric problems across a wide range of disciplines. The minor complements the areas of theory and experimentation found in traditional scientific and engineering studies through the use of computational modeling, algorithm design, and event-driven programming. Students will customize the minor by selecting two advanced courses in their discipline or related areas that build upon the computational foundations provided in prescribed courses. The minor will prepare students with the skills necessary to apply computational methods in a variety of scientific and engineering disciplines.\n\n\nWhat is Computational Sciences?\n\n\nComputational Sciences is the study and application of computational methods to understand, analyze and solve complex problems. It includes the design, development and evaluation of models and simulations of natural systems and complements traditional methods of theory and laboratory experiments. It seeks to provide a deeper understanding of scientific and engineering problems through the mathematical modeling of complex systems. A core topic is the design, implementation and evaluation of algorithms, both numerical and non-numerical, that address problems across a broad range of science and engineering disciplines.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou like to analyze and solve complex problems.\n\n\nYou excel in mathematics.\n\n\nYou want to apply computational methods to your discipline.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Computer engineering bs": {
        "program_description": "Program Description\n\n\nThe mission of the faculty of the undergraduate computer engineering program at Penn State is to provide students with the knowledge and experience needed to pursue a productive lifelong career in industry or to engage in further study at the graduate level. Students participate in a balanced program of instruction covering the basic principles of the design and application of computer systems. The program includes coverage in breadth and depth of basic science, engineering, and abstract concepts of information handling. Students specialize in and are prepared for careers in the design, analysis and use of hardware, software and systems. The program is structured to ensure that graduates have a clear understanding of the design and the applications of computers, as well as the ability to apply this knowledge throughout their professional careers.\n\n\nWhat is Computer Engineering?\n\n\nComputer engineering is the study of the design, analysis, and implementation of computer systems including processors, memory, embedded devices, and data communication systems for a wide range of application domains. It includes the study of digital systems, computer architecture, and computer networks. It encompasses many design activities spanning from designing individual logic components to designing complete computer systems composed of hardware, software, and hardware-software co-design. Computer engineering drives the development of new computing systems that enable the latest technologies impacting our everyday lives.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou excel in math and physics and have an interest in designing and constructing computer hardware\n\n\nYou want to build and analyze physical computing devices that go beyond traditional computers\n\n\nYou want to understand how current computer hardware and software work and how to design the next generation hardware and its supporting software\n\n\nYou want to design computing systems that impact and improve everyday lives",
        "entrance_to_major": "Entrance to Major\n\n\nThis program currently has administrative enrollment controls. Administrative Enrollment Controls are initiated when limitations of space, faculty, or other resources in a major prevent accommodating all students who request them. Students must follow the administrative enrollment controls that are in effect for the semester that they enter the university.\n \nFirst-Year Students Entering Summer 2024, Fall 2024, Spring 2025\n \nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n\n\n\n\nbe enrolled in the College of Engineering or the Division of Undergraduate Studies\n\n\n29-55 graded Penn State credits (excludes transfer and AP credits)\n\n\ncompleted with a grade of C or better: \nCMPSC 121\n or \nCMPSC 131\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n\n\nearned a minimum cumulative grade-point average (GPA) of 3.20\n\n\n\n\nStudents Who Entered Prior to Summer 2024\n \nStudents who entered the University from Summer 2018 through Spring 2024 should view the administrative enrollment controls in the appropriate \nUndergraduate Bulletin archive\n. Students who entered the University prior to the summer 2018 semester should consult with their academic adviser about the administrative enrollment controls in effect for the semester they entered the university.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Computer engineering minor": {
        "program_description": "Program Description\n\n\nThe Computer Engineering Minor provides students with the fundamental topics of computer hardware design, including digital logic design, computer organization, computer communication networks and computer architecture. Complimenting these core topics are elective courses in areas including embedded systems, digital integrated circuits, field programmable devices, and functional verification. This minor complements disciplines related to computing and that make use of specialized computing hardware. Students in majors related to computer engineering will already have the mathematics and physics background to pursue this major without taking additional foundational courses.\n\n\nWhat is Computer Engineering?\n\n\nComputer engineering is the study of the design, analysis, and implementation of computer systems including processors, memory, embedded devices, and data communication systems for a wide range of application domains. It includes the study of digital systems, computer architecture, and computer networks. It encompasses many design activities spanning from designing individual logic components to designing complete computer systems composed of hardware, software, and hardware-software co-design. Computer engineering drives the development of new computing systems that enable the latest technologies impacting our everyday lives.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou excel in math and physics and have an interest in working with computer hardware.\n\n\nYou want to understand how current computer hardware and software work together.\n\n\nYou want to work with computing systems that impact and improve everyday lives.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Computer science bs": {
        "program_description": "Program Description\n\n\nComputer Science is the study of computation, including its principles and foundations, its efficient implementation, its analysis, and its practical use in a wide range of different application areas. Computer Science is far more than just programming and no other science or engineering discipline has had a greater impact in such diverse areas as commerce, communication, entertainment, finance, medicine, the social sciences, the physical sciences and the life sciences. Computer Science impacts our daily lives in a multitude of ways and computer scientists are instrumental in driving these changes. Computer Science transforms the way we look at and live in our world.\n \nThe mission of our undergraduate program is to prepare our students fora wide range of careers as computer scientists, software engineers, software developers, and related positions in the field of computing. Our curriculum covers fundamental programming techniques and skills, broad knowledge of computer hardware, operating systems, programming languages, the mathematical foundations of computing, and advanced topics in software design and application development. Recurrent themes in the program include security, algorithmic complexity, cooperating systems, performance evaluation, and software correctness. This curriculum provides students with the skills needed to design, develop, evaluate, and analyze software solutions to a wide spectrum of computational problems and prepares them to be leaders in the rapidly changing field of computing throughout their careers.\n\n\nWhat is Computer Science?\n\n\nComputer science is the study of computational methods, including their principles and foundations, their efficient implementation, their analyses, and their practical application in wide-ranging areas. It includes the foundations of software development, computational problem solving, the principles of system software, and the fundamental principles and limits of computing. It is much more than just programming. It includes the mathematical foundations that support analyzing, evaluating, and proving the correctness of computational solutions. It includes specializations such as artificial intelligence, machine learning, cybersecurity, data mining, high-performance computing, computer networks, computer graphics, computer vision, quantum computing, and others. It is continually evolving with the development of new and faster forms of computation and with the identification of new problems that require computational solutions.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in creating solutions to challenging problems involving computers\n\n\nYou want to understand how to build and analyze complex software solutions\n\n\nYou want to understand how computer hardware and software work and how to make them better\n\n\nYou want to design software that impacts and improves people’s everyday lives",
        "entrance_to_major": "Entrance to Major\n\n\nUniversity Park (CMPSC_BS)\n\n\nThis program currently has administrative enrollment controls. Administrative Enrollment Controls are initiated when limitations of space, faculty, or other resources in a major prevent accommodating all students who request them. Students must follow the administrative enrollment controls that are in effect for the semester that they enter the university.\n \nFirst-Year Students Entering Summer 2024, Fall 2024, Spring 2025\n \nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n\n\n\n\nbe enrolled in the College of Engineering or the Division of Undergraduate Studies\n\n\n29-55 graded Penn State credits (excludes transfer and AP credits)\n\n\ncompleted with a grade of C or better: \nCMPSC 121\n or \nCMPSC 131\n, \nCMPSC 122\n or \nCMPSC 132\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n\n\nearned a minimum cumulative grade-point average (GPA) of 3.20\n\n\n\n\nStudents Who Entered Prior to Summer 2024\n \nStudents who entered the University from Summer 2018 through Spring 2024 should view the administrative enrollment controls in the appropriate \nUndergraduate Bulletin archive\n. Students who entered the University prior to the summer 2018 semester should consult with their academic adviser about the administrative enrollment controls in effect for the semester they entered the university.\n\n\nBeaver, Brandywine, Hazleton (CSENG_BS)\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nCMPSC 121\n or \nCMPSC 131\n, \nCMPSC 122\n or \nCMPSC 132\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 2.60\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Cybersecurity computational foundations minor": {
        "program_description": "Program Description\n\n\nThe Cybersecurity Minor offered by the Department of Computer Science and Engineering is designed for students in computational majors who wish to acquire the technical depth to design and construct secure cyber systems. Building upon a core computer science foundation the minor includes courses in computer security, mobile and wireless security, software security and networking. Additional courses in the minor provide areas of application such as operating systems, database systems, and computer architecture, in which issues of security arise. The minor prepares students for careers as technical professionals working with secure cyber systems and for graduate study in computer, network and systems security.",
        "entrance_to_major": "Entrance to Minor\n\n\nAny student wishing entrance to the minor should have successfully completed all the prerequisite courses: \nCMPSC 121\n or \nCMPSC 131\n, \nCMPSC 122\n or \nCMPSC 132\n, \nCMPSC 221\n, \nCMPSC 311\n, \nCMPSC 360\n, \nCMPEN 270\n/\nCMPEN 271\n, \nCMPEN 331\n, and \nSTAT 318\n or \nSTAT 414\n or \nSTAT 418\n.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Data sciences bs": {
        "program_description": "Program Description\n\n\nData Sciences is a field of study concerned with developing, applying, and validating methods, processes, systems, and tools for drawing useful knowledge, justifiable conclusions, and actionable insights from large, complex and diverse data through exploration, prediction, and inference. Data Sciences integrate aspects of Computer Science, Informatics, and Statistics to yield powerful data science methods, systems, tools, and best practices that find applications across a broad range of application domains. The curriculum for the major is designed to equip students with the knowledge and the skills needed to elicit, formulate, and solve data sciences problems using modern data science methods, tools, and best practices for data management, data exploration, data integration, predictive modeling (using machine learning), and effectively communicate their findings to, and collaborate with a broad range of stakeholders. The students will gain the critical analytical skills needed to assess the feasibility, benefits, effectiveness, limitations, risks, and ethical implications of applying data sciences methods in different settings. Experiences such as the capstone project prepare students to function effectively as members of interdisciplinary data science teams to harness the potential of data to enable discovery, optimize products and processes, and inform decisions. As distinct from majors that focus primarily on developing data science knowledge and skills to support inquiry in other domains, the primary focus of the Data Sciences major is on the development, evaluation, application, and validation of the data science tools themselves. All students in the major receive in-depth training in data sciences through a set of core courses. Additionally, data sciences students specialize in one of the following options: applied, computational, or statistical modeling data sciences, as described below.\n \nApplied Data Sciences (DATSC_BS)\n \nOnly available through the College of Information Sciences and Technology\n \nThe students in the Applied DS option will receive exposure to an application domain so they are equipped to formulate and solve data science problems drawn from the chosen domain, e.g., life and health sciences, business, behavioral and cognitive sciences, physical sciences, agricultural sciences, among others.\n \nComputational Data Sciences (DTSCE_BS)\n \nOnly available through the College of Engineering\n \nThe students in the Computational DS option will receive additional training in Computer Science to be able to design, analyze, implement, and deploy advanced algorithms, hardware and software architectures, and systems for data management and analyses.\n \nStatistical Modeling Data Sciences (DTSCS_BS)\n \nOnly available through the Eberly College of Science\n \nThe students in the Statistical modeling DS option will receive additional training in Statistics to be able to formulate, develop, and apply the proper statistical models and methods for data analyses, e.g., experiment design, sampling, hypotheses testing, and limiting false discovery.\n\n\nWhat is Data Sciences?\n\n\nData Sciences is a field that explores the methods, systems, and processes used to extract knowledge from data and turn these insights into discoveries, decisions, and actions. The emergence of massive amounts of data – also known as “big data” – found in our world through healthcare records, human sensors, digital media, and a number of other sources has increased the need for individuals who can obtain useful knowledge from big data and apply it to address major societal challenges across a variety of fields. Students pursuing this degree will develop the knowledge and skills needed to manage and analyze large-scale, unstructured data to address an expanding range of problems in industry, government, and academia.\n\n\nMORE INFORMATION ABOUT DATA SCIENCES\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are curious about analyzing information to discover new insights.\n\n\nYou want to apply data analytics to make strategic decisions.\n\n\nYou want to understand how data can be used to visualize phenomena using AI and data science techniques.\n\n\nYou are interested in statistics, mathematics, and the social sciences, and want to combine these disciplines to understand what data is really telling us.\n\n\n\n\nMORE INFORMATION ABOUT WHY STUDENTS CHOOSE TO STUDY DATA SCIENCES",
        "entrance_to_major": "Entrance to Major\n\n\nTo be eligible for entrance into the Data Sciences major, a degree candidate must satisfy requirements for entrance to the major.\n \nSpecific entrance requirements include:\n \n \nThe degree candidate must be taking, or have taken, a program appropriate for entry to the major as shown in the bulletin.\n \nThe degree candidate must complete the following entrance-to-major requirements: \nCMPSC 121\n* or \nCMPSC 131\n*, \nCMPSC 122\n* or \nCMPSC 132\n*, \nMATH 140\n*, \nMATH 141\n*, \nSTAT 200\n*\n or \nDS 200\n*. These courses must be completed by the end of the semester during which the entrance to major process is carried out.\n \n \n*\nCourse requires a grade of C or better.",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nPrescribed Courses: Require a grade of C or better\n \nDS 220\nData Management for Data Sciences\n3\n \nDS 340W\nApplied Data Sciences\n3\n \nDS 435\nEthical Issues in Data Science Practice\n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nMATH 220\nMatrices \n2\n \nSTAT 184\nIntroduction to R \n2\n \nSTAT 380\nData Science Through Statistical Reasoning and Computation\n3\n \nAdditional Courses\n \nAdditional Courses: Require a grade of C or better\n \n1 credit of First-Year Seminar\n1\n \nCMPSC 121\nIntroduction to Programming Techniques\n3\n \nor \nCMPSC 131\n Programming and Computation I: Fundamentals\n \nCMPSC 122\nIntermediate Programming\n3\n \nor \nCMPSC 132\n Programming and Computation II: Data Structures\n \nDS 440\nData Sciences Capstone Course\n3\n \nor \nDS 440W\n Data Science Capstone\n \nRequirements for the Option\n \nSelect an option\n38-47",
            "specific_requirements": {
                "Applied Data Sciences (DATSC_BS): 47 credits": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nPrescribed Courses: Require a grade of C or better\n \nDS 200\nIntroduction to Data Sciences\n4\n \nDS 300\nPrivacy and Security for Data Sciences\n3\n \nDS 305\nAlgorithmic Methods and Tools\n3\n \nDS 310\nMachine Learning for Data Analytics\n3\n \nDS 320\nData Integration\n3\n \nDS 330\nVisual Analytics for Data Sciences\n3\n \nDS/CMPSC 410\nProgramming Models for Big Data\n3\n \nIST 495\nInternship\n1\n \nAdditional Courses\n \nSelect 6 credits from any combination:\n6\n \nDS 402\nEmerging Trends in the Data Sciences\n \nDS 420\nNetwork Analytics\n \nDS/CMPSC 442\nArtificial Intelligence\n \nDS 494\nResearch Project\n \nIST 441\nInformation Retrieval and Organization\n \nIST 442\nInformation Technology in an International Context\n \nSODA 308\nResearch Design for Social Data Analytics\n \nAdditional Courses: Require a grade of C or better\n \nSelect 3 credits from the following:\n3\n \nCMPSC 360\nDiscrete Mathematics for Computer Science\n \nIST 230\nLanguage, Logic, and Discrete Mathematics\n \nMATH 311W\nConcepts of Discrete Mathematics\n \nSelect 3 credits from the following:\n3\n \nSTAT/MATH 318\nElementary Probability\n \nSTAT/MATH 414\nIntroduction to Probability Theory\n \nSTAT/MATH 418\nIntroduction to Probability and Stochastic Processes for Engineering\n \nSupporting Courses and Related Areas\n \n1\n \nSelect 12 credits from the lists of Application Focus courses; 6 credits must at at the 300- or 400-levels.\n12",
                "Computational Data Sciences (DTSCE_BS): 47 credits": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nPrescribed Courses: Require a grade of C or better\n \nCMPSC 221\nObject Oriented Programming with Web-Based Applications\n3\n \nCMPSC 360\nDiscrete Mathematics for Computer Science\n3\n \nCMPSC 442\nArtificial Intelligence\n3\n \nCMPSC 448\nMachine Learning and Algorithmic AI\n3\n \nCMPSC 461\nProgramming Language Concepts\n3\n \nCMPSC 465\nData Structures and Algorithms\n3\n \nDS/CMPSC 410\nProgramming Models for Big Data\n3\n \nMATH 230\nCalculus and Vector Analysis\n4\n \nSTAT/MATH 414\nIntroduction to Probability Theory\n3\n \nSTAT/MATH 415\nIntroduction to Mathematical Statistics\n3\n \nAdditional Courses\n \nAdditional Courses: Require a grade of C or better\n \nDS 200\nIntroduction to Data Sciences\n4\n \nor \nSTAT 200\n Elementary Statistics \n \nSupporting Courses and Related Areas\n \n1\n \nSelect 6 credits from Computational Option List A in Appendix C\n6\n \nSelect 6 credits from Computational Option List B in Appendix C\n6",
                "Statistical Modeling Data Sciences (DTSCS_BS): 38 credits": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nPrescribed Courses: Require a grade of C or better\n \nMATH 230\nCalculus and Vector Analysis\n4\n \nSTAT/MATH 414\nIntroduction to Probability Theory\n3\n \nSTAT/MATH 415\nIntroduction to Mathematical Statistics\n3\n \nSTAT 440\nComputational Statistics\n3\n \nSTAT 462\nApplied Regression Analysis\n3\n \nAdditional Courses\n \nAdditional Courses: Require a grade of C or better\n \nDS 200\nIntroduction to Data Sciences\n4\n \nor \nSTAT 200\n Elementary Statistics \n \nDS 310\nMachine Learning for Data Analytics\n3\n \nor \nCMPSC 448\n Machine Learning and Algorithmic AI\n \nMATH 311W\nConcepts of Discrete Mathematics\n3\n \nor \nCMPSC 360\n Discrete Mathematics for Computer Science\n \nSupporting Courses and Related Areas\n \n1\n \nSelect 6 credits from Statistical Modeling Option List A courses, see Appendix D\n6\n \nSelect 6 credits from Statistical Modeling Option List B courses, see Appendix D\n6"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Electrical engineering technology aengt": {
        "program_description": "Program Description\n\n\nThe Electrical Engineering Technology (2EET) major helps prepare graduates for technical positions in the expanding fields of electronics, computers and microprocessors, instrumentation, and electrical equipment. The primary objective is to provide a broad foundation of theoretical and practical knowledge in the areas of electrical and electronic circuits, digital circuits, computers, electrical machinery, and programmable logic controls.\n \nGraduates of the Electrical Engineering Technology major may qualify for admission to the baccalaureate degree majors in Electrical Engineering Technology offered at Penn State Harrisburg, Capital College; the baccalaureate degree major in Electrical and Computer Engineering Technology at Penn State Erie, The Behrend College; or the baccalaureate degree major in Electro-Mechanical Engineering Technology offered at Penn State Altoona, Penn State Berks, Penn State New Kensington or Penn State York. Two baccalaureate tracks are available to streamline the transition to these degree programs. Students interested in pursuing the baccalaureate degree major of Electrical Engineering Technology at Penn State Harrisburg should follow track c. A general track is also provided for students who decide not to continue their engineering technology education at the baccalaureate level.\n\n\nWhat is Electrical Engineering Technology?\n\n\nElectrical engineering technology focuses on the planning, designing, installing, operating, and maintaining electrical power systems and electronic devices. Electrical engineering technicians assist engineers with the manufacture, installation, operation, design, and repair of a wide range of electronic products.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in science and technology but prefer spending time applying your skills in a laboratory or field setting as opposed to studying the theory behind these subjects in a classroom setting. If you like to know how things that are controlled by electronics work, from computers to robotics, this may be for you. While theory is covered in this major, there is a greater emphasis on the application of theory with much of what you learn in the classroom being built as lab experiments.",
        "entrance_to_major": "Entrance to Major\n\n\nStudents must have a minimum 2.0 GPA to change to this Associate degree after admission to the University.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Electrical engineering technology bs": {
        "program_description": "Program Description\n\n\nThe Bachelor of Science graduate with a major in Electrical Engineering Technology (EET) is an engineering technologist who can bridge the gap between scientific advancement and practical electrical devices and systems. Research in all fields of electrical engineering has produced an abundance of new knowledge in recent years. Many of these advanced scientific achievements have been unused due to the shortage of engineering technologists specifically educated to convert scientific information into practical devices and systems.\n \nThe EET major helps equip students with the various skills necessary to adapt new scientific knowledge to new products. Technical selections are offered in the senior year to provide some degree of specialization, but all graduates receive a well-rounded basic education in electrical and electronic design principles. The strengths of the program include: an applied hands-on program; extensive laboratory experience; promising job placement; and accreditation by the Engineering Technology Accreditation Commission of the Accreditation Board for Engineering and Technology, 111 Market Place, Suite 1050, Baltimore, MD 21202-4012, telephone 410-347-7700, Web at \nhttps://www.abet.org\n.\n \nEET graduates who wish to continue their professional development can take the Fundamentals of Engineering examination in Pennsylvania, a prerequisite for taking the Professional Engineering examination.\n\n\nWhat is Electrical Engineering Technology?\n\n\nElectrical engineering technology (EET) is an engineering technology field that implements and applies the principles of electrical engineering. Like electrical engineering, EET deals with the design, application, installation, manufacturing, operation or maintenance of electrical/electronic systems. However, EET is a specialized discipline that has more focus on application, theory, and applied design, and implementation, while electrical engineering may have more of a generalized emphasis on theory and conceptual design.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy problem-solving and math.\n\n\nYou prefer practical rather than theoretical solutions, and application and implementation over conceptual modeling.\n\n\nYou enjoy working on multidisciplinary teams on complex problems.\n\n\nYou want to acquire knowledge to get a good job in industry.\n\n\nYou want to pursue a career as a technologist in sectors such as manufacturing, product design, testing, or technical services and sales.",
        "entrance_to_major": "Direct Admission to the Major\n \nIncoming first-year students who meet the program admission requirements are admitted directly into the major. Admission restrictions may apply for change-of-major and/or change-of-campus students.\n \nFor more information about the admission process for this major, please send a request to the college, campus, or program contact (listed in the Contact tab).",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nCHEM 110\nChemical Principles I \n3\n \nCHEM 111\nExperimental Chemistry I \n1\n \nEET 419\nCapstone Proposal Preparation\n1\n \nPrescribed Courses: Require a grade of C or better\n \nEET 312\nElectric Transients\n4\n \nEET 331\nElectronic Design\n4\n \nEET 420W\nElectrical Engineering Technology Capstone Design\n3\n \nENGL 202C\nEffective Writing: Technical Writing \n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nAdditional Courses\n \nCMPEH 472\nMicroprocessors\n3-4\n \nor \nCMPET 211\n Embedded Processors and DSP\n \nEE 310\nElectronic Circuit Design I\n4\n \nor \nEET 212W\n Op Amp and Integrated Circuit Electronics\n \nSelect 2-3 credits from the following:\n2-3\n \nEDSGN 100\nCornerstone Engineering Design\n \nEDSGN 100S\nIntroduction to Engineering Design\n \nEGT 119\nIntroduction to CAD for Electrical and Computer Engineering\n \nSelect 3 credits from the following:\n3\n \nCMPSC 101\nIntroduction to Programming \n \nCMPSC 121\nIntroduction to Programming Techniques\n \nCMPSC 131\nProgramming and Computation I: Fundamentals\n \nCMPSC 201\nProgramming for Engineers with C++ \n \nSelect 3-4 credits from the following:\n3-4\n \nPHYS 150\nTechnical Physics I \n \nPHYS 211\nGeneral Physics:  Mechanics \n \nPHYS 250\nIntroductory Physics I \n \nSelect 3-4 credits from the following:\n3-4\n \nPHYS 151\nTechnical Physics II \n \nPHYS 212\nGeneral Physics:  Electricity and Magnetism \n \nPHYS 251\nIntroductory Physics II \n \nSelect 3-4 credits from the following:\n3-4\n \nIE 424\nProcess Quality Engineering\n \nMATH 220\nMatrices \n \nMATH 230\nCalculus and Vector Analysis\n \nMATH 250\nOrdinary Differential Equations\n \nMATH/STAT 414\nIntroduction to Probability Theory\n \nMATH/STAT 418\nIntroduction to Probability and Stochastic Processes for Engineering\n \nSTAT 200\nElementary Statistics \n \nSTAT 401\nExperimental Methods\n \nSelect 4 credits from the following:\n4\n \nCMPEN 270\nDigital Design: Theory and Practice\n \nCMPEN 271\n& \nCMPEN 275\nIntroduction to Digital Systems\nand Digital Design Laboratory\n \nCMPET 117\n& \nCMPET 120\nDigital Electronics\nand Digital Electronics Laboratory\n \nSelect 3-5 credits from the following:\n3-5\n \nEE 485\nEnergy Systems and Conversion\n \nEET 213W\nFundamentals of Electrical Machines Using Writing Skills\n \nEET 214\n& \nEET 215\nElectric Machines and Energy Conversion\nand Electric Machines and Energy Conversion Laboratory\n \nAdditional Courses: Require a grade of C or better\n \nSelect 5-8 credits from the following:\n5-8\n \nEE 210\n& \nEE 317\nCircuits and Devices\nand Circuits II and Data Acquisition\n \nEET 310\nDirect and Alternating Current Circuits\n \nEET 311\n& \nEET 114\nAlternating Current Circuits\nand Electrical Circuits II\n \n1\n \nRequirements for the Option\n \nSelect an option\n26",
            "specific_requirements": {
                "General Electrical Engineering Technology Option (26 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nENGR 320Y\nDesign for Global Society \n3\n \nAdditional Courses\n \nSystem Elective\n \nSelect 8 credits of technical electives from the following:\n8\n \nEET 408\nCommunication System Design\n \nEET 409\nPower System Analysis I\n \nEET 433\nControl System Analysis and Design\n \nElectronics Elective\n \nSelect 4 credits from the following:\n4\n \nEE 413\nPower Electronics\n \nEET 402\nHigh-Frequency Circuit Design\n \nEET 431\nAdvanced Electronic Design\n \nEET 461\nPower Electronics\n \nEET 496\nIndependent Studies\n \nGEET Technical Electives\n \nSelect 8 credits of GEET technical electives from the following:\n8\n \nCMPEN 431\nIntroduction to Computer Architecture\n \nCMPET 401\nData Communication and Networking\n \nCMPET 402\nData Communication and Networking Laboratory\n \nCMPET 403\nSwitching Circuit Design\n \nCMPET 412\n \nEE 413\nPower Electronics\n \nEE 442\nSolid State Devices\n \nEE 453\nFundamentals of Digital Signal Processing\n \nEE/EGEE/ESC 456\nIntroduction to Neural Networks\n \nEE 458\nDigital Image Processing and Computer Vision\n \nEET 402\nHigh-Frequency Circuit Design\n \nEET 408\nCommunication System Design\n \nEET 409\nPower System Analysis I\n \nEET 410\nPower System Analysis II\n \nEET 413\nOptoelectronics\n \nEET 414\nBiomedical Instrumentation\n \nEET 431\nAdvanced Electronic Design\n \nEET 433\nControl System Analysis and Design\n \nEET 456\nAutomation and Robotics\n \nEET 461\nPower Electronics\n \nEET 478\nDigital Communication Systems\n \nEET 496\nIndependent Studies\n \nScience, Engineering, and Technology (SET Electives)\n \nSelect 3 credits from the following:\n3\n \nBIOL 141\nIntroduction to Human Physiology \n \nCHEM 112\nChemical Principles II \n \nCHEM 113\nExperimental Chemistry II \n \nCMPSC 122\nIntermediate Programming\n \nCMPSC 132\nProgramming and Computation II: Data Structures\n \nCMPSC 200\nProgramming for Engineers with MATLAB \n \nCMPSC 201\nProgramming for Engineers with C++ \n \nCMPSC 312\nComputer Organization and Architecture\n \nEE 330\nEngineering Electromagnetics\n \nEE 341\nSemiconductor Device Principles\n \nEMCH 211\nStatics\n \nEMCH 212\nDynamics\n \nEMCH 213\nStrength of Materials\n \nMATH 220\nMatrices \n \nMATH 230\nCalculus and Vector Analysis\n \nMATH 231\nCalculus of Several Variables\n \nMATH 232\nIntegral Vector Calculus\n \nMATH 250\nOrdinary Differential Equations\n \nMATH 251\nOrdinary and Partial Differential Equations\n \nMATH 252\nPartial Differential Equations\n \nMATH 430\nLinear Algebra and Discrete Models I\n \nME 201\nIntroduction to Thermal Science\n \nME 300\nEngineering Thermodynamics I\n \nPHYS 213\nGeneral Physics:  Fluids and Thermal Physics \n \nPHYS 214\nGeneral Physics:  Wave Motion and Quantum Physics \n \nPHYS 237\nIntroduction to Modern Physics\n \nPHYS 462\nApplications of Physics in Medicine\n \nSSET 495\nInternship\n \nSTAT 200\nElementary Statistics",
                "Power and Automation Option (26 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nAdditional Courses\n \nSystem Electives\n \nSelect 12 credits from the following:\n12\n \nEET 409\nPower System Analysis I\n \nEET 410\nPower System Analysis II\n \nEET 433\nControl System Analysis and Design\n \nEET 461\nPower Electronics\n \nEET 475\nIntermediate Programmable Logic Controllers\n \nAdditional Electives\n \nSelect 14 credits from the following:\n14\n \nCMPET 401\nData Communication and Networking\n \nCMPET 402\nData Communication and Networking Laboratory\n \nCMPET 403\nSwitching Circuit Design\n \nEET 341\nMeasurements and Instrumentation\n \nEET 402\nHigh-Frequency Circuit Design\n \nEET 408\nCommunication System Design\n \nEET 409\nPower System Analysis I\n \nEET 410\nPower System Analysis II\n \nEET 413\nOptoelectronics\n \nEET 414\nBiomedical Instrumentation\n \nEET 431\nAdvanced Electronic Design\n \nEET 433\nControl System Analysis and Design\n \nEET 456\nAutomation and Robotics\n \nEET 461\nPower Electronics\n \nEET 475\nIntermediate Programmable Logic Controllers\n \nEET 478\nDigital Communication Systems\n \nEET 495\nInternship\n \nEET 496\nIndependent Studies\n \nEET 497\nSpecial Topics\n \nEMCH 211\nStatics\n \nEMCH 212\nDynamics\n \nME 201\nIntroduction to Thermal Science"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Electrical engineering bs": {
        "program_description": "Program Description\n\n\nElectrical Engineering (EE) is one of the broadest of all engineering majors and is much more than just building electrical circuits. Electrical engineering is the application of electronics, electrical science and technology, and computer systems to the needs of society. An electrical engineer is responsible for designing and integrating electronic/electrical systems in diverse industries such as defense, communications, transportation, manufacturing, health care, construction, and entertainment.\n \nThe mission of our undergraduate program is to provide a high-quality education in electrical engineering for our students and to instill in them the attitudes, values, and vision that will prepare them for lifetimes of success, continued learning, and leadership in their chosen careers. A combination of required and elective courses ensures that students acquire a broad knowledge base in electrical circuits, digital systems, electronic devices, electromagnetics, and linear systems, as well as expertise in one or more areas of specialization. Additional problem-solving skills and practical experience are developed through design projects and laboratory assignments, which also provide opportunities for developing team-building and technical communication skills.\n\n\nWhat is Electrical Engineering?\n\n\nElectrical engineering is a broad discipline of study that includes circuit design, analog and digital electronics, electromagnetics, electro-optics, control systems, power systems, communications, and signal/image processing. Electrical engineers study and apply physics and mathematics to design electrical and electronic systems and their components for a wide range of applications such as mobile phones, wireless communications, consumer electronics, computers, computer networks, power generation, machine learning, robotics, nanoelectronics, nanophotonics, bioelectronics, autonomous transportation, wearable electronics, and metamaterials.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are good in math, physics and computer programming and want to use technical skills in these areas to solve real-world problems.\n\n\nYou are intrigued by the many applications of electronics and electrical systems in our world.\n\n\nYou want a degree that is very broad and can be applied to a wide range of career opportunities.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nCMPSC 121\n or \nCMPSC 131\n or \nEDSGN 100\n; \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 2.60\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Electro mechanical engineering technology bs": {
        "program_description": "Program Description\n\n\nThe Electro-Mechanical Engineering Technology (B.S. EMET) degree program provides the basic undergraduate education required for a career as an electro-mechanical engineer. The program emphasizes a breadth of knowledge in all fields of engineering technology related to typical, highly-automated manufacturing, production, or assembly plant processes. Basic coverage is provided in all major areas to technology involved in the operation and control of manufacturing and production processes, including instrumentation and monitoring methods, principles of machine design, automated control techniques, thermal and fluid sciences, computerized manufacturing systems, principles of electrical and electronic circuit operation, computer-aided drafting and design, economics of production, and statistical analysis and quality control.\n \nThe primary aim of the EMET program is to provide graduates with the knowledge and skills necessary to apply current methods and technology to the development, design, operation, and management of electro-mechanical systems, particularly in those industries where automated systems are prevalent.\n \nThe major is organized as a four-year baccalaureate program with the corresponding Penn State admission requirements. Graduates of an associate degree in either electrical or mechanical engineering technology from Penn State may re-enroll in the EMET program. The College of Engineering ENGR students may enroll through \"Change of Major\" procedures. Students from an engineering technology program at another institution or community college accredited by TAC of ABET may transfer into the program with advanced standing.\n\n\nWhat is Electro-Mechanical Engineering?\n\n\nThe Bachelor of Science degree in Electro-Mechanical Engineering Technology responds to a growing demand for engineers with a broad range of technical skills. The program emphasizes knowledge in the field of technology related to the design, maintenance, and operation of electromechanical systems, essentially automation and robotics. These systems incorporate electronic, mechanical, instrumentation and control elements. The program provides students with hands-on experience with these elements, technical knowledge, and the soft skills needed to be successful in the field of engineering. In this curriculum, students receive early exposure to technology by scheduling technical courses in the major. A laboratory component that promotes the understanding of the subject matter through the experiential application of theory accompanies most technical courses. This program culminates with a senior capstone project in which students work together in a team to design and implement an engineering project from initial proposal through product demonstration.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in math and science but prefer spending time applying your skills in a laboratory or field setting as opposed to studying the theory behind these subjects in a classroom setting. If you like to take things apart, to see how they work, this may be for you. There is a greater emphasis on engineering applications while building an understanding of scientific theory.",
        "entrance_to_major": "Direct Admission to the Major\n \nIncoming first-year students who meet the program admission requirements are admitted directly into the major. Admission restrictions may apply for change-of-major and/or change-of-campus students.\n \nFor more information about the admission process for this major, please send a request to the college, campus, or program contact (listed in the Contact tab).",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering community engagement certificate": {
        "program_description": "Program Description\n\n\nA certificate in Engineering and Community Engagement is proposed for students in the College of Engineering. This certificate is intended to acknowledge students who have gained proficiency in design, research and application of appropriate technologies for use in serving communities in the U.S. and abroad while stressing an awareness of the cultural context of such engineering activities. Collaborations with communities are strongly encouraged along with emphasis on the importance of ethical considerations in collaborating/working in community settings. All students in good academic standing are eligible for admission to the program.\n\n\nWhat is Engineering and Community Engagement?\n\n\nEngineering and Community Engagement focuses on combining design, research, and engineering principles to address needs of communities in the U.S. and abroad, all while stressing cultural awareness, sustainability, innovation, and teamwork.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou would like to partner with communities to make a difference.\n\n\nYou would like to explore and implement solutions to real problems.\n\n\nYou would like to lead design and build teams.\n\n\nYou would like to broaden your perspectives by collaborating with community stakeholders.\n\n\nYou would like to develop professional skills.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering design digital tools certificate": {
        "program_description": "Program Description\n\n\nThe Engineering Design with Digital Tools (EDDiT) certificate is a 13-credit certificate that enables students to specialize in digital design tools. This provides students with the opportunity to more fully develop their CAD and design skills, which are highly sought after by industry. Students are required to take at least one section of Engineering Design and Analysis with CAD (EDSGN 468), with each course section offering a different software package, such as SolidWorks, AutoCAD, or Catia. The certificate culminates in the preparation of a portfolio, through which students document and display their design work in a professional manner. Students must earn a C grade or better in each prescribed and additional course or independent study or pursue a replacement option.\n\n\nWhat is Engineering Design?\n\n\nEngineering Design is based on the concept of integrating ideas, disciplines, people, and resources within engineering and beyond that are necessary to achieve optimal design solutions for products, systems, processes, and services.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning about new design methods.\n\n\nYou would like to learn more about interdisciplinary applications of design such as sustainability, innovative design, design for human variability, global design, and affective design.\n\n\nYou are interested in interdisciplinary integrated design involving two or more distinct fields of knowledge.\n\n\nYou would like to develop a portfolio of your design projects.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering design certificate": {
        "program_description": "Program Description\n\n\nThe certificate provides an opportunity to pursue a specialization in engineering design; offering an incentive to take more courses in design and participate in more design projects, thereby improving employment prospects. Students must earn a C grade or better in each prescribed or additional course or independent study or pursue a replacement option. A minimum of 7 credits of required courses an an additional 6 credits of supporting courses minimum (at 400-level or above) are needed for completion of the certificate.\n\n\nWhat is Engineering Design?\n\n\nEngineering Design is based on the concept of integrating ideas, disciplines, people, and resources within engineering and beyond that are necessary to achieve optimal design solutions for products, systems, processes, and services.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning about new design methods.\n\n\nYou would like to learn more about interdisciplinary applications of design such as sustainability, innovative design, design for human variability, global design, and affective design.\n\n\nYou are interested in interdisciplinary integrated design involving two or more distinct fields of knowledge.\n\n\nYou would like to develop a portfolio of your design projects.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering design minor": {
        "program_description": "Program Description\n\n\nTo address design responsibilities necessary for engineering graduates, the engineering design minor develops design skills in students through a series of core project-based design courses supplemented by general electives in their discipline or related field. Through team-based projects, students apply engineering design processes to address design opportunities, from exploration of the problem space through exploration of the solution space. By focusing on different elements of a design process (e.g., defining and exploring the problem vs. identifying, prototyping, and evaluating design solutions), but covering in totality, the minor’s courses complement each other and provide students with a deeper understanding of engineering design. Specific areas of emphasis in this minor include problem framing, stakeholder engagement, human-centered design, rapid prototyping, prototyping to validate assumptions, systems-level design and professional communication. The tools and techniques developed in this minor should be broadly applicable to various engineering disciplines.\n\n\nWhat is Engineering Design?\n\n\nEngineering Design is based on the concept of integrating ideas, disciplines, people, and resources within engineering and beyond that are necessary to achieve optimal design solutions for products, systems, processes, and services.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning about new design methods.\n\n\nYou would like to learn more about interdisciplinary applications of design such as sustainability, innovative design, design for human variability, global design, and affective design.\n\n\nYou are interested in interdisciplinary integrated design involving two or more distinct fields of knowledge.\n\n\nYou would like to develop a portfolio of your design projects.",
        "entrance_to_major": "Entrance to Minor\n\n\nFor admission into the minor, students must have completed \nEDSGN 100\n and \nEDSGN 367\n.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering leadership development minor": {
        "program_description": "Program Description\n\n\nThis interdisciplinary minor is designed to provide engineering students with critical principles and skills. Engineering graduates must demonstrate the ability to assume leadership roles in a competitive technologically complex global society. There are increasing demands for engineers to be able to deal effectively with other people, including the ability to work in teams and to interact with customers and other organizations on both national and international levels. Students will employ engineering case studies in active and collaborative classroom settings to develop these skills. The minor consists of 18 semester hours. Students in all engineering majors are eligible.\n\n\nWhat is Engineering Leadership Development?\n\n\nThe Engineering Leadership Development (ELD) program focuses on providing a challenging, relevant, and dynamic world-class program that further engages students in their education while preparing them for leadership roles in a technical work environment. Courses in engineering leadership provide you with the understanding of individual, team, and organizational leadership; business acumen, global competencies and multicultural awareness; and innovation and management. Skill sets of effective leaders are practiced in local and virtual international teams aimed at designing and building practical solutions.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in developing your leadership potential and business acumen.\n\n\nYou would like to increase your multicultural awareness and global competencies.\n\n\nYou would like to enhance your innovation and management skills.",
        "entrance_to_major": "Entrance to Minor\n\n\nFor admission to the minor, students must have completed \nENGR 408\n. Students should apply during their sophomore year.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering mechanics minor": {
        "program_description": "Program Description\n\n\nThe Engineering Mechanics minor helps students prepare to analyze and/or design simple structures that are efficient and safe under foreseen loading conditions.\n \nContemporary engineering design of mechanical components requires precise information and modern analysis techniques to determine material response to anticipated loading. Designers must have the analytical and experimental tools to accurately define deformation under load to characterize dynamic response and to prevent mechanical failure. In the event of failure the cause(s) must be ascertained to prevent future failure through redesign and/or material substitution. Thus, industry has a real need for those with a sound foundation in Engineering Mechanics, the engineering science that deals with the effects of forces and torques on rigid and deformable bodies. Engineering Mechanics consists of Statics (bodies in equilibrium), Dynamics (bodies in unsteady motion such as vibration, moving on curvilinear paths) and the Mechanics of Deformable Media. The latter topic covers the change in dimensions of bodies of various shapes under the influence of forces, torques, temperature, and dynamic motion. Further failure criteria under such loadings are introduced and utilized in examples of engineering design. Some twenty undergraduate courses covering the above topics are available at two levels, i.e. sophomore introductory and senior (400) courses.\n\n\nWhat is Engineering Mechanics?\n\n\nEngineering mechanics is the engineering science that deals with the effects of forces and torques on particles, rigid bodies, or deformable media. Mechanics is typically subdivided into statics, dynamics, and mechanics of deformable bodies. The Engineering Mechanics minor is for undergraduates who wish to supplement their engineering backgrounds with extensive study in mechanics. The high-tech industry has a significant need for individuals with a sound background in engineering mechanics. Industries such as aerospace, automotive, power, structures, and appliance regularly hire graduates who are competent in engineering mechanics.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou wish to wish to supplement your engineering background with extensive study in mechanics.\n\n\nYou enjoyed your introductory courses in Statics, Dynamics, and Mechanics of Materials and would like to learn more.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering science bs": {
        "program_description": "Program Description\n\n\nEngineering Science is a multidisciplinary honors program that emphasizes enhanced understanding and integrated application of engineering, scientific, and mathematical principles. The program is unique because it provides a broad foundation in the sciences and associated mathematics that underlie engineering and provides students the opportunity to obtain a depth of knowledge in an area of their choosing through technical electives and a research and design honors thesis. The curriculum is designed for students who seek to link the engineering disciplines with science. In addition to taking core courses in mathematics, physics and chemistry - (and biology for students in premedicine), students study thermodynamics, heat transfer, electromagnetics, solid and fluid mechanics, electrical devices, materials science, and topics selected as foundational and technical electives. During the junior year, students investigate a variety of research fields and identify a topic for their honor thesis research and design project. During the senior year, all students complete a capstone project on their chosen topic by writing a thesis that applies the scientific principles of research, design and analysis to engineering. Focus areas of study include, but are not limited to: electrical, mechanical, civil, biomedical, and materials engineering and are expected to be interdisciplinary. Hence, Engineering Science students achieve both depth and breadth in engineering and science, are able to function across disciplines, and graduate well prepared for advanced studies as well as professional employment.\n \nThe specific program objectives are tied to the mission of the program as described above. They target the major outcomes expected of Engineering Science students and are flexible and readily adaptable to meet changing constituent needs.\n \nEnrollment is limited to students who have demonstrated that they can benefit from the advanced courses of the curriculum; therefore a minimum grade-point average of 3.0 is required. Qualified students can participate in the integrated undergraduate graduate (IUG) program to streamline the process of earning B.S. and M.S. degrees. Interested students should contact their academic adviser.\n\n\nWhat is Engineering Science?\n\n\nEngineering science is a broad discipline that encompasses many different scientific principles and associated mathematics that underlie engineering. It integrates engineering, biological, chemical, mathematical, and physical sciences with the arts, humanities, social sciences, and the professions to tackle the most demanding challenges and advance the well-being of global society. The unique knowledge and interdisciplinary skill set of engineering scientists allows them to merge multidisciplinary resources to propose and develop innovative, enduring solutions and transform the latest scientific discoveries into enabling new technologies. Engineering scientists research, develop, and design new materials, devices, sensors, and processes for a diverse range of applications.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in, and excel at, science and math, and want to use your skills in these areas to research, develop, and design new products and processes in a wide variety of fields.\n\n\nYou are interested in merging multidisciplinary resources to propose and develop innovative, enduring solutions and transforming the latest scientific discoveries into enabling new technologies.\n\n\nYou're seeking to link science with the engineering disciplines such as electrical, mechanical, chemical, civil, and biomedical.\n\n\nYou want an engineering curriculum and degree that you can tailor to your interests including research at the undergraduate level.\n\n\nYou are in the Schreyer Honors College and want a curriculum that will automatically satisfy all requirements of the Honors College.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 3.00\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.\n*\nSince Engineering Science is an honors program, admission is limited to students who attain a cumulative GPA of at least 3.0 by the end of the entrance to major semester. In the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Engineering bs": {
        "program_description": "Program Description\n\n\nThe Engineering program provides students with a broad foundation in engineering with specialization in a technically and professionally relevant topic. Students must choose the Multidisciplinary Engineering Design option at Abington, Brandywine and Great Valley campuses, Applied Materials option at the DuBois campus or the Alternative Energy and Power Generation option at the Hazleton campus. From this degree program, students will acquire the ability to work as members of a team toward successful attainment of a common goal, thus preparing them to work in for-profit or nonprofit organizations, or to further their studies in graduate school. Typical employment for General Engineering graduates includes positions such as engineer, product engineer, process engineer, manufacturing engineer, development engineer, and materials engineer. With employment opportunities such as these and others, graduates of the Engineering program can attain professional and economically sustaining employment in their desired regional area. This degree program develops written and oral communication skills, culminating in a two-semester senior design course sequence consisting of a project based largely on student interest and faculty input.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou have an interest in various different engineering disciplines and would like to diversify your skill set as much as possible.\n\n\nYou want to concentrate your studies on product, process, and manufacturing engineering.\n\n\nYou are passionate about the design and development of products.\n\n\nYou have an interest in alternative and renewable energy and power generation.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nCHEM 111\nExperimental Chemistry I \n1\n \nEMCH 213\nStrength of Materials\n3\n \nENGR 490W\nSenior Design I\n1\n \nENGR 491W\nSenior Design II\n3\n \nMATH 231\nCalculus of Several Variables\n2\n \nPHYS 214\nGeneral Physics:  Wave Motion and Quantum Physics \n2\n \nPrescribed Courses: Require a grade of C or better\n \nCHEM 110\nChemical Principles I \n3\n \nEDSGN 100\nCornerstone Engineering Design\n3\n \nEMCH 211\nStatics\n3\n \nMATH 140\nCalculus With Analytic Geometry I \n4\n \nMATH 141\nCalculus with Analytic Geometry II \n4\n \nMATH 251\nOrdinary and Partial Differential Equations\n4\n \nPHYS 211\nGeneral Physics:  Mechanics \n4\n \nPHYS 212\nGeneral Physics:  Electricity and Magnetism \n4\n \nAdditional Courses\n \nSelect 1 credit of First-Year Seminar\n1\n \nECON 102\nIntroductory Microeconomic Analysis and Policy \n3\n \nor \nECON 104\n Introductory Macroeconomic Analysis and Policy \n \nSelect one of the following:\n3\n \nCMPSC 121\nIntroduction to Programming Techniques\n \nCMPSC 200\nProgramming for Engineers with MATLAB \n \nCMPSC 201\nProgramming for Engineers with C++ \n \nAdditional Courses: Require a grade of C or better\n \nCAS 100A\nEffective Speech \n3\n \nor \nCAS 100B\n Effective Speech \n \nENGL 15\nRhetoric and Composition \n3\n \nor \nENGL 30H\n Honors Rhetoric and Composition \n \nENGL 202C\nEffective Writing: Technical Writing \n3\n \nor \nENGL 202D\n Effective Writing: Business Writing \n \nSelect one of the following:\n3\n \nEMCH 407\nComputer Methods in Engineering Design\n \nEMCH 461\nFinite Elements in Engineering\n \nENGR 350\nComputational Modeling Methods\n \nSupporting Courses and Related Areas\n \nSelect 4 credits in General Technical Electives, in consultation with an adviser, from the program approved list.\n4\n \nRequirements for the Option\n \nSelect an option\n45",
            "specific_requirements": {
                "Applied Materials Option (45 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nCHEM 112\nChemical Principles II \n3\n \nCHEM 202\nFundamentals of Organic Chemistry I\n3\n \nENGR 320\nMaterials Properties Measurement I\n3\n \nENGR 421\nMaterials Properties Measurements II\n4\n \nENGR 450\nMaterials Design and Applications\n3\n \nMATSE 202\nIntroduction to Polymer Materials\n3\n \nMATSE 400\nCrystal Chemistry\n3\n \nMATSE 402\nMaterials Process Kinetics\n3\n \nMATSE 411\nProcessing of Ceramics\n3\n \nMATSE 413\nSolid-State Materials\n3\n \nMATSE 417\nElectrical and Magnetic Properties\n3\n \nMATSE 430\nMaterials Characterization\n3\n \nPrescribed Courses: Require a grade of C or better\n \nMATH 220\nMatrices \n2\n \nMATSE 201\nIntroduction to Materials Science\n3\n \nAdditional Courses\n \nAdditional Courses: Require a grade of C or better\n \nME 300\nEngineering Thermodynamics I\n3\n \nor \nEME 301\n Thermodynamics in Energy and Mineral Engineering",
                "Alternative Energy and Power Generation Option (45 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nCHEM 112\nChemical Principles II \n3\n \nCHEM 113\nExperimental Chemistry II \n1\n \nEE 314\nSignals and Circuits II\n3\n \nEE 485\nEnergy Systems and Conversion\n3\n \nEGEE 302\nPrinciples of Energy Engineering\n3\n \nEGEE 420\nHydrogen and Fuel Cells\n3\n \nEME 303\nFluid Mechanics in Energy and Mineral Engineering\n3\n \nME 345\nInstrumentation, Measurements, and Statistics\n4\n \nPrescribed Courses: Require a grade of C or better\n \nEE 210\nCircuits and Devices\n4\n \nAdditional Courses\n \nSelect 9 credits from the following:\n9\n \nEE 488\nPower Systems Analysis I\n \nEGEE 437\nDesign of Solar Energy Conversion Systems\n \nEGEE 438\nWind and Hydropower Energy Conversion\n \nEGEE 441\nElectrochemical Engineering Fundamentals\n \nNUCE 401\nIntroduction to Nuclear Engineering\n \nAdditional Courses: Require a grade of C or better\n \nME 300\nEngineering Thermodynamics I\n3\n \nor \nEME 301\n Thermodynamics in Energy and Mineral Engineering\n \nSupporting Courses and Related Areas\n \nSelect 6 credits in Engineering Technical Elective courses, any 400-level courses in the College of Engineering or any 400-level courses with the Energy and Geoenvironmental Engineering (EGEE) abbreviation. Other substitutions outside the approved list must be approved by petition.\n6",
                "Multidisciplinary Engineering Design Option (45 credits)": "Course List\n \n \n \n \n \n \n \n \nCode\n \nTitle\n \nCredits\n \n \n \n \nPrescribed Courses\n \nCMPEN 271\nIntroduction to Digital Systems\n3\n \nEDSGN 401\nEngineering Systems Design\n3\n \nEDSGN 402\nMaterials and Manufacturing\n4\n \nEDSGN 403\nProduct Realization\n3\n \nEDSGN 495\nInternship\n1\n \nEE 316\nIntroduction to Embedded Microcontrollers\n3\n \nENGR 407\nTechnology-Based Entrepreneurship\n3\n \nPrescribed Courses: Require a grade of C or better\n \nEDSGN 410\nRobotics Design and Applications\n4\n \nEE 210\nCircuits and Devices\n4\n \nEE 310\nElectronic Circuit Design I\n4\n \nEMCH 212\nDynamics\n3\n \nAdditional Courses\n \nCHEM 112\nChemical Principles II \n (or any GN)\n3\n \nCHEM 113\nExperimental Chemistry II \n (or any GN)\n1\n \nAdditional Courses: Require a grade of C or better\n \nSelect one of the following:\n3\n \nEME 301\nThermodynamics in Energy and Mineral Engineering\n \nME 201\nIntroduction to Thermal Science\n \nME 300\nEngineering Thermodynamics I\n \nSupporting Courses and Related Areas\n \nSelect 3 credits in Engineering Technical Elective courses, in consultation with an adviser, from department list.\n3"
            }
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Environmental engineering minor": {
        "program_description": "Program Description\n\n\nThis minor is designed to provide students in engineering, science, and other majors with a comprehensive study of environmental issues and the skills necessary to solve problems associated with environmental pollution.\n\n\nWhat is Environmental Engineering?\n\n\nThe challenges in our modern society are complex and multi-faceted, demanding solutions across a wide range of disciplines. Environmental engineers have long recognized the need for convergence across disciplines to find sustainable solutions to water and climate issues that have broad societal importance. Penn State's Environmental Engineering Minor is an interdisciplinary program administered by the Department of Civil and Environmental Engineering. This minor is designed to provide students in engineering, science, and other majors with a comprehensive study of environmental issues and the skills necessary to solve problems associated with environmental pollution and climate change. A certificate is awarded to students who complete the requirements of the minor.\n\n\nYou Might Like This Program If...\n\n\nEnvironmental engineers use principles from engineering, chemistry, biology, and geology to solve environmental problems. Relevant issues include water treatment and remediation, waste disposal, air pollution, and energy production. Students enrolled in the minor may select from a suite of classes that develop the fundamental skills needed to address these problems. Multiple courses not listed in the requirements section can be approved to count towards the minor through the course substitution request system.",
        "entrance_to_major": "Entrance to Minor\n\n\nFor entrance into the minor, students must be at least fifth-semester standing and have completed:\n\n\n\n\nCourse List\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCode\n\n\nTitle\n\n\nCredits\n\n\n\n\n\n\n\n\nCHEM 110\nChemical Principles I \n3\n\n\nMATH 141\nCalculus with Analytic Geometry II \n4\n\n\nPHYS 211\nGeneral Physics:  Mechanics \n4",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Housing certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to prepare students for a career in the housing industry. Students are required to take a set of complementary courses in the technology of housing, the development process, and the design and the delivery processes for housing. The minimum number of credits required is 12, with no less than six credits at the 400-level.\n\n\nWhat is Housing?\n\n\nThis program is designed to provide undergraduate students with a means of developing some basic knowledge of housing and preparing for a career in the housing industry. Housing, from low-rise detached houses to multi-unit, multi-story apartment buildings, from motels to high-rise hotels, from student residences to rural housing, is a major and vital component of the built environment. New single-family housing represents at least 4% of the GDP, and housing and its consequences account for about 12% of the GDP. With a national housing stock in excess of 110,000,000 units, the maintenance, operation, repair - and especially the upgrading, retrofit and remodeling of the existing stock - are a very important component of the national economy. Engineers have many important roles to play in the housing business, especially with the developmental, economic and technical aspects of housing.\n\n\nYou Might Like This Program If...\n\n\nYou are passionate about housing and pursuing a career in the housing industry. Students are typically involved with the National Association of Home Builders (NAHB) Student Chapter at Penn State and/or student competition teams like the NAHB Student Competition and U.S. Department of Energy Race to Zero competition. This certificate will also help you to increase your competitiveness for employment in the residential construction industry.",
        "entrance_to_major": "Entrance to Certificate\n\n\nFor entrance into the certificate program, students must be at least 5th semester. The cumulative GPA considered for admission will be consistent with, or equivalent to, the GPA minimum of 2.00 for maintaining good academic standing. Students must earn a C grade or better in each of the four courses to continue with the certificate.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Industrial engineering bs": {
        "program_description": "Program Description\n\n\nThe undergraduate program in industrial engineering, being the first established in the world, has a long tradition of providing a strong, technical, hands-on education in design, control, and operation of manufacturing processes and systems. The curriculum provides a broad-based education in manufacturing, operations research and ergonomics through a base of mathematics, physical and engineering sciences, and laboratory and industrial experiences. It builds a strong foundation for the development of a professionally competent and versatile industrial engineer, able to function in a traditional manufacturing environment as well as in a much broader economy, including careers in financial services, communication, information technology, transportation, health care, consulting, or academia.\n \nAfter completing courses required for the core and fundamental competencies in the major, students can choose two IE technical elective courses from a department list. In addition, students must also complete the three-credit capstone design course.\n\n\nWhat is Industrial Engineering?\n\n\nIndustrial Engineering is rooted in the sciences of engineering, the study of systems, and the management of people. Industrial engineers are big-picture problem solvers who optimize complex engineering systems and processes. They bring together people, machinery, materials, information, energy, and financial resources to improve efficiency, performance, quality, and safety while reducing cost and waste. According to the Institute of Industrial & Systems Engineers, Industrial Engineers \"work to eliminate waste of time, money, materials, energy, and other commodities.\" Because it is a broad and versatile discipline, study of industrial engineering prepares you for careers in every sector of the economy.\n\n\nYou Might Like This Program If...\n\n\nLargely based in math and science, while incorporating business and psychology, the industrial engineering program is designed to prepare students to become leaders in engineering. We provide students with a comprehensive education in human factors/ergonomics; manufacturing; operations research; and supply chain/service engineering through coursework and hands-on experience. Our students become innovators who discover new solutions that address evolving challenges in a wide variety of sectors including academia, banking, communications, consulting, healthcare, information technology, transportation, etc.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Information sciences technology aerospace engineering minor": {
        "program_description": "Program Description\n\n\nThe role of Information Sciences and Technology in the practice of Aerospace Engineering is very important. Aerospace systems rely heavily on computers, software, and digital information; for control, sensors, and other onboard systems. The Boeing 777 has more than 1000 processors and roughly 20 million lines of software onboard, and F-16 and F-117As cannot fly without their onboard computers. In addition, many future aerospace vehicles will be unmanned, and the software challenges will be even greater. The onboard memory has also increased exponentially, the F-106 had 20 KBytes of memory and the new Joint Strike Fighter might have 2 GBytes of memory. The hardware and software must be carefully designed and thoroughly tested, since most aerospace systems are mission- or safety-critical systems. Computers and software are heavily used in the design, development, and manufacturing of aerospace systems. Large supercomputers are often used in the design process. The IST minor will enrich their educational achievements and increase their chances in obtaining employment or entering graduate school. The NSF and the DOD are encouraging universities to enhance their educational programs so that we have well-qualified engineers for future systems, and our IPAC members have stressed the importance of IT for our students.\n\n\nWhat is Information Sciences and Technology for Aerospace Engineering?\n\n\nThe role of software in the practice of aerospace engineering is critical and continues to grow rapidly. The effective design, development, and manufacturing of aerospace systems rely heavily on computers, software, and digital information. Some aircraft cannot fly without their onboard computers, and many future aerospace vehicles will be unmanned, resulting in even greater software challenges. Providing undergraduate aerospace engineering students the opportunity to learn more about information sciences and technology by earning a minor in Information Sciences and Technology will not only enrich their educational achievements, but it will also make them more valuable to potential employers, and help them succeed in professional employment or graduate school. They will better appreciate the entire aerospace system better, and will be better equipped to work side-by-side with experts in the computing and software fields.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning more about the role of software in the practice of aerospace engineering.\n\n\nYou want to better appreciate the entire aerospace system, and be better equipped to work side-by-side with experts in the computing and software fields.",
        "entrance_to_major": "Entrance to Minor\n\n\nStudent must apply for entrance to the minor no later than their 7th semester.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Information sciences technology industrial engineering minor": {
        "program_description": "Program Description\n\n\nCollection and processing of information have increased in all sectors for solving engineering problems, including manufacturing and service related problems. Efficient and timely analysis of data is critical for the survival of companies. There is a need for industrial engineers with a strong background in information technology and systems. The minor in Information Sciences and Technology for Industrial Engineering will augment the skills of students in the Department of Industrial and Manufacturing Engineering in the information systems area. All students pursuing a baccalaureate degree in Industrial Engineering are eligible for this minor.\n\n\nWhat is Information Sciences and Technology for Industrial Engineering?\n\n\nCollection and processing of information have increased in all sectors for solving engineering problems, including manufacturing and service related problems. Efficient and timely analysis of data is critical for the survival of companies. There is a need for industrial engineers with a strong background in information technology and systems.\n\n\nYou Might Like This Program If...\n\n\nThe minor in Information Sciences and Technology for Industrial Engineering augments the skills of students in the Department of Industrial and Manufacturing Engineering in the information systems area. All students pursuing a baccalaureate degree in Industrial Engineering are eligible for this minor.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "International engineering certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to provide recognition for students who have gained a proficiency in the skills needed by engineers in a global economy. The requirements of the certificate fall into three categories:\n \n \nknowledge of global engineering and its professional and societal context,\n \nknowledge of language and culture, and\n \nparticipation in international experiences.\n \n \nAll engineering students in good academic standing are eligible for admission to the program.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to bring a truly global perspective to your engineering education.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "International engineering minor": {
        "program_description": "Program Description\n\n\nThe International Engineering Minor is paired with any engineering baccalaureate major at any campus in order to provide students with an opportunity to learn about, and understand their profession in a global context. It is designed to provide students with knowledge, language skills, and experiences to help prepare them for a professional career that is likely to include collaborations with professionals from various parts of the world. The minor will help students understand the cross-cultural communications challenges and the global arena in which their profession is practiced. Students completing this minor will gain a competitive advantage because they will be able to demonstrate a broader understanding of the role of their profession and will have demonstrated their ability to communicate across cultural lines.\n\n\nYou Might Like This Program If...\n\n\nYou want to bring a truly global perspective to your engineering education.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Mechanical engineering technology aengt": {
        "program_description": "Program Description\n\n\nThis major helps graduates prepare for technical positions in manufacturing, machine and tool design, computer drafting and design, computer integrated manufacturing, materials selection and processes, technical sales, and other related industries in mechanical applications. The primary objective of the program is to provide a broad foundation in mechanical systems and applications; computer systems in drafting (CAD), manufacturing (CAM), and automation and robotics (CIM); production and product design; mechanics, dynamics, and strength of materials.\n \nGraduates of this major may qualify for admission to the baccalaureate degree majors in Mechanical Engineering Technology and Structural Design and Construction Engineering Technology programs at Penn State Harrisburg; the Mechanical Engineering Technology and the Plastics Engineering Technology programs at Penn State Erie, The Behrend College; or the baccalaureate degree major in Electro-Mechanical Engineering Technology offered at Penn State Altoona, Penn State Berks, Penn State New Kensington, or Penn State York. Two tracks are available to streamline the transition to these baccalaureate degree programs. A general track is provided for students who do not plan to continue their engineering technology education at the baccalaureate level.\n\n\nWhat is Mechanical Engineering Technology?\n\n\nMechanical engineering technology is the understanding of how products and machinery work and how they are designed, made, and used.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in computer-aided drafting (CAD) and computer-aided manufacturing.\n\n\nYou enjoy physics, math and statistics.\n\n\nYou have a passion for robotics and automation.\n\n\nYou have an interest in programming and data acquisition.",
        "entrance_to_major": "Entrance to Major\n\n\nStudents must have a minimum 2.0 GPA to change to this Associate degree after admission to the University.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Mechanical engineering bs": {
        "program_description": "Program Description\n\n\nMechanical Engineering is one of the broadest engineering disciplines and is central in many new technological developments. Mechanical engineers create things that help improve the health, happiness and safety of our everyday lives such as biomedical devices, aircraft and cars, and ways to store renewable energies. Mechanical engineering is divided into two broad areas: mechanical systems and thermal systems. Mechanical systems include the design of mechanisms and the analysis of the strength and wear of materials. Thermal systems include methods of energy conversions, heat transfer and fluid flow.\n\n\nWhat is Mechanical Engineering?\n\n\nMechanical engineering is the largest and broadest engineering discipline. It uses a combination of physics, chemistry, mathematics, and materials science to study mechanical, fluid, and thermal systems. Mechanical engineers are problem solvers: They use their foundational knowledge to apply scientific and engineering methods to the design, construction, and testing of products and components to ensure that they are safe, reliable, and cost effective. Mechanical engineering differs from mechanical engineering technology in that it emphasizes the math and science behind the theoretical development of engineering analysis and design process principles rather than the application of these principles. Mechanical engineers design everything from athletic equipment, medical devices, theme park rides, and personal computers to engines and power plants.\n\n\nYou Might Like This Program If...\n\n\nYou think outside the box to develop solutions to everyday problems. Mechanical engineers contribute to our health, happiness and safety, and often change the way we think about the world.",
        "entrance_to_major": "Entrance to Major\n\n\nUniversity Park (ME_BS)\n\n\nThis program currently has administrative enrollment controls. Administrative Enrollment Controls are initiated when limitations of space, faculty, or other resources in a major prevent accommodating all students who request them. Students must follow the administrative enrollment controls that are in effect for the semester that they enter the university.\n \nFirst-Year Students Entering Summer 2024, Fall 2024, Spring 2025\n \nIn order to be eligible for entrance to this major, students must satisfy the following requirements:\n\n\n\n\nbe enrolled in the College of Engineering or the Division of Undergraduate Studies\n\n\n29-55 graded Penn State credits (excludes transfer and AP credits)\n\n\ncompleted with a grade of C or better: \nCHEM 110\n, \nEDSGN 100\n, \nMATH 140\n, \nMATH 141\n, \nPHYS 211\n\n\nearned a minimum cumulative grade-point average (GPA) of 3.00\n\n\n\n\nStudents Who Entered Prior to Summer 2024\n \nStudents who entered the University from Summer 2018 through Spring 2024 should view the administrative enrollment controls in the appropriate \nUndergraduate Bulletin archive\n. Students who entered the University prior to the summer 2018 semester should consult with their academic adviser about the administrative enrollment controls in effect for the semester they entered the university.\n\n\nScranton (MEENG_BS)\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out:\n \n \n29-55 cumulative credits (excludes transfer and AP credits)\n \ncompleted with a grade of C or better: \nCHEM 110\n, \nEDSGN 100\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nearned a minimum cumulative grade-point average (GPA) of 2.60\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Nanotechnology certificate": {
        "program_description": "Program Description\n\n\nThe primary goal of the program is to offer students and incumbent workers worldwide the opportunity to earn this 18-credit certificate, which will be available only online. All candidates are required to successfully complete the required courses.\n\n\nWhat is Nanotechnology?\n\n\nNanotechnology is inherently interdisciplinary and bridges across physics, biology, materials science, and chemistry. It is a general purpose, enabling technology that is already impacting a broad spectrum of human endeavors, from medicine and catalysis to textiles and quantum computing. The Nanotechnology certificate is designed to help prepare students from a broad range of disciplines for careers or graduate study in fields involving nanotechnology. It builds upon the strengths of Penn State's faculty, expertise, academic programs, and nanofabrication facilities, including its class 1 and class 10 cleanrooms. The curriculum provides students with fundamental knowledge and skills in nanoscale simulation, design, syntheses, characterization, properties, processing, manufacturing, and applications.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in gaining fundamental knowledge and skills in nanoscale simulation, design, syntheses, characterization, properties, processing, manufacturing, and applications.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Nanotechnology minor": {
        "program_description": "Program Description\n\n\nThe Nanotechnology minor is designed to help prepare students from diverse disciplines for careers in a broad range of industries innovating with nanotechnology. The minor builds on the singular strengths of Penn State's nanofabrication facilities including its class 1 and class 10 clean rooms, its faculty, and existing academic programs. The minor provides students with fundamental knowledge and skills in simulation, design, modeling, syntheses, characterization, properties, processing, manufacturing, and applications at the nano scale.\n \nAs nanotechnology increasingly bridges across disciplines, a basic understanding of mathematics, physics, biology, and chemistry is recommended. To complete the 18 credit nanotechnology minor, students will take two prescribed courses (6 credits) in nanoscience fundamentals, and then select four additional courses (12 credits) from a growing list of courses that address the areas described in the previous paragraph.\n \nIn addition to nanotechnology career opportunities in microelectronics, information storage, optoelectronics, bioelectronics, pharmaceuticals, agriculture, medicine, life sciences and the sciences, the minor prepares undergraduate students to support major new nanotechnology research programs as graduate students. Interested 3rd and 4th year students from related fields in engineering, the chemical, physical, and the biological sciences, medicine, life, and agricultural sciences are encouraged to enroll.\n\n\nWhat is Nanotechnology?\n\n\nNanotechnology is inherently interdisciplinary and bridges across physics, biology, materials science, and chemistry. It is a general purpose, enabling technology that is already impacting a broad spectrum of human endeavors, from medicine and catalysis to textiles and quantum computing.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in an interdisciplinary minor that bridges across physics, biology, materials science, and chemistry.\n\n\nYou are interested in gaining fundamental knowledge and skills in nanoscale simulation, design, syntheses, characterization, properties, processing, manufacturing, and applications.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Nuclear engineering bs": {
        "program_description": "Program Description\n\n\nThe overall educational objective of the Nuclear Engineering program is to help prepare our graduates to function effectively in the marketplace in a wide range of career paths in Nuclear Engineering. The technical part of the curriculum, emphasizes nuclear power engineering, which refers to complex systems used to generate electricity. Because of our strong educational and research emphasis in nuclear power engineering, and because a shortage for this expertise exists in the industry, generally the industry values our graduates highly. We recognize that nuclear science, including nuclear security and non-proliferation, is an important growth area. We constantly assess and review the needs of our undergraduate students and their most frequent employers and use this feedback to consider revisions to our curriculum so that it is responsive to the needs of our constituents.\n \nThe first two years of the program stress fundamentals in mathematics, chemistry, physics, computer programming, and engineering sciences such as mechanics, materials, and thermodynamics. The last two years provide the breadth and depth in nuclear science, behavior of heat and fluids, reactor theory and engineering, and radiation measurement. The laboratory work includes experiments using the University's 1,000-kilowatt research reactor. Engineering design is incorporated in many courses from the freshman year to the senior year, but is particularly emphasized in the senior capstone design course, which integrates the critical elements of reactor theory, reactor engineering, safety considerations and economic optimization into a reactor design.\n \nMany graduates are employed by electric power companies that use nuclear power plants, or by companies that help service and maintain those plants. They use their knowledge of engineering principles, radioactive decay, interactions of radiation with matter, and nuclear reactor behavior to help assure that the power plants meet the demand for reliable, economic electricity while ensuring a safe environment. To do this, graduates must be problem solvers who can develop and use complex computer models and sophisticated monitoring systems, design systems to handle radioactive waste, determine if the materials in the plant are becoming brittle or corroded, or manage the fuel in the reactor to get the maximum energy from it. Other graduates work in industries that use radioactivity or radiation to detect problems or monitor processes. Jobs are also found in branches of the government as designers of the next generation of reactors for submarines, aircraft carriers, or space probes, or to manage and clean up contaminated wastes. They could also be involved with regulation of nuclear power or radiation uses, or in research to develop advanced technologies that will be used in next-generation power plants. Graduates who want to further their education in the fields of health physics, radiation biology, or nuclear medical applications find this degree to be a useful preparation.\n\n\nWhat is Nuclear Engineering?\n\n\nNuclear Engineering is a multidisciplinary field that goes beyond providing nuclear power for electrical production. Nuclear engineers may apply their knowledge in various fields, including disease treatment, safeguarding food supplies, operate nuclear energy systems, develop regulations to ensure safety, or facilitate space exploration.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in using basic science to make the world a better place for humankind through the production of clean energy, keeping the country safe from nuclear attack, and the application of nuclear science.",
        "entrance_to_major": "Entrance to Major\n\n\nIn order to be eligible for entrance to this major, students must satisfy the following requirements by the end of the semester during which the admission to major process is carried out.\n \n \nCompleted 29-55 cumulative credits (credits completed at Penn State for which a quality letter grade was earned)\n \nCompleted with a C or better the following courses: \nEDSGN 100\n, \nCHEM 110\n, \nMATH 140\n, \nMATH 141\n, and \nPHYS 211\n \nAttained at least a 2.6 cumulative grade point average\n \n \n*\nIn the event that the major is under enrollment control, a higher minimum cumulative grade-point average is likely to be needed and students must be enrolled in the College of Engineering or Division of Undergraduate Studies at the time of confirming their major choice.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Product innovation entrepreneurship certificate": {
        "program_description": "Program Description\n\n\nLearn and practice the entrepreneurial mindset in the Product Innovation Entrepreneurship Certificate. This certificate prepares you to run an entrepreneurial venture or to be an intrapreneur where you utilize the entrepreneurial mindset within an existing organization. Learn and practice business fundamentals from an entrepreneurial perspective and deal with the challenges of leading a creative entrepreneurial organization and the associated ambiguity. The certificate is open to any student who has the goal to own their own business or wants to learn to think outside the box. This certificate will help the student work effectively within any organization, always looking for ways to be more creative and innovative.\n\n\nYou Might Like This Program If...\n\n\nYou want to take control of your career, whether working for yourself or within an existing organization. The students completing this program look for careers where they have the autonomy to make decisions and take pride in their accomplishments. This program helps you build confidence to pursue opportunities that you identify. The projects you work on in these classes are a fun way to put all your major skills to use in real-world activities.\n\n\nMORE INFORMATION ABOUT PRODUCT INNOVATION ENTREPRENEURSHIP",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Residential construction minor": {
        "program_description": "Program Description\n\n\nThe objective of the Residential Construction Minor is to provide an opportunity for students to gain an understanding of the residential building construction topics and issues with emphasis on sustainable land development, design and construction of residential buildings, as well as construction management of residential projects. Residential building construction is a unique interdisciplinary field that draws upon civil and architectural engineering, architecture, real estate, management, finance, and marketing disciplines, and design principles including economical, safe, and serviceable structural design, green building systems design, sustainable land development, and construction management. This minor is expected to be primarily of interest to students from Civil and Environmental Engineering, Architectural Engineering, and Architecture majors, but students from other majors can also enroll in this minor. This minor will help students to increase their competitiveness for employment in residential market and construction industry.\n\n\nWhat is Residential Construction?\n\n\nResidential Construction is the building of single- and multi-family single-units, manufactured, duplex and quad-plex homes and apartments and condominiums.\n\n\nYou Might Like This Program If...\n\n\n\n\n You have an interest in architectural engineering, civil engineering, or architecture.\n\n\nYou want to build residential homes.\n\n\nYou have an interest in real estate.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Service enterprise engineering minor": {
        "program_description": "Program Description\n\n\nService sector represents over 80% of the economy and represents over 70% of jobs in the U.S. Service enterprises constitute a wide range in terms of labor intensity, information intensity, and prevailing productivity. Examples of service enterprises include hospitals, retailers, banks, financial institutions, and airlines. This minor is designed for students interested in learning about applying industrial engineering techniques to service enterprises. Students completing this minor will gain an understanding of applying industrial engineering and operations research tools for modeling, analysis, design and control of service enterprises.\n \nIn addition to the stated courses for the minor, students in IE pursuing this minor may be required to take the prerequisites for the courses listed for the Service Cluster. Students in HPA, HDFS and any other major will require \nMATH 220\n as a prerequisite for \nIE 405\n. \nIE 405\n and \nIE 322\n (or an equivalent course in probability and statistics) are prerequisites for \nIE 460\n.\n\n\nWhat is Service Enterprise Engineering?\n\n\nService Enterprise Engineering is the study, design, and implementation of new systems that improve the processes and efficiencies of the service sector, in which 80 percent of the U.S. workforce is employed. The minor answers a critical need for operational expertise in health care and human service fields. Students completing this minor will gain an understanding of applying industrial engineering and operations research tools for modeling, analysis, design and control of service enterprises.\n\n\nYou Might Like This Program If...\n\n\nMost applicable for those students in industrial engineering, health policy administration, and human development and family studies, this minor gives students the ability to apply industrial engineering techniques to processes in hospitals, nonprofit organizations, retailers, banks, financial institutions, airlines, and more.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Six sigma minor": {
        "program_description": "Program Description\n\n\nSix Sigma has been increasingly internalized by companies involved in manufacturing, health care, and service industries. The Six Sigma process has also been used to address environmental concerns such as water quality and energy conservation. Thus, this minor is designed for students who are interested in the Six Sigma statistical methodology for increasing productivity and enhancing quality. The minor will provide students with an understanding of how business models are changing in response to globalization and how the Six Sigma process and product improvement methodology is thus a vehicle for industry prosperity in this climate. Students completing the minor will develop their analytical and statistical skills, and gain a competitive advantage in the work place.\n\n\nWhat is Six Sigma?\n\n\nSix Sigma is a highly disciplined process that puts sharp focus on developing and delivering near-perfect products and services. It has been used to shape both the strategy and operation of companies of all sizes and sectors. Six Sigma provides a framework for quality improvement and innovation that builds upon statistical tools to achieve results. Students completing the minor should:\n\n\n\n\nBe knowledgeable about why organizations use Six Sigma and how they apply it\n\n\nGain experience with using the DMAIC methodology for problem solving\n\n\nGain experience with using the DMADOV methodology for new product innovation\n\n\nUnderstand the links between customer requirements, product specifications, and process capability\n\n\nUnderstand the theory and application of regression analysis, design of experiments, and statistical quality control\n\n\nBe familiar with the project selection process including knowing when to use the Six Sigma methodology.\n\n\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in problem solving in business operations, lean manufacturing/business practices, and improving industry efficiencies.\n\n\n\n\nThe Six Sigma Minor is an 18-credit minor designed for any student who is interested in the Six Sigma statistical methodology. Industries utilizing Six Sigma skills include: manufacturing, transportation, warehousing, health care, defense, financial services, retail, leisure/hospitality, education, construction, consulting, and more.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Space systems engineering certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to prepare students for careers in the space industry and for work on space systems. To achieve this, a minimum program of three space systems engineering related courses, a space systems engineering seminar, and project work is to be completed.\n\n\nYou Might Like This Program If...\n\n\nYou would like to explore a how to approach the engineering of complex systems; you have an interest in space, aerospace engineering, or satellites, or have an interest in working within the defense and/or aerospace industry.",
        "entrance_to_major": "Entrance to Certificate\n\n\nFor entrance into the certificate program, students must be at least 5th semester standing. The cumulative GPA considered for admission will be consistent with, or equivalent to, the GPA minimum of 2.00 for maintaining good academic standing.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Surveying engineering technology aengt": {
        "program_description": "Program Description\n\n\nThe Surveying Engineering Technology major provides the basic undergraduate education required for private and public service as a technician in the surveying profession. Basic knowledge is provided in the areas of boundary, construction, topographic, photogrammetry, laser scanning, and land development. The curriculum is designed to develop an individual understanding of the skills and equipment needed to make precise surveying measurements.\n \nGraduates of the Surveying Engineering Technology major may qualify for admission to the baccalaureate degree majors in Surveying Engineering or Structural Design and Construction Engineering Technology.\n\n\nWhat is Surveying Engineering Technology?\n\n\nSurveying is the science of measuring physical features of Earth to collect spatial information and to establish land boundaries. Survey engineering technologists learn the elements of surveying as applied to construction, land, topographic, geodetic, city, and photogrammetric surveys.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy the outdoors.\n\n\nYou have an interest in math and science.\n\n\nYou are passionate about robotic, GPS, scanner, GIS, and drone technology.\n\n\nYou are interested in geographic data and how it is captured, stored, manipulated, analyzed, and managed.",
        "entrance_to_major": "Entrance to Major\n\n\nStudents must have a minimum 2.0 GPA to change to this Associate degree after admission to the University.",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    },
    "Surveying engineering bs": {
        "program_description": "Program Description\n\n\nThe Surveying Engineering major provides a basic undergraduate education required for private and public service in the profession of surveying. Particular emphasis is placed on fundamental surveying principles required in all areas of surveying. Instruction is provided in the main divisions of surveying, including land surveying, boundary mapping, photogrammetry, laser scanning, data analysis and adjustment, geodesy and map projection coordinate systems, remote sensing, geographic information systems, and land development. Students study various data collection techniques using surveying tools including total stations, photogrammetry, laser scanners, unmanned aerial systems (UASs), remote sensing satellite imagery, and the global navigation satellite system (GNSS). They also study legal principles related to land surveying, professional ethics, applications for Geographic Information Systems (GIS) in surveying, and data management techniques, and point cloud processing methods for 3D modeling and surveying product delivery.\n\n\nWhat is Surveying Engineering?\n\n\nSurveying is the science of measuring physical features of Earth to collect spatial information and to establish land boundaries. Surveying engineers learn the elements of surveying as applied to construction, land, topographic, geodetic, city, and photogrammetric surveys.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy the outdoors.\n\n\nYou have an interest in math and science.\n\n\nYou are passionate about robotic, GPS, scanner, GIS, and drone technology.\n\n\nYou are interested in geographic data and how it is captured, stored, manipulated, analyzed, and managed.",
        "entrance_to_major": "Direct Admission to the Major\n \nIncoming first-year students who meet the program admission requirements are admitted directly into the major. Admission restrictions may apply for change-of-major and/or change-of-campus students.\n \nFor more information about the admission process for this major, please send a request to the college, campus, or program contact (listed in the Contact tab).",
        "degree_requirements": {
            "common_requirements": "Not found",
            "specific_requirements": {}
        },
        "general_education": {
            "GQ": "6 credits (Quantification)",
            "GWS": "9 credits (Writing and Speaking)",
            "GA": "3 credits (Arts)",
            "GH": "3 credits (Humanities)",
            "GS": "3 credits (Social and Behavioral Sciences)",
            "GN": "3 credits (Natural Sciences)",
            "Inter-Domain": "6 credits (Integrative Studies)"
        },
        "university_requirements": {
            "FYS": "1-3 credits (First Year Seminar)",
            "US Cultures": "3 credits (United States Cultures)",
            "IL Cultures": "3 credits (International Cultures)",
            "WAC": "3 credits (Writing Across the Curriculum)"
        }
    }
}