{
    "Actuarial mathematics statistics certificate": {
        "program_description": "Program Description\n\n\nDesigned to prepare students for a career as an actuary.  Students completing the certificate are prepared to pass the P/1 (Probability), FM/2 (Financial Mathematics) examination and would obtain via credit for economic, corporate finance and applied statistical methods topics once a second actuarial examination is passed. It is divided with mathematical and statistical prerequisites, upper-level statistics, and finance/economics courses. Requires 31 credit hours and can be completed concurrently with a Penn State degree or via continuing education.\n\n\nWhat is Actuarial Mathematics and Statistics?\n\n\nActuarial science is an interdisciplinary study that combines mathematics, probability theory, statistics, finance, economics, and computer science. Actuaries study and evaluate risk, often in the insurance and finance sectors.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy working with numbers and data, both scientific and financial.\n\n\nYou like not only mathematics but also business and computing.\n\n\nYou have strong communication skills.\n\n\nYou are comfortable working on a cross-discipline team.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ECON 102Introductory Microeconomic Analysis and Policy 3 ECON 104Introductory Macroeconomic Analysis and Policy 3 ECON 481Business Forecasting Techniques3 or ECON 485 Econometric Techniques FIN 301Corporation Finance3 FIN 427Derivative Securities3 MATH 230Calculus and Vector Analysis4 STAT 3013 STAT 414Introduction to Probability Theory3 STAT 462Applied Regression Analysis3 Select one of the following:3-4 SCM 200Introduction to Statistics for Business STAT 200Elementary Statistics STAT 401Experimental Methods"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Advanced instructor development professionals certificate": {
        "program_description": "Program Description\n\n\nAdvanced Instructor Development for Professionals This certificate is designed for the adult learner who would like to gain knowledge of essential advanced instructor development concepts. These adult learners may already possess a degree in an occupational discipline, but need to augment their knowledge and resumes to advance their careers with their current employer or transition into a new job. Adult learners taking this certificate may also be taking post-secondary credit courses for the first time.",
        "entrance_to_major": "Entrance to Certificate\n\n\nAdmissions criteria for the certificate program follow standard University procedures for adult students.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses WFED 270Introduction to Industrial Training3 WFED 413Vocational Education for Special-Needs Learners3 WFED 471Training in Industry and Business3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Advertising certificate": {
        "program_description": "Program Description\n\n\nThe certificate in Advertising offered at Penn State Behrend is designed for communication and business majors who wish to focus their supporting or non-business supporting coursework in a specific professional communication area. The certificate is also designed for working professionals interested in developing their skill-set in advertising. The foundation of the certificate is developed in the Media Writing, Introduction to Advertising, and Creative Strategies courses. Students are then allowed to choose one additional advanced course to complete the 12 required hours.\n\n\nWhat is Advertising?\n\n\nAdvertising is an approach to marketing communication that uses paid messaging to promote or sell a product, service, or idea. Advertising unabashedly attempts to influence opinion or spur an action such as buying a product or voting for a candidate. Advertisements commonly appear in mass media such as newspapers, magazines, television, radio, billboards, and direct mail. Newer forms of advertising include social media, blogs, websites, search results, and text messages.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are creative.\n\n\nYou enjoy thinking critically about consumer behavior.\n\n\nYou envision a career creating advertising content or working at an ad agency.\n\n\nYou might want to someday buy or sell advertising space, spots, or services.\n\n\nYou are pursuing a communication- or business-related degree.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses COMM 315Applications for Media Writing3 COMM 320Introduction to Advertising3 COMM 421WAdvertising Creative Strategies3 COMM 422Advertising Media Planning3 or COMM 424 Advertising Campaigns"
        },
        "electives": "",
        "supporting_courses": ""
    },
    "Africa asia studies certificate": {
        "program_description": "Program Description\n\n\nFor centuries, multiple networks and the circulation of people and goods across the maritime waters of the Indian Ocean had linked diverse spaces and communities in Africa and Asia. The cross-pollination of cultural ideas is still visible through built spaces, languages, literary works, performances, spiritual cultures, and in many everyday practices. Today many African and Asian countries are mobilizing the history of these exchanges to forge lasting partnerships through economic, educational, environmental, digital, infrastructural, and healthcare projects. This 12-credit certificate in “Africa-Asia Studies” will enable students to gain an integrated and grounded understanding of the past, present, and possible futures for African-Asian exchanges through a range of courses in humanities and social sciences. Students will learn the history of this South-South relationship and how it gained new solidarities in the postcolonial phase after the Bandung Conference in 1955. Students will study how Africa-Asia alliance redefines globalization, global networks, political capital, and also cultural connections. This certificate will also include an optional study abroad opportunity in Africa or Asia.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses AFR 105African Biodiversity and Conservation 3 or AFR 110N Introduction to Contemporary Africa ASIA 100What is Asia? 3 or ASIA 100Z Select 6 credits from the following:6 AFR 191Early African History AFR 192Modern African History AFR 202NWomen, Gender, and Feminisms in Africa AFR 399Foreign Studies AFR 405African Studies Methodologies AFR 443Ethnic Conflict in Africa AFR 454Government and Politics of Africa AFR 464Extractive Industries in Africa AFR 497Special Topics AFR 596Individual Studies ANTH 408Anthropological Demography ANTH 458Ethnographic Field Methods ASIA 3Introduction to the Religions of the East ASIA 120YSouth Asia: A Literary History ASIA 171 ASIA 199Foreign Studies ASIA 401Technology & Society in Modern Asia HIST 475YThe Making and Emergence of Modern India"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "African literature visual arts performance certificate": {
        "program_description": "Program Description\n\n\nThe purpose of this 12-credit Certificate is to provide students with an opportunity to comprehend the breadth of African literature, visual arts, and performance, and how these creative cultural practices respond to and shape political, economic, and social concerns. Through courses that introduce them to an inclusive array of African artistic and expressive practices, students will gain fluency in the cultural and creative diversity of African and Afro-diasporic peoples. Students will receive training in critical theory that prepares them to understand and interpret forms of expressive culture in African contexts and through African knowledge systems. They will learn to analyze the complex interrelations of local and global audiences, networks, and traditions in both formal artistic practice and vernacular art forms in their material, immaterial, and embodied expressions. Students may choose to focus on an area of study (e.g. performance) or to pursue an interdisciplinary selection of courses.\n \nLearning objectives include:\n \n \nStudents will be able to identify, describe, and analyze prevalent forms of African expressive culture and artistic practice and the key issues they address;\n \nStudents will be able to think critically and discuss how local and global networks shape the production, dissemination, and reception of myriad forms of expressive cultures;\n \nStudents will understand the ways in which African creative and artistic expression contributes to politics, social life, and knowledge production;\n \nStudents will gain hands-on experience in field research or artistic practice through study abroad opportunities;\n \nStudents will gain skills related to a career in the arts or in foundations, museums, educational institutions or other non-profits that support, research in, or teach cultural diversity and the arts.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Core Courses Select 6 credits from the following:6 AFR 150Africa in Cinema AFR 335African Art AFR 405African Studies Methodologies CMLIT 3Introduction to African Literatures DANCE 221Introduction to West African Dance and Culture Select 6 credits from the following:6 AFR 110NIntroduction to Contemporary Africa AFR 132Afro-Hispanic Civilization AFR 202NWomen, Gender, and Feminisms in Africa AFR 297Special Topics AFR 310Language Rights, Policy, and Planning AFR 447Topics in the Art of the African Diaspora AFR 459 AFR 497Special Topics ARTH 130Art of Africa, Oceania, and the Americas ARTH 446Topics in African Art CMLIT 422African Drama CMLIT 423African Novel DANCE 220Mojah Fusion Dance DANCE 411 FR 458African Literature of French Expression WMNST 462Reading Black, Reading Feminist"
        },
        "electives": "Elective Courses",
        "supporting_courses": ""
    },
    "Agricultural stewardship conservation certificate": {
        "program_description": "Program Description\n\n\nThe Chesapeake Bay Program and other local, state, and federal initiatives to protect surface and groundwater resources have increasingly focused on agricultural best management practices. A significant demand has been created for professionals trained in these best management practices and the ability to plan and implement them in a wide variety of agricultural systems. The goal of the certificate program in Agricultural Stewardship and Conservation is to provide enhanced knowledge for planning, designing, and implementing best management practices on agricultural lands that contribute to soil health while preventing soil erosion, controlling runoff and managing nutrient inputs and outputs, all of which serve to protect ground and surface waters. Local, state and federal policies and regulations pertaining to agricultural stewardship are addressed, as well as certification requirements for agricultural and nutrient management specialists to work in the field of agricultural erosion and sediment control and nutrient management in the Commonwealth of Pennsylvania.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in monitoring and implementing best management practices.\n\n\nYou have a passion for conservation and natural resource issues.\n\n\n\n\nThe certificate was developed to offer classroom and hands-on learning in the sustainability of agricultural soil and water resources. The Agricultural Stewardship and Conservation certificate may appeal to a variety of Penn State majors, including Environmental Resource Management, BioRenewable Systems, Animal Science, Agricultural Science, and Plant Sciences, as well as non-degree students.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses ERM 4261 ERM 495Internship1-3 or ERM 496 Independent Studies SOILS 101Introductory Soil Science 3 SOILS 418Nutrient Management in Agricultural Systems3 Select one of the following:3-4 ASM 327Soil and Water Resource Management BE 307Principles of Soil and Water Engineering SOILS 422Natural Resources Conservation and Community Sustainability"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Autocad certificate": {
        "program_description": "Program Description\n\n\nThe AutoCAD: Computer-Aided Drafting Certificate is an introduction to AutoCAD, the industry standard for high-quality engineering graphics. Knowing AutoCAD will open many doors for you in the workplace. In fact, more and more jobs require a working knowledge of AutoCAD, an industry standard for high-quality engineering graphics. Classes will be \"hands on\" in the computer lab during convenient evening hours. Students who take the classes in this certificate will:\n \n \nLearn drawing vocabulary used on blueprints-apply that vocabulary to produce drawings\n \nUnderstand sectional views\n \nCreate 2D drawings\n \nDevelop computer skills for drafting-learn commands, views, etc.\n \nCreate 3D models\n \n\n\nWhat is AutoCAD?\n\n\nComputer software to model, design, and analyze a wide variety of two and three dimensional objects.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou will enter an engineering industry that will require creating, revising, or interpreting 2D or 3D drawings.\n\n\nYou desire a skill set that applies to most activities involved with modern technology.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses EDSGN 100Cornerstone Engineering Design3 EGT 102Introduction to Computer Aided Drafting1 EGT 114Spatial Analysis and Computer-Aided Drafting2 EGT 201Advanced Computer Aided Drafting2"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Behavioral finance certificate": {
        "program_description": "Program Description\n\n\nThis certificate is an interdisciplinary certificate offered jointly by the Black School of Business and the School of Humanities and Social Sciences. This certificate program is designed to prepare both current and returning students for a career in personal finance; and, for those interested in better understanding the ways in which social and cognitive psychology impact financial decisions. This certificate will cover core content in social psychology, cognitive psychology, behavioral economics, and behavioral finance. The certificate requires a total of 18 credit hours and can be completed concurrently with a Penn State Behrend degree or via continuing education.\n\n\nWhat is Behavioral Finance?\n\n\nBehavioral Finance is the merger of psychology and financial decision making. We all make shortcuts as we process new information. This discipline explores how these shortcuts impact everyday decisions, investment decisions, and even financial management (i.e., corporate finance) decisions.\n\n\nYou Might Like This Program If...\n\n\nYou are intrigued by why investors buy and sell stocks at certain times. This certificate also considers why financial managers make decisions to merge firms, to pay dividends, or to make many other financial decisions. Psychology influences most decisions that we make, and this certificate explores this area with an eye for finance.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses ECON 102Introductory Microeconomic Analysis and Policy 3 ECON 474Experimental and Behavioral Economics3 FIN 477Behavioral Finance3 PSYCH 100Introductory Psychology 3 PSYCH 221Introduction to Social Psychology 3 PSYCH 256Introduction to Cognitive Psychology 3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Behavioral health counseling psychology certificate": {
        "program_description": "Program Description\n\n\nThis 15 credit certificate provides the core information and competencies for students interested in pursuing a position in behavioral health and clinical or counseling psychology. It will be attractive to both psychology majors interested in pursuing clinical psychology and adult students taking courses part time for career advancement. This may also serve as the gateway to a minor or major in psychology. It is consistent with psychology program goals to develop clear career tracks for current students in clinical and counseling psychology.\n\n\nWhat is Behavioral Health and Counseling Psychology?\n\n\nBehavioral health and counseling psychology is an applied field of psychology and counseling that helps people to improve their functioning, both as individuals and in their relationships with others. Clinical and counseling psychologists help people with physical and mental health issues to improve their well-being, reduce stress, and resolve crises.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a Psychology major interested in a psychology, counseling, or social work career.\n\n\nYou are in an applied health career and want to learn more about mental health and counseling.\n\n\nYou want to work with people using cognitive, behavioral, or emotion regulation techniques.\n\n\nYou would like to help people who struggle with a mental illness.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses PSYCH 270Introduction to Abnormal Psychology3 PSYCH 481Introduction to Clinical Psychology3 PSYCH 495Internship3 In addition to the 9 credits of coursework listed, students may choose any two (6 credits) of the following:6 PSYCH 238Introduction to Personality Psychology PSYCH 243Introduction to Well-being and Positive Psychology PSYCH 404/EDPSY 450Principles of Measurement PSYCH 423Social Psychology of Interpersonal/Intergroup Relationships PSYCH 470Abnormal Psychology PSYCH 471Psychology of Adjustment and Social Relationships PSYCH 473Behavior Modification PSYCH 474Psychological Intervention in Childhood PSYCH 476Child Psychopathology PSYCH 477Mental Health Practicum with Children PSYCH 478Clinical Neuropsychology"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Biblical studies certificate": {
        "program_description": "Program Description\n\n\nThe Biblical Studies Certificate program is designed to provide students with a foundation in the academic study of the Bible, both the Jewish and Christian canons. Through a flexible and student-centered course of study, beginning with courses in the Hebrew Bible/Old Testament and the New Testament, and including a variety of elective courses within or related to the field of Biblical Studies, students will be exposed to the academic methods and approaches to understanding the Bible.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses JST 110Hebrew Bible: Old Testament 3 JST 112Jesus the Jew 3 or JST 120 New Testament or JST 124 Early and Medieval Christianity Additional courses, no more than one of which may be a language course:6 JST 4Jewish and Christian Foundations JST 10Jewish Civilization JST 12 JST 70 JST 90Jerusalem: Past, Present, and Future JST 102Ancient Israel JST 104The Bible as Literature JST 111Early Judaism JST 122Apocalypse and Beyond JST 123History of God: Origins of Monotheism JST 153Dead Sea Scrolls JST 420Archaeology of the Near East JST 421Aramaic JST 425WBooks of the Bible: Readings and Interpretation GREEK 2 HEBR 151Introductory Biblical Hebrew HEBR 152Intermediate Biblical Hebrew"
        },
        "electives": "The Biblical Studies Certificate program is designed to provide students with a foundation in the academic study of the Bible, both the Jewish and Christian canons. Through a flexible and student-centered course of study, beginning with courses in the Hebrew Bible/Old Testament and the New Testament, and including a variety of elective courses within or related to the field of Biblical Studies, students will be exposed to the academic methods and approaches to understanding the Bible.",
        "supporting_courses": ""
    },
    "Chemical dependency prevention counseling certificate": {
        "program_description": "Program Description\n\n\nThe Certificate in Chemical Dependency Prevention and Counseling introduces students to basic concepts related to chemical dependency, its prevention and treatment, and helping those with problems associated with chemical dependency. The certificate provides students with the academic background to understand content, models, theories, and research relevant to working with chemically dependent persons and their families.\n\n\nWhat is Chemical Dependency Prevention and Counseling?\n\n\nChemical Dependency Prevention and Counseling focuses on evidence-based practices used in the prevention of substance use disorders and intervention of individuals and families impacted by substance use disorders.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou find it meaningful to work with individuals and families impacted by substance abuse and addiction.\n\n\nYou aspire to help people enhance their physical and mental wellbeing.\n\n\nYou value working in settings that focus on holistic approaches to counseling and recovery.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses BBH 143Drugs, Behavior, and Health 3 CNED 401Foundations of Chemical Dependency Counseling3 CNED 404Group Procedures in Guidance and Counseling3 or RHS 303 Group Work in Rehabilitation Practice and Human Services HLHED 443Alcohol and Drug Education3 or CNED 421 Counseling Strategies for Preventing Chemical Dependency RHS 301Introduction to Counseling as a Profession3 or HDFS 414 Resolving Human Development and Family Problems Select one of the following:3 CNED 416Interpersonal Relationships and Alcohol and Other Drugs (AOD) Dependency CNED 420Chemical Dependency: Youth at Risk CNED 423Student Assistance Programs"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Child development certificate": {
        "program_description": "Program Description\n\n\nThis 15 credit certificate will provide the core information and competencies for students interested in pursuing the field of child development. Students will be provided with a broad overview of the developmental processes underlying child and adolescent development. This certificate will be attractive to both psychology majors as well as adult students taking courses part time for career advancement. The certificate may also serve as the gateway to a minor or major in psychology. It is consistent with psychology program goals to develop clear career tracks for current students interested in the applied fields of psychology.\n\n\nWhat is Child Development?\n\n\nChild development is a broad field of study involving the physical, intellectual, psychological, and emotional progression of children and adolescents. The certificate in Child Development offers a wide overview of the processes underlying child and adolescent development and the influences of developmental contexts such as family, school, peers, and culture.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy working with children and adolescents and want to learn more about their physical, cognitive, social, and emotional development.\n\n\nYou are interested in a career in human services, behavioral health, education, family services, policy and advocacy work, community programs, or child care.\n\n\nYou want to pursue a career in education.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses PSYCH 212Introduction to Developmental Psychology 3 or HDFS 129 Introduction to Human Development and Family Studies Select 6 credits of the following:6 PSYCH 410Child Development PSYCH 412Adolescence PSYCH 476Child Psychopathology Select 6 credits of the following:6 EDPSY 14Learning and Instruction HDFS 229Infant and Child Development PSYCH 221Introduction to Social Psychology PSYCH 238Introduction to Personality Psychology PSYCH 256Introduction to Cognitive Psychology PSYCH 413Cognitive Development PSYCH 414Social and Personality Development PSYCH 473Behavior Modification"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Climate environmental change certificate": {
        "program_description": "Program Description\n\n\nThe Climate and Environmental Change Certificate is intended for students seeking to understand the spatial patterns and physical processes of climate change and variability, and to hone their skills of environmental data collection, analysis, and interpretation. Upon completing this certificate, students will be able to explain the environmental processes and patterns associated with climate change; identify and distinguish between natural climate variations and observed processes of climate change; utilize data from field experiments, satellite and aerial imagery, observation archives, and computer modeling to analyze climate change patterns across space.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses Required Courses: Require a grade of C or better GEOG 310Introduction to Global Climatic Systems3 or GEOG 310W Introduction to Global Climatic Systems Select 9-10 credits from the following (may not choose more than 1 course from GEOG 362, GEOSC 482, or METEO 477)9-10 EARTH 402Modeling the Earth System GEOG 362Remote Sensing and Image Analysis GEOG 410 GEOG 412WClimatic Change and Variability GEOG 417Satellite Climatology GEOG 438WHuman Dimensions of Global Warming GEOSC 320Geology of Climate Change GEOSC 450Risk Analysis in the Earth Sciences GEOSC 482Satellite Remote-Sensing For Earth Observation METEO 436Radiation and Climate METEO 469From Meteorology to Mitigation: Understanding Global Warming METEO 470Climate Dynamics METEO 477Fundamentals of Remote Sensing Systems"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Community forestry certificate": {
        "program_description": "Program Description\n\n\nThe population of the United States is projected to grow 48% from 296 million in 2005 to 438 million in 2050. Planning for and managing natural resources closer to people and communities will become more important, not less. Demand for professionals (foresters, landscape architects, landscape contractors, city planners) with training in the best management of community forests will continue to grow. The goal of the 15-credit Community Forestry certificate is to provide advanced knowledge on the planning and management of trees, forests, and other natural resources including their role in community development. Participants will gain an understanding of soils, tree care and maintenance, community forestry management plans, land use planning and regulatory policy, and working in connected human ecological systems.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in better planning and managing streetscapes, parks, and other public landscapes.\n\n\nYou are interested in conserving ecosystem processes and providing ecosystem services in built environments.\n\n\nYou enjoy connecting people with the natural resources that provide for their health, happiness, and quality of life.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses FOR 401Urban Forest Management3 HORT 301Principles of Arboriculture3 SOILS 101Introductory Soil Science 3 HORT 408Landscape Plant Establishment and Maintenance3-4 or SOILS 404 Urban Soils Select one of the following:3 CAS 404Conflict Resolution and Negotiation CED 327Environment and Society ERM 411Legal Aspects of Resource Management FOR 450WHuman Dimensions of Natural Resources"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Crime psychology public policy certificate": {
        "program_description": "Program Description\n\n\nThe 15 credit undergraduate certificate program in Crime, Psychology, and Public Policy (CRMPPP) provides students an overview of the causes of crime and criminal behavior, the legal and criminal justice processes, and public policy toward crime-related issues. Students receive an in-depth understanding of the social and psychological causes of crime, policies to fight and prevent crime, the use of psychology to analyze and investigate criminal behavior, and the legal processes that involve accused and convicted criminals. The certificate program is intended for those who are interested in learning more about the criminal justice system and the causes of crime. Knowledge of the causes of criminal behavior and the criminal justice system are important to careers in the police, security, the correctional system, social work, law, psychology, journalism, and government or politics.\n\n\nWhat is Crime, Psychology, and Public Policy?\n\n\nCrime, Psychology, and Public Policy is a certificate program that provides an overview of the causes of criminal behavior through both a sociological and psychological lens. It also highlights the relationship between public policy and the laws society creates to protect its citizens. The certificate is designed for those interested in learning more about how the criminal justice system uses a multidisciplinary approach to aid in the understanding of crime and justice.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to understand the causes of criminal behavior.\n\n\nYou want an overview of the criminal justice system.\n\n\nYou are intrigued by the relationship between public policy and criminal law.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Criminology SOC 12Criminology 3 Crime and the Individual Select 3 credits from the Crime and the Individual area from approved department list3 Crime and Society Select 3 credits from the Crime and Society area from approved department list3 Crime and Public Policy Select 3 credits from the Crime and Public Policy area from approved department list3 Crime and Law Select 3 credits from the Crime and Law area from approved department list3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Development sustainability africa certificate": {
        "program_description": "Program Description\n\n\nThe African continent is the most ecologically and geographically diverse region in the world. It is the most resource rich, yet it is considered, at least in the Western world, the poorest and most “in need of help”. Why is this so? This 12-credit certificate in Development and Sustainability in Africa will engage students with the issues, debates, and analyses related to sustainable, equitable, and decolonial development in Africa. Students will learn about relationships between development and the different environments on the continent, Students will consider the inter-relationships between development and equality, as well as the key drivers of change. This certificate will provide students an opportunity to engage with current topics from a specifically African perspective. Students will receive training in development theory and practice to understand the place of Africa in global environmental change. Students will learn to critically analyze the complex interrelationships and trades offs between development and environmental costs. Students can choose to focus on an area of study such as: resource extraction and governance (e.g. mining), food and agriculture, water, renewable energy (e.g. solar), and, development practice. This certificate will include an optional study abroad opportunity. Learning Outcomes: By the end of the certificate, students will be able to: - (PO1) Identify, describe, and compare key issues in sustainability and development in Africa; - (PO2) Think critically and discuss the drivers of development and environmental degradation; - (PO3) Understand and interpret the ways the continent is embedded in global systems that impact sustainability and development locally and globally.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses AFR 105African Biodiversity and Conservation 3 AFR 205Development and Sustainability in Africa 3 Select 6 credits from the following (relevant African Studies course, or focal topic course taught by an affiliated faculty member):6 AFR 440Globalization and Its Implications AFR 444Resource Governance in Africa AFR 464Extractive Industries in Africa AFR/RPTM 497Special Topics GEOG 230Geographic Perspectives on Environment, Society and Sustainability GEOG 430Human Use of Environment FOR 418Agroforestry: Science, Design, and Practice FOR 488Y Upper-level independent study with approved faculty"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Digital arts certificate": {
        "program_description": "Program Description\n\n\nThis 15-credit course will help you master the powerful combination of artistic knowledge and technical skills necessary to create professional, high-quality digital portfolios. You will learn some of the latest production techniques for generating computer-based graphics, digital photography, and media-rich web productions.\n\n\nWhat is Digital Arts?\n\n\nDigital Art is the combination of artistic knowledge and technical skills to create professional, high-quality digital productions that can be applied across industries and professions. Blending art theory with internet-based technologies, digital art synthesizes concepts of multimedia and visual arts and design with production techniques for generating computer-based graphics and media-rich web productions.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in computer-based graphics, multimedia, art, or media-rich web design.\n\n\nYou want to strengthen your existing skills to support your professional responsibilities.",
        "entrance_to_major": "Entrance Procedures\n\n\nFor specific information on entrance procedures, please visit the \nwebsite for the College of Arts and Architecture\n.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ART 10Introduction to Visual Studies 3 or ART 20 Introduction to Drawing ART 211YIntroduction to Digital Art and Design Criticism3 DART 300Digital Portfolio Elements3 DART 412Portfolio Design and Professional Practices3 Select one of the following:3 DART 2022D Digital Art & Computer Graphics DART 2033D Digital Art & Design Fundamentals DART 204Animation Fundamentals DART 206Web Design and Visual Web Development"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Diversity studies certificate": {
        "program_description": "Program Description\n\n\nThis certificate is designed to provide students with an overview of issues concerning diversity. Students will take one foundational class and additional courses examining women, gender, sexuality, race, ethnicity, and religion.\n\n\nWhat is Diversity Studies?\n\n\nDiversity Studies is an interdisciplinary academic field that is interested in examining social differences defined by culturally constructed categories of race, class, gender, religion, ethnicity, age, diversity, and other markers of identity. Diversity Studies however tends to focus on our own lived experiences, and how our perception of these markers influences personal and cultural interactions – especially our own! It investigates systems of power that organize our schools, workplaces, healthcare systems, criminal justice system, and media, many of them invisible to us. Around the globe those systems of power are organized very differently, sometimes in fundamental ways. Diversity Studies approaches differences intersectionally to expose, critique, and confront historical and contemporary sources of social and cultural conflict. This does not mean “looking past” differences; rather, looking straight at them to find the common ground and empathy that can make us better citizens.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to better understand people from different backgrounds.\n\n\nYou are interested in impacting social problems.\n\n\nYou want to stretch your own perspectives and actions.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Foundation Courses Foundation Courses: Require a grade of C or better Select 3 credits from the following:3 AMST 105American Popular Culture and Folklife PSYCH 232Cross-Cultural Psychology SOC 5Social Problems WMNST 1Introduction to Women's Studies WMNST 106NRepresenting Women and Gender in Literature, Art and Popular Cultures Select 9 credits chosen from Lists II and III; at least 3 credits must be at the 400 level; students must take at least 3 credits from each list:9 List II: Courses on Women, Gender, and Sexuality CRIMJ 453Women and the Criminal Justice System ENGL 194Women Writers HDFS 405Gender and Social Development HIST 117Women in United States History NURS 452Women's Health Issues PSYCH 231Introduction to the Psychology of Gender PSYCH 422Human Sexuality SOC 456Gender, Occupations, and Professions THEA 207Gender and Theatre THEA 407WWomen and Theatre List III: Courses on Race, Ethnicity, and Religion CRIMJ 451Race, Crime, and Justice ENGL 135Alternative Voices in American Literature ENGL 139African American Literature HIST 152African American History HIST 153YThe Indian in North America PHIL 9Race, Racism, and Diversity RLST 1Introduction to World Religions"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Earth sustainability certificate": {
        "program_description": "Program Description\n\n\nBy the time current undergraduates send their children to college, Earth's population will have increased to more than eight billion people. Our climate will be warmer and characterized by more frequent extreme weather events including droughts. One or more major metropolitan areas in our increasingly crowded world will have experienced a devastating hurricane or typhoon, sea level rise will be inundating low-lying coastal cities along with whole island nations, energy resources will be less available and more expensive, clean drinking water will be more scarce, and it will be increasingly difficult to feed the global population. How we choose to plan for and attempt to mitigate these \"grand challenges\" will have consequences for individuals, nations, and our global socioeconomic and political systems.\n \nThe goal of the 12-credit Certificate Program in Earth Sustainability is to dramatically increase geoscience literacy of all undergraduate students, including the large majority that do not major on the geosciences, future K-12 teachers, and also those who are historically underrepresented in the geosciences, such that they are better positioned to make sustainable decisions in their lives and as part of the broader society.\n\n\nWhat is Earth Sustainability?\n\n\nThe Earth Sustainability certificate program is designed to provide students with the knowledge needed to make well-informed, environmentally sustainable decisions. It increases geoscience literacy and addresses key sustainability issues, such as the impact of climate change on Earth and its inhabitants, access to clean drinking water, sustainable energy, and the hazards posed by our overpopulated coastal regions.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are passionate about sustainability and the environment.\n\n\nYou want a better understanding of the science behind and potential effects of climate change.\n\n\nYou want to know more about the complexities, challenges, and opportunities involved in planning for the Earth's future.\n\n\nYou would like to explore both the scientific and the social aspects of big problems like population growth, resource management, and climate change.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses EARTH 1033 Select 9 credits from the following:9 EARTH 104NClimate, Energy and Our Future EARTH 107NCoastal Processes, Hazards and Society EARTH 109The Fundamentals of Shale Energy Development EARTH 111 GEOG 3NFood and the Future Environment"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Energy finance certificate": {
        "program_description": "Program Description\n\n\nThe Energy Finance certificate program is designed for students who desire to combine their engineering emphasis in energy systems with the financial expertise gained through courses in financial analysis and risk management.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in helping risk managers understand the interrelationships among and between the various industries that make up the global energy marketplace. That marketplace has changed dramatically over the last decade, and the headwinds and challenges now facing the energy industry dictate a distinct type of program.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses Required Courses: Require a grade of C or better EBF 200Introduction to Energy and Earth Sciences Economics 3 EBF 301Global Finance for the Earth, Energy, and Materials Industries3 or MET 436 Energy Conservation Systems EGEE 101Energy and the Environment 3 FIN 418Energy Finance3 FIN 427Derivative Securities3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Engineering community engagement certificate": {
        "program_description": "Program Description\n\n\nA certificate in Engineering and Community Engagement is proposed for students in the College of Engineering. This certificate is intended to acknowledge students who have gained proficiency in design, research and application of appropriate technologies for use in serving communities in the U.S. and abroad while stressing an awareness of the cultural context of such engineering activities. Collaborations with communities are strongly encouraged along with emphasis on the importance of ethical considerations in collaborating/working in community settings. All students in good academic standing are eligible for admission to the program.\n\n\nWhat is Engineering and Community Engagement?\n\n\nEngineering and Community Engagement focuses on combining design, research, and engineering principles to address needs of communities in the U.S. and abroad, all while stressing cultural awareness, sustainability, innovation, and teamwork.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou would like to partner with communities to make a difference.\n\n\nYou would like to explore and implement solutions to real problems.\n\n\nYou would like to lead design and build teams.\n\n\nYou would like to broaden your perspectives by collaborating with community stakeholders.\n\n\nYou would like to develop professional skills.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses EDSGN 352 EDSGN 452Projects in Humanitarian Engineering2 ENGR 496Independent Studies1-18 YFE 2113 Select one of the following:1-18 EDSGN 395Internship ENGR 408Leadership Principles ENGR 411Entrepreneurship Business Basics ENGR 425New Venture Creation ENGR 493Individual Leadership Experience"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Engineering design digital tools certificate": {
        "program_description": "Program Description\n\n\nThe Engineering Design with Digital Tools (EDDiT) certificate is a 13-credit certificate that enables students to specialize in digital design tools. This provides students with the opportunity to more fully develop their CAD and design skills, which are highly sought after by industry. Students are required to take at least one section of Engineering Design and Analysis with CAD (EDSGN 468), with each course section offering a different software package, such as SolidWorks, AutoCAD, or Catia. The certificate culminates in the preparation of a portfolio, through which students document and display their design work in a professional manner. Students must earn a C grade or better in each prescribed and additional course or independent study or pursue a replacement option.\n\n\nWhat is Engineering Design?\n\n\nEngineering Design is based on the concept of integrating ideas, disciplines, people, and resources within engineering and beyond that are necessary to achieve optimal design solutions for products, systems, processes, and services.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning about new design methods.\n\n\nYou would like to learn more about interdisciplinary applications of design such as sustainability, innovative design, design for human variability, global design, and affective design.\n\n\nYou are interested in interdisciplinary integrated design involving two or more distinct fields of knowledge.\n\n\nYou would like to develop a portfolio of your design projects.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses EDSGN 100Cornerstone Engineering Design3 EDSGN 468Engineering Design and Analysis with CAD3 EDSGN 485Engineering Design Portfolio1 Select 6 credits from the following or from an approved list maintained by the program:6 EDSGN 110Spatial Analysis in Engineering Design EDSGN 210Tolerancing and Spatial Models EDSGN 462Introduction to Design for Additive Manufacturing EDSGN 468Engineering Design and Analysis with CAD EMCH 461Finite Elements in Engineering"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Engineering design certificate": {
        "program_description": "Program Description\n\n\nThe certificate provides an opportunity to pursue a specialization in engineering design; offering an incentive to take more courses in design and participate in more design projects, thereby improving employment prospects. Students must earn a C grade or better in each prescribed or additional course or independent study or pursue a replacement option. A minimum of 7 credits of required courses an an additional 6 credits of supporting courses minimum (at 400-level or above) are needed for completion of the certificate.\n\n\nWhat is Engineering Design?\n\n\nEngineering Design is based on the concept of integrating ideas, disciplines, people, and resources within engineering and beyond that are necessary to achieve optimal design solutions for products, systems, processes, and services.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in learning about new design methods.\n\n\nYou would like to learn more about interdisciplinary applications of design such as sustainability, innovative design, design for human variability, global design, and affective design.\n\n\nYou are interested in interdisciplinary integrated design involving two or more distinct fields of knowledge.\n\n\nYou would like to develop a portfolio of your design projects.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses EDSGN 100Cornerstone Engineering Design3 EDSGN 367Design Thinking and Making3 EDSGN 485Engineering Design Portfolio1"
        },
        "electives": "",
        "supporting_courses": "Supporting Courses"
    },
    "Enterprise resource planning oracle certificate": {
        "program_description": "Program Description\n\n\nThe Certificate in ERP with Oracle will instruct you in Oracle Enterprise Resource Planning software. Oracle ERP is an integrated multi-module application software that supports business processes. Oracle is one of the top ERP vendors and the skills gained by learning this software will allow you to become more valuable in the current marketplace. Oracle certification is valuable to hiring managers who want to distinguish among candidates for critical IT positions. This program enables students to become proficient in Oracle applications and system software and prepares them for the Oracle Certified Professional Consultant exams. Students who complete this certificate will have the ability to implement, integrate, and support eBusiness applications.\n \nOracle eBusiness is one of the most widely implemented ERP packages worldwide and is used by customers in more than 150 countries. ERP skills are in demand and salaries are on the rise. The certificate in Oracle eBusiness Suite will allow you to become more valuable in the current marketplace and will distinguish you among candidates for critical positions within all functional areas in an organization.\n\n\nWhat is Enterprise Resource Planning with Oracle?\n\n\nEnterprise resource planning, or ERP, is the business function that uses software and other information systems to integrate day-to-day business processes such as accounting, procurement, project management, and manufacturing. ERP systems collect and filter information from multiple sources, eliminating duplication and creating data integrity. This results in greater efficiency, lower operational costs, collaboration across business units, and consistent business infrastructure. Oracle is a leading provider of software- and cloud-based ERP systems. This certificate is excellent preparation for the examination required to become an Oracle E-Business Suite Advanced Supply Chain Planning Consultant Certified Expert.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a business major interested in supply chain management.\n\n\nYou envision a career in information technology.\n\n\nYou want to start your job search with a professional credential.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Select 9 credits of the following:9 MIS 404Introduction to ERP and Business Processes MIS 405Supply Chain Information Systems with Oracle MIS 406Customer Information Systems with Oracle MIS 407Enterprise Integration with Oracle"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Erp with sap certificate": {
        "program_description": "Program Description\n\n\nThe Enterprise Resource Planning (ERP) with Systems, Applications, and Products (SAP) certificate is designed to provide students with practical knowledge of E-Business Application Software. Students must complete three courses that are centered in SAP technology with a C or better. The courses focus on in-depth concepts and theories related to supply chain and management information systems technologies and include numerous learning-by-doing (LBD) activities and hands-on lab exercises. The students will learn from the textbook and instructor lessons advanced business concepts, and will then complete associated LBD assignments. These hands-on exercises will test the application and understanding of the textbook concepts by allowing the students to perform the detailed business process on the latest version of SAP’s ERP application platform utilizing the same set of steps that occur in industry.\n\n\nWhat is ERP with SAP?\n\n\nEnterprise resource planning, or ERP, is the business function that uses software and other information systems to integrate day-to-day business processes such as accounting, procurement, project management, and manufacturing. ERP systems collect and filter information from multiple sources, eliminating duplication and creating data integrity. This results in greater efficiency, lower operational costs, collaboration across business units, and consistent business infrastructure. SAP is the world’s largest enterprise application software company, with 335,000 customers in over 180 countries. SAP certification helps to validate your expertise and experience.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a business major interested in ERP.\n\n\nYou envision a career in information technology.\n\n\nYou want to start your job search with a global professional credential.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses Required Courses: Require a grade of C or better MIS 404Introduction to ERP and Business Processes3 SCM 445Operations Planning and Control3 SCM 460Purchasing and Materials Management3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Environment society geography certificate": {
        "program_description": "Program Description\n\n\nThe 12-credit Certificate in Environment and Society Geography will engage students with issues, knowledge, and diverse forms of learning, analysis, and exposition related to the interactions of human societies and environments. This certificate is based on the twin foundations of this sub-field of geography, namely human-environment interactions and nature-society relations. Its purpose is to train students to use frameworks such as political ecology and environmental geography to provide the tools and concepts of change and sustainability necessary to analyze human-environment systems, environmental problems, and remediation across local-to-global scales, and the political economy of resource use and management.\n \nLearning objectives: Identify, describe, and analyze human-environment systems and processes across the globe; recognize how humans depend on, alter, and manage their environment in various places; and think critically about addressing complex human-environment challenges.\n\n\nWhat is Environment and Society Geography?\n\n\nEnvironment and society geography examines how human society and the natural world are interconnected. This certificate specifically addresses how geographers approach questions concerning human-environment relations, environmental processes, and environmental justice. Students who enroll in this certificate program will engage frameworks such as political ecology, environmental geography, sustainability, and globalization. Courses that contribute to this certificate cover topics such as conservation, agriculture, food, water, energy, climate change and health, as well as the complex ways these elements interact. Upon completing the certificate, students will be able to analyze human-environment systems, the political economy of resource use and management, environmental problems, and remediation across local-to-global scales. Focus areas include: conservation and protected areas; development; environmental health and inequality; urban-rural dynamics; food-energy-water nexus; and environment-society interactions involving agriculture, nutrition, and well-being.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in the complex interactions between environments and society.\n\n\nYou want to obtain the tools needed to address both the social and natural dimensions of environmental issues associated with health, sustainability, food scarcity, climate change, energy alternatives, water resources and urban and industrial growth.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 230Geographic Perspectives on Environment, Society and Sustainability3 Select 9 credits from the following:9 GEOG 330NPolitical Ecology GEOG 333Human Dimensions of Natural Hazards GEOG 430Human Use of Environment GEOG 431Geography of Water Resources GEOG 432Energy Policy GEOG 433Geographies of Justice GEOG 434Politics of the Environment GEOG 436Ecology, Economy, and Society GEOG 438WHuman Dimensions of Global Warming GEOG 439Property and the Global Environment Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Financial controllership certificate": {
        "program_description": "Program Description\n\n\nThis certificate is designed to provide you with the skill sets to succeed in becoming a corporate accounting and financial management professional. Required coursework is aligned with topics covered by the Certified Management Accountant (CMA) examination. CMA certification demonstrates expertise in financial planning, analysis, control, decision support, and professional ethics.\n\n\nWhat is Financial Controllorship?\n\n\nThe financial controller holds a leadership position within an organization. The controller’s responsibilities include protecting and preserving the organization’s assets; making financial reports to executive leadership, the board of directors, stockholders, and taxing bodies; and involvement in financial decision-making.\n\n\nYou Might Like This Program If...\n\n\nYou are an Accounting or Finance major who aspires to a financial leadership position.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ACCTG 340Cost Accounting3 ACCTG 422Accounting Systems3 ACCTG 426Financial Statement Analysis3 FIN 420Investment and Portfolio Analysis3 FIN 461Portfolio Management and Analysis3 Code Title Credits ACCTG 211Financial and Managerial Accounting for Decision Making4 ACCTG 305Financial Statements and Management Decisions4 or ACCTG 371 Intermediate Accounting I ACCTG 312Accounting Technology Lab3 FIN 301Corporation Finance3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Financial planning certificate": {
        "program_description": "Program Description\n\n\nThis certificate provides an introduction to personal financial planning and includes the areas of insurance, taxes, investments, retirement planning and estate planning.\n\n\nWhat is Financial Planning?\n\n\nFinancial planners are professionals who help individuals and businesses to reach their investment goals. Penn State Behrend’s certificate in Financial Planning is a registered program with the Certified Financial Planner Board of Standards and fulfills the coursework requirement for the CFP Board’s CFP certification program.\n\n\nYou Might Like This Program If...\n\n\nYou are an Accounting or Finance major who aspires to a financial planning career.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ACCTG 310Federal Taxation I3 FIN 330Personal Financial Planning3 FIN 420Investment and Portfolio Analysis3 FIN 430Estate Planning3 FIN 450Retirement Planning3 FIN 491Financial Planning Capstone3 Code Title Credits FIN 301Corporation Finance3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Financial risk management certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to prepare students for a career in risk management; and, for those interested, to gain exposure to topic that constitute the first part of the Financial Risk Manager (FRM) exam, sponsored by the Global Association of Risk Professionals (GARP). The FRM exam is the primary industry designation with over 20,000 candidates taking the exam twice a year. Students completing the certificate are prepared to pass the first part of this two-part exam. The certificate requires a total of 21 credit hours and can be completed concurrently with a Penn State Behrend degree or via continuing education. For more information please see: \nhttp://psbehrend.psu.edu/Academics/academic-programs/certificate-programs-1\n.\n\n\nWhat is Financial Risk Management?\n\n\nFinancial risk management is the practice of managing exposure to potential economic losses. Penn State Behrend’s certificate in Financial Risk Management includes preparation for the first part of the Financial Risk Manager certification exam sponsored by the Global Association of Risk Professionals.\n\n\nYou Might Like This Program If...\n\n\nYou are an Accounting or Finance major who aspires to a career in financial risk management.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses FIN 301Corporation Finance3 FIN 420Investment and Portfolio Analysis3 FIN 427Derivative Securities3 FIN 461Portfolio Management and Analysis3 STAT 200Elementary Statistics 4 or SCM 200 Introduction to Statistics for Business STAT 3013 STAT 462Applied Regression Analysis3 or ECON 485 Econometric Techniques"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Foundations business certificate": {
        "program_description": "Program Description\n\n\nIntroduction to core business concepts. Students develop communication, technical, and analytical skills needed for the contemporary business environment.\n\n\nWhat is Foundations of Business?\n\n\nThe Foundations of Business Certificate is offered by the University College. Regardless of your field of study and career goals, you are very likely to utilize foundational business knowledge in your future career. If you are in a non-business major, this certificate will broaden your fundamental business knowledge and help you develop the basic skills that will be useful in your chosen career path.\n\n\nYou can complete this 13-credit certificate program within a year.  The certificate provides foundational knowledge in communication, ethics and social responsibility, and contemporary information technology as tools to accomplish professional tasks effectively.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou desire to add business skills to your degree program.\n\n\nYou want to gain exposure to business concepts to enhance your employment opportunities.\n\n\nYou want to earn a business certificate as a stepping stone to enrolling in an associate or baccalaureate degree program.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses BA 243Social, Legal, and Ethical Environment of Business4 or BA 241& BA 242 Legal Environment of Businessand Social and Ethical Environment of Business ECON 102Introductory Microeconomic Analysis and Policy 3 or ECON 104 Introductory Macroeconomic Analysis and Policy ENGL 15& MIS 204Rhetoric and Composition and Introduction to Management Information Systems 6"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Foundations organizational leadership certificate": {
        "program_description": "Program Description\n\n\nThis 12-credit certificate will provide a solid foundation in leadership concepts and employment relations that can enhance student leadership and managerial skills. The courses can be applied to the bachelor's degree in Organizational Leadership.\n \nSpecifically built for adult learners, students will learn with a Penn State instructor and other adult learners. Accelerated evening courses meet once a week for seven weeks in-person or via live video instruction with online learning components. As a participant either in the classroom or via video technology, students can communicate with the instructor and interact with other students.\n\n\nWhat is Foundations of Organizational Leadership?\n\n\nThe Foundations of Organizational Leadership certificate is a 12-credit sequence of classes that provides an introduction to key leadership concepts and practices and provides students with the knowledge and skills that are characteristic of effective leaders. Certificate programs focus on a specific skill set, allowing you to earn this Penn State credential in a relatively short time.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to enhance your leadership and management skills while gaining skills that are characteristic of effective leaders.\n\n\nYou want to gain specialized knowledge on workplace and employment issues from both the employee's and employer's perspective.\n\n\nYou want to build your resume to advance your career.\n\n\n\n\nMORE INFORMATION ABOUT FOUNDATIONS OF ORGANIZATIONAL LEADERSHIP",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses OLEAD 100Introduction to Leadership 3 OLEAD 201Organizational Theory and Functions for Leaders 3 OLEAD 210Evidence-Based Leadership 3 OLEAD/LHR 465Collective Decision Making3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Geographic information science certificate": {
        "program_description": "Program Description\n\n\nThe 12-credit Geographic Information Science (GIS) certificate is aimed at students who wish to be current in geographical representation and geospatial analysis. Through courses for the GIS certificate, students will understand and know how to apply various GIS and geospatial analysis tools to represent, analyze, and advise on the geospatial dimensions of natural and social phenomena. Students will gain firsthand experience using the most up-to-date tools and techniques available in the field of GIS today. Areas of study include cartography, remote sensing, and geographic information systems.\n \nLearning objectives: Describe the conceptual foundations on which geographic information science and systems are based, use geospatial tools to perform spatial analysis and mapping tasks, and create solutions to geographic problems using geographic information science and technology.\n\n\nWhat is Geographic Information Science?\n\n\nGeographic Information Science (GIScience) is one of four key subdisciplines within Geography (along with human geography, physical geography, and environment-society geography). Its primary areas of study include cartography, geographic information systems, remote sensing, and spatial statistics. Students who study GIScience learn how to use the latest tools and techniques to visually represent and analyze spatial data in order to understand and address real-world environmental and social problems. Applications of geographic information science range from emergency response to natural resource management to social policy analysis to location intelligence for business.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou like technology and maps, and want to acquire skills using a spatial perspective to differentiate yourself in the workforce after graduation.\n\n\nYou would like to apply spatial science and technology to solve social, environmental, and industrial problems. You want to apply the geographic perspective through science and technology to enhance the knowledge, skills, and abilities developed in your major program of study.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 260Geographic Information in a Changing World: Introduction to GIScience 3 Select 9 credits from:9 GEOG 361Cartography--Maps and Map Construction GEOG 362Remote Sensing and Image Analysis GEOG 363Geographic Information Systems GEOG 365Intermediate GIS Programming Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Geospatial big data analytics certificate": {
        "program_description": "Program Description\n\n\nGeospatial data are central to the challenges and opportunities for science and society that big data provide. Geospatial data derive from a rapidly expanding array of sources that include sensors (from satellites, to cameras and other sensing devices carried by UAVs, to distributed sensors monitoring energy consumption, pollution, traffic, and more with smart cities), GPS enabled devices (in vehicles, smart phones, cameras, human wearable devices, and even ones small enough to mount on migrating songbirds), citizen science efforts producing volunteered geospatial data, address-linked public health and many other records, retail transactions, and location-linked social media posts. As geospatial data become more ubiquitous, big digital geospatial data has become an essential part of geographic analysis. The 12-credit Geospatial Big Data Analytics certificate is aimed at students who are seeking advanced data collection, processing, analysis, and communication knowledge and skills related to leveraging the growing array of geographically linked big data. Courses for this certificate have prerequisites that are not included in requirements for the certificate; such prerequisites may be completed through the undergraduate Geographic Information Science certificate.\n \nLearning objectives: demonstrate an understanding of the breadth of methods and techniques available for handling large volumes of heterogeneous, rapidly-changing data; use multiple methods and techniques to conduct spatial analyses of big data and apply resulting analyses to problems within the student’s own discipline.\n\n\nWhat is Geospatial Big Data Analytics?\n\n\nNo matter how sophisticated information technology gets, there is nothing that can replicate the combination of two unique pieces of data: time and place. Geospatial data come from a variety of sources, including sensors, GPS-enabled devices, volunteered geospatial data, and location-linked records and social media posts. Geographic information scientists and other geographers collect and use big data to analyze social and natural phenomena about our world. As geospatial data become more ubiquitous, big digital geospatial data has become an essential part of geographic analysis. Students enrolled in this certificate can learn how to collect, process, analyze, and communicate a wide range of geospatial big data.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in the use of big data to analyze spatial, social, and natural phenomena about our world.\n\n\nYou want to learn how spatial big data models aid in understanding logistics, finance, shipping, advertising, entertainment, and journalism.\n\n\nYou are curious about how big data can deliver much-needed context to decision making in many areas.\n\n\nYou want to know where and when people and things exist in the real world.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 365Intermediate GIS Programming3 Select 9 additional credits, including at least 3 credits in Analytics and 3 credits in Big Data.9 Analytics: GEOG 461WDynamic Cartographic Representation GEOG 464Advanced Spatial Analysis GEOG 465Advanced Geographic Information Systems Modeling GEOG 485GIS Programming and Software Development Big Data: GEOG 462Advanced Observation of Earth and Its Environment GEOG 463Geospatial Information Management GEOG 481Topographic Mapping with Lidar Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "German studies certificate": {
        "program_description": "Program Description\n\n\nThe German Studies certificate offered at Penn State Behrend is designed for students who wish to specialize in interdisciplinary German Studies by acquiring advanced German language skills and taking courses in culture, film, history, literature, music, or politics of the German-speaking countries. In-depth knowledge of the German-speaking countries prepares students for a global workforce and careers in international business, engineering, finance, politics, or the sciences.\n\n\nWhat is German Studies?\n\n\nGerman Studies is an interdisciplinary academic sub-field of the Humanities concerned with the languages, literatures, arts, and politics of German-speaking communities in Europe and across the world (e.g., Pennsylvania Germans). In pursuing each of these areas German Studies intersects with the related fields of linguistics, literary studies, visual studies, and history, respectively.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou’re interested in German language, culture, and history.\n\n\nYou envision working in a German-speaking country or for a German company within the United States.\n\n\nYou wish to study abroad.\n\n\nYou plan to apply for fellowships or internships in Germany or Austria.\n\n\nYou are an engineering student who wants to take advantage of Behrend’s relationship with Rosenheim University of Applied Sciences in Rosenheim, Germany.\n\n\nYou recognize that speaking a second (or third!) language doubles (or triples!) your career options.",
        "entrance_to_major": "Entrance to Certificate\n\n\nStudents who have not reached the third level of German Language proficiency may need to take \nGER 1\n and \nGER 2\n first.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Language Courses Required Language Courses: Require a grade of C or better GER 3Intermediate German4 GER 201Conversation and Composition3-4 or GER 301 Intermediate Speaking and Listening Additional Courses Additional Courses: Require a grade of C or better Select nine credit hours from a program approved list:9 GER 100German Culture and Civilization GER 189NGerman Film GER 190Twentieth-Century German Literature in English Translation GER 200NContemporary German Culture HIST 121History of the Holocaust 1933-1945 HIST 143NHistory of Fascism and Nazism HIST 144The World at War: 1939-1945 HIST 427Germany Since 1860 MUSIC 5An Introduction to Western Music PLSC 200NGovernment and Politics of Europe"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Global awareness certificate": {
        "program_description": "Program Description\n\n\nThe certificate gives students an appreciation of the world in which they will live and work. By introducing students first to the broad contours of the globalizing world and then adding more narrowly focused courses, the certificate will give students a sense of the diversity and complexity of the modern world.\n\n\nWhat is Global Awareness?\n\n\nNo one can become an expert on the nearly 200 countries in the world. However, it is possible— essential, really— to gain an appreciation of the huge diversity and sweep of countries, cultures, and languages on our tiny planet. While you can’t learn it all, you can gain an understanding of how the U.S. fits into the jigsaw puzzle that is the modern world.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are curious about other countries and other cultures.\n\n\nYou envision working outside the United States.\n\n\nYou’d like to add liberal arts balance to a business or technical major.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better HIST 11World History since 1500 3 PLSC 14International Relations 3 or PLSC 3 Comparing Politics around the Globe"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Global environmental systems certificate": {
        "program_description": "Program Description\n\n\nGlobal environmental systems students characterize and analyze Earth's physical environment across time and space through the study of physical geography. This 12-credit certificate helps to prepare students for a variety of careers in resource management, ecological restoration, and climate change mitigation where an understanding of geographic patterns and physical processes associated with water, landforms, soils, vegetation, and climate are critical for the survival of life on planet Earth. Learning Objectives: Identify, describe, and analyze the processes that lead to spatial variation on Earth's surface, and the current and historical, physical and biotic processes that shape specific landscapes.\n\n\nWhat is Global Environmental Systems?\n\n\nPhysical geographers seek to understand Earth’s environmental systems and processes and their interactions with human activities across spatial and temporal scales. Geographers in this concentration conduct field and laboratory work and use geospatial technologies to explore and model environmental phenomena such as vegetation and wildlife, wetlands ecology and management, landscape dynamics, climate systems, and global environmental change. Some topics of study include the burning of fossil fuels and emissions of greenhouse gasses and particulates into the atmosphere, natural gas fracking and earthquakes, river diversion and dam construction, groundwater withdrawal and land subsidence, urbanization and the “heat island” effect, land clearance and deforestation, irrigated agriculture, wildland fire, the introduction of invasive species, and coastal overdevelopment.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in the integrated ways in which Earth's near-surface atmosphere, hydrosphere, lithosphere, and biosphere interact.\n\n\nYou would like to address real-world issues of how human activities impact and are impacted by the physical landscape at many scales, from local to international.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 210Geographic Perspectives on Environmental Systems Science 3 Select 9 credits from:9 GEOG 310Introduction to Global Climatic Systems GEOG 310WIntroduction to Global Climatic Systems GEOG 314Biogeography and Global Ecology GEOG 315Landforms and Geomorphic Systems in the Anthropocene GEOG 410 GEOG 411Forest Geography GEOG 411WForest Geography GEOG 412WClimatic Change and Variability GEOG 414Principles and Applications in Landscape Ecology GEOG 417Satellite Climatology GEOG 431Geography of Water Resources GEOG 438WHuman Dimensions of Global Warming Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Health care administration certificate": {
        "program_description": "Program Description\n\n\nThe certificate in Health Care Administration helps prepare students for management positions in the field of health care. Health Care Administration students will develop the skills and knowledge needed to understand the challenges of providing access to quality health care at reasonable cost. The five course certificate will provide a students with opportunities to examine the social, political, historic, and scientific factors in the development and organization of health services; the basic concepts and issues related to health insurance and payment for health care providers; how data are presented and used for decision-making in health care administration; how to use financial and economic information to make decisions in health care organizations; and the management systems designed for efficient and effective health care operations.\n \nThis certificate also offers short term stackable credentials that align with health industry entry level position needs. Students can “stack” the HPA administration micro-credentials over time toward the completion of the certificate or use them as a stand-alone credential. Each micro-credential cluster combines three core HPA courses and mastery of these courses will be demonstrated through a comprehensive exam.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses HPA 101Introduction to Health Services Organization3 HPA 200An Introduction to Data in the Health Care System3 HPA 210Health Care Payment3 HPA 211Financial Decisions in Health Care Organizations3 HPA 332Health Systems Management3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Health policy certificate": {
        "program_description": "Program Description\n\n\nThe certificate in Health Care Policy helps prepare students for policy positions in the field of health care. Health Care Policy certificate students will develop the skills and knowledge needed to understand the challenges of providing access to quality health care at reasonable cost. The five course certificate will provide a students with opportunities to examine the social, political, historic, and scientific factors in the development and organization of health services; frameworks for health policy analysis; policy decisions related to social and private health insurance; how data are presented and used for decision-making in health care administration; how to use financial and economic information to make decisions in health care organizations; and fundamental theories, concepts, issues, and strategies related to a population health.\n \nThis certificate also offers short term stackable credentials that align with health industry entry level position needs. Students can \"stack\" the HPA administration micro-credentials over time toward the completion of the certificate or use them as a stand-alone credential. Each micro-credential cluster combines three core HPA courses and mastery of these courses will be demonstrated through a comprehensive exam.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses HPA 101Introduction to Health Services Organization3 HPA 200An Introduction to Data in the Health Care System3 HPA 210Health Care Payment3 HPA 301Health Services Policy Issues3 HPA 311Population Health and Healthcare3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Healthcare informatics certificate": {
        "program_description": "Program Description\n\n\nThe healthcare industry is moving towards the widespread use of digital records and electronic information transfer. This is resulting in a need for healthcare professionals to be knowledgeable in information technology and for information technology professionals at healthcare facilities to be more knowledgeable of the healthcare industry. Professionals in these two areas both need to understand the complexities of medical information being digitally stored and transferred. This 18 credit certificate program provides students with insight into both professional areas. Students may receive credit for previous coursework (up to 3 courses) upon academic review.\n\n\nWhat is Healthcare Informatics?\n\n\nHealthcare informatics enables healthcare professionals to be knowledgeable in information technology and for information technology professionals at healthcare facilities to be more knowledgeable of the healthcare industry.\n\n\nYou Might Like This Program If...\n\n\nYou have aspirations to work in a healthcare setting You like to learn new technologies.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses HPA 101Introduction to Health Services Organization3 HPA 332Health Systems Management3 HPA 470Health Care Information Management3 IST 110Information, People and Technology 3 IST 210Organization of Data3 IST 220Networking and Telecommunications3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Holocaust genocide studies certificate": {
        "program_description": "Program Description\n\n\nThe goal of the Holocaust and Genocide Studies certificate program is to provide students a wide-ranging and interdisciplinary foundation in the study of the Holocaust and related fields of genocide, anti-Semitism and prejudice, and historical trauma. The curriculum covers history, cultural studies, philosophy, literary and film criticism, ethics, and political science approaches. Candidates are required to take 12 credits from an approved list of courses.\n\n\nWhat is Holocaust and Genocide Studies?\n\n\nThe purpose of the Holocaust and Genocide Studies Certificate is to understand and interpret mass eliminationist violence in human history. This area of study employs varying disciplines- such as literature, film, history, philosophy and ethics, and political science- to educate students on genocide, antisemitism and prejudice, and historical trauma.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to study the causes and effects of different cases of genocide throughout history.\n\n\nYou are interested in complementing your degree in History, Jewish Studies, or other similar fields with a specialization in a significant area of study.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Select 12 credits from the following:12 JST/HIST 121History of the Holocaust 1933-1945 JST/CMLIT/ENGL 128 JST/HIST 143 JST/HIST 205 JST/HIST 409YAntisemitisms JST/HIST 426Holocaust JST/HIST 439Women and the Holocaust JST/PLSC 450HGenocide and Tyranny JST/RLST 478Ethics After the Holocaust"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Housing certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to prepare students for a career in the housing industry. Students are required to take a set of complementary courses in the technology of housing, the development process, and the design and the delivery processes for housing. The minimum number of credits required is 12, with no less than six credits at the 400-level.\n\n\nWhat is Housing?\n\n\nThis program is designed to provide undergraduate students with a means of developing some basic knowledge of housing and preparing for a career in the housing industry. Housing, from low-rise detached houses to multi-unit, multi-story apartment buildings, from motels to high-rise hotels, from student residences to rural housing, is a major and vital component of the built environment. New single-family housing represents at least 4% of the GDP, and housing and its consequences account for about 12% of the GDP. With a national housing stock in excess of 110,000,000 units, the maintenance, operation, repair - and especially the upgrading, retrofit and remodeling of the existing stock - are a very important component of the national economy. Engineers have many important roles to play in the housing business, especially with the developmental, economic and technical aspects of housing.\n\n\nYou Might Like This Program If...\n\n\nYou are passionate about housing and pursuing a career in the housing industry. Students are typically involved with the National Association of Home Builders (NAHB) Student Chapter at Penn State and/or student competition teams like the NAHB Student Competition and U.S. Department of Energy Race to Zero competition. This certificate will also help you to increase your competitiveness for employment in the residential construction industry.",
        "entrance_to_major": "Entrance to Certificate\n\n\nFor entrance into the certificate program, students must be at least 5th semester. The cumulative GPA considered for admission will be consistent with, or equivalent to, the GPA minimum of 2.00 for maintaining good academic standing. Students must earn a C grade or better in each of the four courses to continue with the certificate.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses AE 470Residential Building Design and Construction3 Additional Courses Students must complete an application and choose an additional three courses of the following: 19 AE 432Design of Masonry Structures AE/CE 542Building Enclosure Science and Design BE 462Design of Wood Structures CE 410W RM 303Real Estate Fundamentals"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Human capital management certificate": {
        "program_description": "Program Description\n\n\nThe Human Capital Management certificate provides students with key insights into foundational human capital management processes such as total rewards (compensation and benefits), selection and development, and performance management. As future organizational leaders and managers, the understanding of key human resource practices are needed by all majors from Science, Technology, Engineering, Arts, Math to Business.\n\n\nWhat is Human Capital Management?\n\n\nHuman capital management (HCM) is an organization's set of practices used to attract, recruit, train, develop and retain the best employees to achieve short- and long-term objectives. HCM allows companies to invest in their employees who can maximize their potential by contributing at the highest level to the achievement of business goals. HCM sees employees as the essence of the company.\n\n\nHCM focuses on adding value to an organization's human capital to deliver the best results for all stakeholders. It covers talent acquisition and management, employee relations, compensation, performance, and other key areas vital to the tactical and strategic vision and mission of a company.\n\n\nHCM can create a strong organizational culture that promotes employee development, honest feedback and commitment to company goals. It can give employees more control over their careers and encourage them to dedicate their skills and talent to the employer for the long term.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a people person who is a problem solver.\n\n\nYou have good communication skills.\n\n\nYou have strong analytical skills.\n\n\nYou like dynamic work environments.\n\n\nYou want to help others.\n\n\nYou want to have a rewarding career – financially and emotionally – that makes a big impact on the lives of others.\n\n\nYou are a good listener.\n\n\nPeople trust you.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses MGMT 341Human Resource Management3 MGMT 440Compensation and Benefits3 MGMT 441Organizational Staffing and Development3 MGMT 443Performance Management3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Human factors certificate": {
        "program_description": "Program Description\n\n\nThis 15 credit interdisciplinary certificate program is designed to prepare students with in-depth knowledge of the capabilities and limitations of people and the application of psychological concepts to the design and safety of products and services; including consumer goods, military products, interactive websites and games, and assistive technologies. This certificate requires that students take introductory psychology as well as the two human factors courses (9 credits). Students will also need to take one additional psychology course (3 credits), and one course (3 credits) outside of their major of study in order to foster the interdisciplinary nature of this certificate.\n\n\nWhat are Human Factors?\n\n\nCan we make car crashes less likely by redesigning the dashboard or changing the pedal location? That’s a typical question in human factors psychology. By using knowledge of humans’ physical and cognitive abilities and limitations, human factors psychologists work to improve organizations, jobs, machines, tools, and consumer products for safe, efficient, and comfortable human use. Human factors draws on many academic disciplines, including psychology, engineering, biomechanics, computer science, and industrial design.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou think about the ways that everyday objects could be improved.\n\n\nYou are interested in people, technology, and machines.\n\n\nYou like watching people.\n\n\nYou enjoy the challenge of learning new technologies.\n\n\nYou want to make the workplace safer.\n\n\nYou are majoring in psychology or an engineering discipline.",
        "entrance_to_major": "Entrance to Certificate\n\n\nCompletion of prerequisites for the required courses",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses PSYCH 100Introductory Psychology 3 PSYCH 244Introduction to the Psychology of Human Factors Engineering 3 PSYCH 444Engineering Psychology3 Additional Courses PSYCH 253Introduction to Psychology of Perception 3 or PSYCH 256 Introduction to Cognitive Psychology Select one of the following: 13 EDSGN 100Cornerstone Engineering Design PSYCH 221Introduction to Social Psychology SOC 5Social Problems STS 200Critical Issues in Science, Technology, and Society STS/PHIL 233Ethics and the Design of Technology"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Information sciences technology certificate": {
        "program_description": "You Might Like This Program If...\n\n\n\n\nYou want to develop new software and web applications, help businesses operate more effectively by creating and implementing technological solutions, or understand how technology is connected to broader social issues.\n\n\nYou are interested in technology but also want to work with people.\n\n\nYou enjoy coming up with creative solutions to difficult challenges.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better IST 110Information, People and Technology 3 IST 210Organization of Data3 IST 220Networking and Telecommunications3 IST 250Introduction to Web Design and Development3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Information systems auditing certificate": {
        "program_description": "Program Description\n\n\nThe worlds of accounting and digital information systems, particularly in the area of information security, have become intertwined. Penn State Altoona has created a certificate program to help IT and accounting professionals acquire the skills they need for maintaining and auditing digital information systems. This Information Systems Auditing Certificate, for students enrolled in accounting, business with an accounting option, information sciences and technology, security risk analysis or other related majors integrates critical areas of knowledge of IT and accounting.\n \nStudents who complete the certificate program will develop skills useful in obtaining other professional credentials, such as the Certified Information Systems Auditor (CISA) or Certified Information Technology Professional (CITP) credentials.\n\n\nWhat is Information Systems Auditing Certificate?\n\n\nA certificate program that integrates critical areas of knowledge of Information Technology (IT) and accounting principles.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to acquire the skills necessary for maintaining and auditing digital information systems.\n\n\nYou want to develop skills useful in obtaining other professional credentials, such as the Certified Information Systems Auditor (CISA) or Certified Information Technology Professional (CITP) credentials.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ACCTG 211Financial and Managerial Accounting for Decision Making4 ACCTG 403Auditing3 or ACCTG 403W Auditing ACCTG 432Accounting Information Systems3 ACCTG 471Intermediate Financial Accounting I3 ACCTG 472Intermediate Financial Accounting II3 ACCTG 483Forensic Accounting3 CMPSC 101Introduction to Programming 3 IST 220Networking and Telecommunications3 IST 454Computer and Cyber Forensics3 IST 456Information Security Management3 SRA 111Introduction to Security and Risk Analysis 3 SRA 221Overview of Information Security3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Information systems security certificate": {
        "program_description": "Program Description\n\n\nBy earning this 17 credit certificate in Information Systems Security, the learner will gain knowledge to identify and resolve potential security problems before they become serious and costly. The successful student will be proficient in computer networking and security for both wired and wireless systems, installation and configuration of firewalls and intrusion detection and prevention, risk analysis and management, security management using policies and access control, fault tolerance, disaster recovery planning, computer forensics and investigations, cryptography, and physical security.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses IST 210Organization of Data3 IST 220Networking and Telecommunications3 IST 250Introduction to Web Design and Development3 IST 402Emerging Issues and Technologies3 IST 451Network Security3 Select one of the following:3-4 IST 110Information, People and Technology CMPSC 203Introduction to Spreadsheets and Databases CMPSC 101Introduction to Programming MIS 204Introduction to Management Information Systems"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Instructor development professionals certificate": {
        "program_description": "Program Description\n\n\nInstructor Development for Professionals This certificate is designed for the adult learner who would like to gain knowledge of essential instructor development concepts. These adult learners may already possess a degree in an occupational discipline, but need to augment their knowledge and resumes to advance their careers with their current employer or transition into a new job. Adult learners taking this certificate may also be taking post-secondary credit courses for the first time.",
        "entrance_to_major": "Entrance to Certificate\n\n\nAdmissions criteria for the certificate program follow standard University procedures for adult students.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses WFED 105Integrated Curriculum Implementation3 WFED 106Program and Facilities Management3 WFED 207WAssessment Techniques3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "International engineering certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to provide recognition for students who have gained a proficiency in the skills needed by engineers in a global economy. The requirements of the certificate fall into three categories:\n \n \nknowledge of global engineering and its professional and societal context,\n \nknowledge of language and culture, and\n \nparticipation in international experiences.\n \n \nAll engineering students in good academic standing are eligible for admission to the program.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to bring a truly global perspective to your engineering education.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses 3 credits of study in a second language, while a PSU student, at the 3 (third-semester) level or higher3 6 credits (typically two courses) of study in courses approved to meet the International Cultures requirement (IL) of General Education6 1-3 credits and/or at least six weeks of approved study or workabroad, consisting of course work, internship, research, etc.1-3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "International science certificate": {
        "program_description": "Program Description\n\n\nThis certificate is intended to recognize students who spend significant time abroad during their undergraduate careers and who complete courses that allow them to acquire a more global perspective on the study of science. The certificate is intended to provide recognition for students who have developed a familiarity with science outside of the United States and who have experience with the regional cultural context of the host nation(s). Consultation with an academic adviser prior to studying abroad is strongly recommended to ensure course choices fulfill the requirements of the certificate.\n \nStudents who have completed the program requirements must submit an application to have the certificate added to their transcript here: \nhttp://science.psu.edu/cie/education-abroad/international-science-certificate.\n\n\nWhat is International Science?\n\n\nScience students interested in learning more about science in other cultures, how science is done in countries outside the US, or how science is applied to problems around the world, can participate in this program combining coursework on campus with experiences abroad.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are passionate about learning about other cultures.\n\n\nYou want to learn more about the global science community.\n\n\nYou plan to study abroad while at Penn State.\n\n\nYou are interested in exploring, learning, and discovering science in multiple cultural contexts.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Requirements Requirements: Require a grade of C or better A total of at least 6 weeks abroad on one or more Penn State-approved courses/programs 6 credits (typically two courses) abroad that are either Penn State Science courses taught abroad or courses that are granted equivalency in the College of Science at Penn State6"
        },
        "electives": "",
        "supporting_courses": ""
    },
    "International studies certificate": {
        "program_description": "Program Description\n\n\nToday's students, whatever their career path, will enter a workforce that's increasingly diverse. We need to prepare our students to respect non-American cultures and people so they gain an international outlook. The Certificate in IS is intended to provide students with a broad and deep understanding of this diverse world far beyond the General Education requirements. Students will be better suited to face the challenges and enjoy the opportunities presented by others, both in and outside the United States, who come from a variety of nations and cultures.\n\n\nWhat is International Studies?\n\n\nInternational Studies is a broad field that engages with various issues related to global history, culture, politics, and arts. It is an interdisciplinary field that allows students to look at specific academic fields from a multinational perspective.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in learning more about a variety of cultures, increasing your cultural literacy, applying your global competencies to your career plans, academic major, or current workplace experiences.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses Select 3 credts from the following:3 GLIS 101NGlobalization GLIS 102NGlobal Pathways HIST 11World History since 1500 INTST 100Introduction to International Studies Select 6 credits from the following list:6 AA 100Introduction to International Arts ANTH 8Aztec, Inca, Maya ANTH 45NCultural Diversity: A Global Perspective APLNG 220NMultilingual Lives: Stories of Language and Culture Learning ARTH 100Introduction to Art BBH 305Introduction to Global Health Issues BIOL 120N CMLIT 108Myths and Mythologies CMLIT 184The Short Story ENGL 194Women Writers GEOG 30NEnvironment and Society in a Changing World HIST 1Western Civilization I HIST 2Western Civilization II HIST 10World History to 1500 HIST 117Women in United States History HIST 121History of the Holocaust 1933-1945 HIST 144The World at War: 1939-1945 HIST 173Vietnam in War and Peace IB 303International Business Operations LING 1Language, Life and Society MUSIC 9Introduction to World Musics PLSC 3Comparing Politics around the Globe PLSC 14International Relations PSYCH 232Cross-Cultural Psychology RLST 1Introduction to World Religions RLST 4Jewish and Christian Foundations RLST 101Comparative Religion SPAN 131Ibero-American Civilization SPAN 131YIbero-American Civilization Select 3 credits of 400-level courses from the following list:3 BBH 407Global Health Equity HIST 452History of U.S. Foreign Relations HIST 488American Diplomacy Since 1914 GLIS 497Special Topics MGMT 461International Management MKTG 445Global Marketing NURS 401Concepts of Health NURS 464Dying and Death THEA 401Theatre History I: Ancient to 1700"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Introduction business management certificate": {
        "program_description": "Program Description\n\n\nThe introduction to business management certificate provides a strong foundation in core business areas (management, accounting, communications and technology).\n\n\nWhat is Introduction to Business Management?\n\n\nBusiness Management includes the performance or management of business operations and decision making, as well as the efficient organization of people and other resources.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou desire to add business skills to your major program of study.\n\n\nYou are looking for a well-rounded introduction to basic business concepts.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better ACCTG 211Financial and Managerial Accounting for Decision Making3-4 or FIN 100 Introduction to Finance CAS 100Effective Speech3 ENGL 15Rhetoric and Composition 3 MGMT 100Survey of Management3 MIS 103Microcomputer Applications in Business3 or MIS 204 Introduction to Management Information Systems"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Introduction corporate communication certificate": {
        "program_description": "Program Description\n\n\nThe Introduction to Corporate Communication certificate program is designed for those considering a degree in the field. It is also applicable for those currently employed in the field without a formal credential. The certificate includes courses intended to develop understanding of the oral and written communication strategies that result in effective communication in a professional environment.\n\n\nWhat is Introduction to Corporate Communication?\n\n\nCorporate Communication encompasses all aspects of strategic communication in for-profit and not-for-profit organizations, from internal communication between senior leaders and front line professionals to communication with external clients. Corporate communicators are highly skilled professionals in the art of planning, problem solving, and persuading with a sharp understanding of their audience’s needs, tastes, and interests.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are creative.\n\n\nYou want to enhance your degree program but building strong skills in writing and speaking.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses CAS 100Effective Speech3 or CAS 100A Effective Speech or CAS 100B Effective Speech or CAS 100C Effective Speech CAS 352Organizational Communication 3 COMM 1003 ENGL 15Rhetoric and Composition 3 MIS 204Introduction to Management Information Systems 3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Justice ethics diversity space certificate": {
        "program_description": "Program Description\n\n\nThe 12-credit Justice, Ethics, Diversity in Space (JEDIS) certificate helps students to cultivate a diverse set of theoretical and methodological skills that geographers use to engage in a diverse and changing planet. Increasingly as students enter the workforce they will be challenged to not only interact with diverse populations, but will also have to understand the way diverse populations are impacted by a range of economic, political, and environmental challenges. They will also need to be exposed to ethical frameworks that can be productively leveraged within non-academic environments. Students who undertake a JEDIS certificate will take courses across the broad spectrum of human geography and will cultivate the intellectual capacity to address issues of inequality and diversity from an ethically informed perspective.\n \nLearning objectives: recognize and respect diverse experiences and perspectives; apply ethical frameworks to challenging economic, political, and environmental challenges; and think critically about the multiple implications of human choices and practices.\n\n\nWhat is Justice, Ethics, Diversity in Space?\n\n\nThe discipline of geography draws from a range of perspectives including traditions in the natural and social sciences as well as humanities. Questions of justice, (in)equality, and diversity across space are core to what human and environment-society geographers study. The Justice, Ethics and Diversity In Space certificate specifically addresses how geographers approach questions concerning uneven power relations, inequalities, justice, social responsibility, and ethics across space and in place; it is more focused than the complementary Human Geography and Environment-Society Geography certificates. Students will learn about different ethical frameworks that can be productively leveraged in the workplace. As a result, students will be prepared to manage and work in diverse settings and to think critically about their position in society.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou care about issues of diversity, ethics, and social justice and wish to understand how geographers explore these challenges in local to global contexts.\n\n\nYou want to learn about diverse cultures, environmental racism, immigration, and assimilation experiences of marginalized groups.\n\n\nYou would like to become knowledgeable of people’s biases based on race, ethnicity, culture, religion, age, sex, sexual orientation, social and economic status, political ideology, and disability, and how these contribute to discrimination and oppression.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses Select 3 credits from:3 GEOG 220Perspectives on Human Geography GEOG 230Geographic Perspectives on Environment, Society and Sustainability Select 9 credits from:9 GEOG 324Place, Space and Culture GEOG 328War, Peace, and Diplomacy: Understanding Contemporary Geopolitics GEOG 425Geography of Race, Class, and Poverty in America GEOG 426Y GEOG 428WPolitical Geography GEOG 433Geographies of Justice Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Keystone certificate integrative humanities certificate": {
        "program_description": "Program Description\n\n\nThe Keystone Certificate for Integrative Humanities includes two foundational courses and two additional courses in a student’s area of interest. Students will take two foundational courses (\nHUM 101\n and \nHUM 102\n) where they will engage with transformative texts from the humanities and gain a foundation for understanding how their college and professional careers will benefit from the core skills and knowledge taught in the humanities. Students will take an additional two courses in one certificate pathway. Pathways and connected courses will be designated by each participating campus.\n \nAt the heart of many current problems and their solutions are the core skills and knowledge students learn in the humanities, from critical and analytic engagements with human values, worldviews, and culture, to abilities of self-expression. A grounding in the humanities provided in this certificate will help students understand how issues of intersectionality, history, interculturalism, global perspectives, democratic and ethical decision making, and many other areas fundamental to a humanities education will make them better citizens at work and in their local, national, and global communities, regardless of college major.\n \nThe certificate prepares students for the high-tech global economy that demands agile and flexible thinkers and actors who will amplify the specialized knowledge of their majors with a deeper, broader, and more complex understanding of how their disciplinary majors and future careers impact, or are impacted by, humanity.\n\n\nWhat is the Keystone Certificate for Integrative Humanities?\n\n\nThe Keystone Certificate is a 12-credit certificate program focused on core skills and knowledge in the humanities (for example: critical and analytical thinking; interpersonal and cultural competencies; and effective oral and written communication). Students take two gateway courses (\nHUM 101\n and \nHUM 102\n) and two elective courses from a specified pathway to complete the certificate. The program is designed so that most students will able to earn the certificate without having to take additional courses outside of their general education requirements.\n\n\nYou Might Like This Program If...\n\n\nYou are looking for a certificate in the core skills and knowledge that are highly sought after by employers and in advanced degree programs. It is especially useful for students in non-humanities majors in STEM and Business. In a competitive job market, setting yourself apart from other graduates is important. The certificate gives students an edge over other graduates because they will be able to talk about the intersections between their career and humanity, especially how what they produce impacts humanity and how the tendencies of humans should impact decisions related to innovation and creativity. In addition, they can talk about going into depth theoretically and having more practice that others in the core skills and knowledge most in-demand by employers (e.g., oral and written communication, collaborative skills, technological literacy, having a global perspective, ethics, leadership, problem-solving, critical thinking, and an understanding of the importance diversity, equity, inclusion, and belonging philosophically as well as to the \"bottom line\").\n\n\nIf you start the certificate early enough, you can easily complete it as part of your general education requirements.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better HUM 101Transformative Texts Part 1: Foundational Knowledge 3 HUM 102Transformative Texts Part 2: Contemporary Issues & Practical Perspectives 3 Additional Courses Additional Courses: Require a grade of C or better Select 6 credits from the following:6 AFAM 100NBlack Freedom Struggles AFAM/WMNST 101NAfrican American Women AFAM 102Women of the African Diaspora AFAM/SOC/WMNST 103Racism and Sexism AFAM 105NAfro-Latin America: Race and Revolution AFAM 110NIntroduction to African American Studies AFAM 114NRace, Gender and Sport AFAM 116Muslims in America AFAM/INART 126NThe Popular Arts in America: The History of Hip-Hop AFAM/ENGL 139African American Literature AFAM/RLST 147The Life and Thought of Malcolm X AFAM/HIST 152African American History AFAM/MUSIC 207NJazz and the African American Experience AFAM/HIST 210Freedom's First Generation: African American Life and Work, from the Civil War to World War II AFAM/HIST 211Slavery and Freedom in the Black Atlantic AFAM/HIST/WMNST 213YAfrican American Women's History AFAM 226NCritical Approaches to Hip-Hop AFAM/HIST 250Introduction to the Caribbean AFR 150Africa in Cinema AFR/WMNST 202NWomen, Gender, and Feminisms in Africa AMST/HIST 3The American Nation: Historical Perspectives AMST 100Introduction to American Studies AMST 103American Masculinities AMST/WMNST 104Women and the American Experience AMST 106N/COMM 100NThe Mass Media and Society AMST/RLST 140YReligion in American Life and Thought AMST/HIST 150America in the 1960s: An Introduction AMST/HIST/STS 151NTechnology and Society in American History AMST 160N/AAS 100NIntroduction to Asian American Studies AMST 161NChinese in America, Americans in China AMST 226NCritical Approaches to Hip-Hop ANTH 2NWorld Archaeology ANTH 45NCultural Diversity: A Global Perspective ANTH/HIST/PLANT 129NChocolate Worlds ANTH 220Anthropology and Art/ifacts APLNG 200Introduction to Language, Culture, and Social Interaction APLNG 210Global English APLNG 220NMultilingual Lives: Stories of Language and Culture Learning APLNG/AFR 230NLanguage and Social Justice ART 10Introduction to Visual Studies ART 175NIntersections Between Art and Psychology ART/WMNST 207NLGBTQ+ Identity, Culture and The Arts ARTH 1SFirst-Year Seminar in Art History ARTH 100Introduction to Art ARTH 101NIntroduction to Global Art History ARTH 105NPictures and Power ARTH 111Ancient to Medieval Art ARTH 111UAncient to Medieval Art ARTH 112Renaissance to Modern Art ARTH 112URenaissance to Modern Art ARTH 120Asian Art and Architecture ARTH 125Islamic Architecture and Art ARTH 202NRenaissance to Modern Architecture ARTH 222NIntersections between Art History and the History of Psychology ARTH 224NAuthors and Artists ARTH 225NSexuality and Modern Visual Culture ARTH 226The Comic Book: A History of Sequential Art ARTH 292NWitches and Witchcraft from the Middle Ages to the Present ARTH 307NAmerican Art and Society ARTH 325Impressionism to Surrealism ARTH 326Art Since 1940 ASIA/RLST 3Introduction to the Religions of the East ASIA 100What is Asia? ASIA 101NSports in Asia ASIA 102Asian Popular Culture ASIA/RLST 103Introduction to Hinduism ASIA/RLST 104Introduction to Buddhism ASIA 106NAsian Traditions of Health, Medicine, and the Body ASIA/JAPNS 122Gods to Godzilla: A Survey of Japanese Culture ASIA/HIST 182Asian Trade: Economy, Industrialization and Capitalism in Asia BBH/CRIMJ 150NSafe and Sound: The Intersection of Criminal Justice and Public Health BIOET 100/PHIL 132Bioethics BIOET 110NHealth, Illness, and the Human Condition BIOL 133Genetics and Evolution of the Human Species BIOL 144Climate Change: Biological Impacts BIOL/PSYCH 169NWhat it means to be human CAMS/JST/RLST 12NLands of the Bible CAMS 25Greek Civilization CAMS/RLST 44Myth in Egypt and the Near East CAMS/HIST 100Ancient Greece CAMS 101The Roman Republic and Empire CAMS 105History of the Ancient Near East CAMS 109YWriting Systems of the World CAMS/JST/RLST 110Hebrew Bible: Old Testament CAMS/JST/RLST 111Early Judaism CAMS/JST/RLST 120New Testament CAMS/JST/RLST 123History of God: Origins of Monotheism CAMS/JST/RLST 124Early and Medieval Christianity CAMS 130The Ancient World in Film CAMS/JST/RLST 153Dead Sea Scrolls CAMS/HIST 180Ancient Warfare CAS 101NIntroduction to Human Communication CAS/ENGL/SOC 162NCommunicating Care CAS/IST 170NWhat is Information? CAS 175NPersuasion and Propaganda CAS 208NIntroduction to Managing Conflict and Bargaining CAS 210Landmark Speeches on Democracy and Dissent CAS 222N/AYFCE 211N/CIVCM 211NFoundations: Civic and Community Engagement CAS 232NIdentity, Citizenship, and the Rhetoric of American Horror Film CAS 253Health Communication CAS 255Communicating Gender CAS 271NIntercultural Communication CAS 272NPolitical Communication and Technology CAS 311Methods of Rhetorical Criticism CAS 352Organizational Communication CAS 404Conflict Resolution and Negotiation CAS 452WOrganizational Communication Theory and Research CAS 453Health Communication Theory and Research CMLIT 3Introduction to African Literatures CMLIT/ASIA 4Introduction to Asian Literatures CMLIT 5Introduction to Literatures of the Americas CMLIT 7Introduction to Middle Eastern Literatures CMLIT 10World Literatures CMLIT 11The Hero in World Literature CMLIT 13Virtual Worlds: Antiquity to the Present CMLIT/ASTRO 19NBeing in the Universe CMLIT 100Reading Across Cultures CMLIT 101Race, Gender, and Identity in World Literature CMLIT 106The Arthurian Legend CMLIT 107Exploration, Travel, Migration, and Exile CMLIT 108Myths and Mythologies CMLIT 109Native American Myths, Legends, and Literatures CMLIT 110Jewish Literature: An International Perspective CMLIT 111Introduction to Literatures of India CMLIT 112NIntroduction to Global Drama, Theatre, and Performance CMLIT 122Global Science Fictions CMLIT/ENGL/GER/JST 128NThe Holocaust in Film and Literature CMLIT 130Banned Books: International and Comparative Perspectives CMLIT 133NGlobal Satire and Modern Politics CMLIT 142The Psychology of World Literature CMLIT 143Human Rights and World Literature CMLIT 153International Cultures: Film and Literature CMLIT/SC 183QFrom Beast Books to Resurrecting Dinosaurs CMLIT 191N/GAME 160NIntroduction to Video Game Culture CMLIT 490/GAME 460Video Game Lit Studies COMM 20NCritical Media Literacy COMM 110Media and Democracy COMM 118Introduction to Media Effects COMM 150NThe Art of the Cinema COMM 168American Journalism: Values, Traditions, and Practices COMM/PSYCH 175NMental Illness and the Movies COMM 190/GAME 140Gaming and Interactive Media COMM/WMNST 205Gender, Diversity and the Media COMM 208NVisual Representations of the Middle East in the US and Middle East COMM 222NSocial Justice and the Image COMM/IST 234NDigital Cultures COMM 242Basic Video/Filmmaking COMM 250Film History and Theory COMM 270Introduction to Multimedia Production COMM/SOC 290NCinema and Globalization COMM 292Introduction to Media & Politics CRIM 225NOrganized Crime in Film and Society CRIMJ/HIST 159History of the FBI CRIMJ/EDUC/SOC 205NCritical Race Theory in the Humanities and Social Sciences DART 102NIntroduction to 2d Digital Art and Technology DIGIT 100Introduction to Digital Humanities EARTH 103NEarth in the Future: Predicting Climate Change and Its Impacts Over the Next Century EARTH 104NClimate, Energy and Our Future EARTH 107NCoastal Processes, Hazards and Society EARTH 111NWater: Science and Society EARTH 155NScientific Controversies and Public Debate EMSC 240NEnergy and Sustainability in Contemporary Culture ENGL 2The Great Traditions in English Literature ENGL 88Australian/New Zealand Cultural Perspectives ENGL/JST 104The Bible as Literature ENGL/AMST 105American Popular Culture and Folklife ENGL 114Modern Pagan Traditions and Texts ENGL/ARTH 115NArts of Love ENGL 120Difference in Early Literature ENGL 125On the Farm: Agriculture and Literature ENGL 129Shakespeare ENGL 130Reading Popular Texts ENGL/AMST 135Alternative Voices in American Literature ENGL 140Contemporary Literature ENGL/SC 142NScience in Literature ENGL 144Everyday Rhetoric ENGL 161N/HIST 162NThe Pursuit of Happiness in American Life: Historical Literature and Modern Practice ENGL 165NWork and Literature ENGL 179Exploring the Literature of Food: Current Trends in American Food Writing and Environmentalism ENGL 180Literature and the Natural World ENGL 182Literature and Empire ENGL 182CLiterature and Empire ENGL/PLSC 183NThe Cold War in Literature, Politics, and History ENGL 184The Short Story ENGL/CMLIT 185World Novel ENGL 191Science Fiction ENGL/WMNST 194Women Writers ENGL 206Business and Literature ENGL 208N/MUSIC 209NThe Music of the Beatles and American Popular Culture ENGL 211Introduction to Writing Studies ENGL 215Introduction to General Nonfiction Writing ENGL/ARTH/WMNST 225NSexuality and Modern Visual Culture ENGL/LTNST 226Latina and Latino Border Theories ENGL/WMNST 227Introduction to Queer Theory ENGL 228Introduction to Disability Studies in the Humanities ENGL 229Digital Studies ENGL/CHEM 233NChemistry and Literature ENGL 236NInequality: Economics, Philosophy, Literature ENGL/WMNST 245Introduction to LGBTQ Studies ENGR/GER 115NScience, Humanity and Catastrophe: Scientific Discovery in Germany ENGR 320YDesign for Global Society ENT 216NPlagues Through the Ages ENVST 100NVisions of Nature FDSC/PHIL 134Food, Values, and Health FR 137Paris: Anatomy of a Global City FR 138NFrench Culture Through Film FR 139France and the French-speaking World GAME 180NThe Art and Science of Virtual Worlds GEOG 2NApocalyptic Geographies: How can we prevent the end of the world? GEOG 30NEnvironment and Society in a Changing World GEOSC/HIST 212NEarthquakes and Human History GER 100German Culture and Civilization GER 123/HIST 195/JST 195Genocide in Global perspectives: Twentieth Century and beyond GER 143The Culture of Stalinism and Nazism GER 189NGerman Film GER 200NContemporary German Culture GLIS 101NGlobalization GLIS 102NGlobal Pathways HDFS 108NArt and Science of Human Flourishing HIST 1Western Civilization I HIST 2Western Civilization II HIST/CAMS 5Ancient Mediterranean Civilizations HIST 10World History to 1500 HIST 11World History since 1500 HIST 12History of Pennsylvania HIST 20American Civilization to 1877 HIST 21American Civilization Since 1877 HIST 105The Byzantine Empire HIST 106Early Modern Empires of Islam: The Ottomans, Safavids, and Mughals HIST 107Medieval Europe HIST 108Crusades: Holy War in the Middle Ages HIST 109Introduction to U.S. Environmental History HIST 110Introduction to Global Environmental History HIST 111Introduction to U.S. Food History HIST 112Introduction to Public History HIST 113Baseball in Comparative History HIST 114NHistorical Perspectives on HealthCare Innovations HIST/WMNST 116NFamily and Gender Roles in Modern History HIST/WMNST 117Women in United States History HIST 120NHistory of Modern Europe since 1789 HIST/JST 121History of the Holocaust 1933-1945 HIST 122History of Science I HIST 123History of Science II HIST/STS 124History of Western Medicine HIST/LTNST 127Introduction to U.S. Latina/o History HIST 130Introduction to the Civil War Era, 1848 through 1877 HIST 131NSlavery, the Civil War, and Cinema HIST 142NHistory of Communism HIST/JST 143NHistory of Fascism and Nazism HIST 144The World at War: 1939-1945 HIST 153Native American History HIST 155American Business History HIST/ARAB/RLST 165Islamic States, Societies and Cultures c. 600-1500 HIST/ASIA/JAPNS 172Introduction to Japanese Civilization HIST 173Vietnam in War and Peace HIST 178Latin-American History to 1820 HIST 179Latin-American History Since 1820 HIST/JST 181Introduction to the Middle East HIST 184Society and Culture in the Pacific War HIST/ASIA/JST 186The Silk Roads HIST 190The Middle East Today HIST/AFR 191Early African History HIST/AFR 192Modern African History HIST 238NSociety and Culture in Palestine/Israel HIST 252Revolutions in the Middle East HIST/ARTH 292NWitches and Witchcraft from the Middle Ages to the Present HUM 100NFoundations in the Humanities: Understanding the Human Experience HUM 150NWorld Mythologies in the Arts INART 1The Arts INART 3Reception of the Arts INART 5Performing Arts INART 10The Popular Arts in America: Mass Media Arts INART 110The Dramatic Arts in the Mass Media INART 115The Popular Arts in America: Popular Music INART 116The Popular Arts in America: The History of Rock and Roll-The 1950s INART 205Introducing the Beatles INART 226NCritical Approaches to Hip-Hop IST 110Information, People and Technology IST 144NInvasion of Technology from a 21st Century Perspective IT 130Italian Culture and Civilization IT 131Introduction to Italian American Culture IT 225NOrganized Crime in Film and Society JAPNS 120Japanese Literature in Its Cultural Context JAPNS 121NJapanese Film and New Media JST/RLST/CAMS 4Jewish and Christian Foundations JST 60NSociety and Cultures in Modern Israel JST/CAMS/RLST 90Jerusalem: Past, Present, and Future JST/RLST 114Modern Judaism JST/HIST 140The History of the Israel-Palestine Conflict (1917-Present) JST 190The Middle East Today JST/HIST 260The Middle East in Film KINES 341The Historical, Cultural, and Social Dynamics of Sport KOR 120Introduction to Korean Culture KOR 121K-pop and Beyond LA 135NCollege, Work, and Citizenship in the 21st Century LLED 215NChildren's Picture Books as Multimodal Texts LTNST 100Introduction to Latina/o Studies LTNST/PHIL 139Latino/a Philosophy LTNST 315NSpanish and Spanish-speakers in the U.S. METEO/HIST 6NHistory and Weather: How Weather Played an Instrumental Role in Great World Events METEO/PHIL/RLST 133NEthics of Climate Change MUSIC 4Film Music MUSIC 5An Introduction to Western Music MUSIC 7Evolution of Jazz MUSIC 9Introduction to World Musics PHIL 1The Big Questions PHIL 2Individuals in Society PHIL 3Ethical Life PHIL 4The Human Condition PHIL 5Film and Philosophy PHIL 7Asian Philosophy PHIL/WMNST 8Gender Matters PHIL 9Race, Racism, and Diversity PHIL 10Critical Thinking PHIL 11Science and Truth PHIL 13Nature and Environment PHIL 14Love and Sex PHIL 60NPhilosophy and 1960s Counterculture PHIL 103Ethics PHIL 106Business Ethics PHIL 107Philosophy of Technology PHIL 108Social and Political Philosophy PHIL 110Philosophy of Science PHIL 114Feminist Philosophy PHIL 118Environmental Philosophy PHIL 119Ethical Leadership PHIL 123Media Ethics PHIL 131NBS: Identifying Bias and Falsehood PHIL 136NArt and Philosophy in Ancient Greece PHIL 137NIntroduction to Philosophy through Health and Sport PHIL/STS 233Ethics and the Design of Technology PHIL 242NHappiness and Well-Being PLSC 17NIntroduction to Political Theory PLSC/PUBPL 120N/SOC 180NState, Society, and Public Policy PLSC 200NGovernment and Politics of Europe PLSC 210NRights in America PLSC 223NEthnic and Racial Politics PLSC 291Introduction to Peace and Conflict Studies RHS 100Introduction to Disability Culture RLST 1Introduction to World Religions RLST 101Comparative Religion RLST 105NBuddhism and US Society RLST 107Introduction to Islam RLST 116Muslims in America RLST 145African Diaspora Religions and Spiritualities RUS 100Russian Culture and Civilization RUS 101NRussian Cinema RUS 110Russian Folklore RUS/GER 143The Culture of Stalinism and Nazism RUS 144Multicultural Russia: Narratives of Race and Ethnicity in Russian Literature and Culture RUS 145Putin¿s Russia and Its Protest Culture SC 60NArt in the Natural World SC 120NPlants, Places, and People SC/HIST 125NHistory of Infectious Disease and Epidemiology SOC 119NRace, Ethnicity and Culture SPAN/AFAM/AFR 132Afro-Hispanic Civilization SUST 150NThe Science of Sustainable Development THEA 101NPerformance and Society THEA 105Introduction to Theatre THEA 206Critical Theory for Performance THEA 208Workshop: Theatre in Diverse Cultures WMNST 1Introduction to Women's Studies WMNST 102Women of the African Diaspora WMNST 105NLiving in a Diverse World WMNST 106NRepresenting Women and Gender in Literature, Art and Popular Cultures WMNST 137Gender, Sexuality, and Religion WMNST 166History of Sexuality WMNST 230NDangerous Bodies WMNST/HIST 266YSexuality and Violence in Nineteenth-Century America WMNST 301NSexualities, Gender and Power: Feminist Thought and Politics"
        },
        "electives": ") and two elective courses from a specified pathway to complete the certificate. The program is designed so that most students will able to earn the certificate without having to take additional courses outside of their general education requirements.",
        "supporting_courses": ""
    },
    "Labor human resources certificate": {
        "program_description": "Program Description\n\n\nPenn State's online certificate in Labor and Human Resources is designed to provide students with a foundation in human resources and employment relations. It examines the law and best practices within these disciplines and will help students recognize and resolve issues that emerge in the workplace.\n\n\nWhat is Labor and Human Resources?\n\n\nEvery day, 135 million Americans go to work and surprising stuff happens. Welcome to the world of human resources and labor relations! Labor and Human Resources focuses on subjects ranging from globalization and talent management, to unions and social justice, to gender equity and workers' rights. It encompasses a variety of growing career areas, all of which address the complex social, cultural, and professional issues one is likely to encounter in modern workplaces. You will learn in a highly student-centered program with great faculty, wonderful resources, and an in-house career counselor for help as you approach completion.\n\n\nYou Might Like This Program If...\n\n\nYou aspire to work in human resources or a related field, this online certificate in labor studies and employment relations can help you acquire a foundation in a range of subjects, including employment law, collective bargaining, and workplace diversity. It can be used as an important first step in your education or as a recognized stand-alone credential. If you already have a degree, this certificate program is an excellent complement.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses LHR 100Exploring Work and Employment 3 LHR 201Employment Relationship: Law and Policy 3 Select 6 credits of the following:6 LHR 304Labor and Employment Relations Fundamentals LHR 305Human Resources Fundamentals LHR 400Comparative Employment Relations Systems LHR 403International Human Resource Studies"
        },
        "electives": "Elective Courses",
        "supporting_courses": ""
    },
    "Landscape ecology certificate": {
        "program_description": "Program Description\n\n\nLandscape ecologists are in increasing demand in the areas of conservation management, urban planning, and Earth system science. Landscape-level management also increasingly depends on an understanding of coupled natural-human systems, and landscape ecologists need to be trained to understand interdisciplinary linkages between social and ecological sciences, which is a strength in geographic thought. This 12-credit certificate provides training necessary to make inferences about ecological dynamics at landscape scales through training in spatial analysis, environmental modeling, and geographically relevant ecosystem processes. Learning objectives: apply techniques of spatial analysis and environmental modeling to complex socio-ecological landscape systems, draw from social and ecological sciences to address challenges in coupled natural-human systems, and apply these tools for landscape- level management of human-environment processes.\n\n\nWhat is Landscape Ecology?\n\n\nLandscape ecology is a key focus within the physical and environment-society subdisciplines of geography. Geographers focusing on landscape ecology use field studies, models, and laboratory activities to measure, quantify, and forecast how ecosystems change across space and time. They work at scales ranging from microbial to sub-continental. Through such geographic analyses, landscape ecologists seek to understand how natural and human disturbances (such as fire or suburban development) influence landscape sustainability, and they make recommendations for managing the landscape. Landscape-level management increasingly depends on an understanding of coupled natural-human systems, and landscape ecologists need to be trained to understand interdisciplinary linkages between social and ecological sciences. The certificate in Landscape Ecology is more focused than the complementary Physical Geography and Environment-Society certificates, and it incorporates training in geospatial technologies.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are curious about how demand for more commodities and services from global ecosystems has led to an ecological crisis.\n\n\nYou want to study how climate change affects spatial distribution of plant species or the frequency of wildfires.\n\n\nYou want to learn about the role of people on landscape patterns and processes ranging from wilderness to cities.\n\n\nYou want to apply techniques of spatial analysis and environmental modeling to address challenges in complex human-natural systems.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 210Geographic Perspectives on Environmental Systems Science 3 GEOG 314Biogeography and Global Ecology3 GEOG 414Principles and Applications in Landscape Ecology3 Select 3 credits from:3 GEOG 362Remote Sensing and Image Analysis GEOG 365Intermediate GIS Programming GEOG 430Human Use of Environment GEOG 431Geography of Water Resources GEOG 465Advanced Geographic Information Systems Modeling Some \"additional\" course selections have prerequisites not included in the certificate: GEOG 160 or 260 is prerequisite for GEOG 362 and 365; GEOG 363 is prerequisite for GEOG 465. Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Landscapes societies cultures political economies certificate": {
        "program_description": "Program Description\n\n\nIn a rapidly changing world, an understanding of how human landscapes function globally and locally is highly marketable. This 12-credit certificate prepares students to read future socio-economic trends, which will be of interest to many employers. This certificate prepares students for careers in community and economic development, urban design, politics, and travel and tourism through the study of human geography. Global understandings of population growth and international migration; the consequences of economic development; and the impacts of technological innovation are some of the topics covered in the courses that comprise this certificate. Additionally, students gain proficiency in identifying how political power and control of culture can impact human rights, and race and gender equality. Learning Objectives: Describe, analyze, and locate human relations and movements across and through space and place; recognize and discuss the geographical dimensions of varying social, cultural, political, historical, and economic conditions; and identify and analyze human use and/or human change of their environments locally, regionally and globally.\n\n\nWhat is Landscapes: Societies, Cultures, and Political Economies?\n\n\nHuman geographers examine human societies and how their cultures, economies and politics develop within the context of their environment. A geographic lens allows human geographers to critically examine the intersections of these social processes and how they shape the lived and built environment. Human geographers examine topics like how race shapes the way we interact in public spaces, how gender conditions where and how people find jobs, what the links are between global finance and community activism, how immigration is shaped by family connections, and why gerrymandering political districts can change the way we think about our neighbors. Human geographers look at how these social processes construct the contexts we live in and how these contexts vary in our increasingly globalized world.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to understand why location matters to people everywhere, every day.\n\n\nYou are interested in agricultural land use, industrial development, and urban design.\n\n\nYou are curious about the reasons for population growth and international migration.\n\n\nYou want to learn about the costs of economic development.\n\n\nYou are interested in how struggles over political power and control of territory deepen inequalities between peoples and places.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses GEOG 220Perspectives on Human Geography 3 GEOG 2NApocalyptic Geographies: How can we prevent the end of the world? GEOG 320Urban Geography: A Global Perspective GEOG 324Place, Space and Culture GEOG 326Geographic Perspectives on Economic Systems GEOG 328War, Peace, and Diplomacy: Understanding Contemporary Geopolitics GEOG 421Population Geography GEOG 423Y GEOG 424 GEOG 424WGeography of the Global Economy GEOG 425Geography of Race, Class, and Poverty in America GEOG 426Y GEOG 427 GEOG 428WPolitical Geography GEOG 429Geographic Perspectives on Global Urbanization Non-Course Requirements Per University policy, all credit courses for a certificate require a grade of 'C' or higher, and at least two-thirds (2/3) of the credits used to complete a certificate must be earned at Penn State. If student is completing multiple certificates in Geography, no more than one (1) course may double-count for each."
        },
        "electives": "Elective Courses (Choose 9 credits from the following):",
        "supporting_courses": ""
    },
    "Medical plastics certificate": {
        "program_description": "Program Description\n\n\nPlastics play a critical role in a growing medical industry. A significant portion of medical devices, prosthetics, implants, tools and packaging of devices and products are dependent on plastics. Many of products could not exist, or cost would be excessive, without plastics. Medical plastics is a subset of the larger plastics industry and represents a strong growth area. Medical plastics usage is expected to increase approximately 7% per year over at least the next five years. Medical plastics also represents a large opportunity for domestic plastics manufacturers as there is a general resistance to outsourcing this production due to concerns over the quality and safety of third-world suppliers.\n\n\nWhat are Medical Plastics?\n\n\nPlastic materials are lightweight, flexible, easily shaped, and can be kept sterile, making them a no-brainer element for creating implantable medical devices and prosthetics. The certificate in Medical Plastics explores issues related to plastics’ use in medicine, including product design, materials choice, manufacturing options, and FDA regulations.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in the intersections of engineering and medicine.\n\n\nYou’d like to help people with serious medical issues.\n\n\nYou are majoring in Plastics Engineering Technology.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses BISC 4Human Body: Form and Function 3 or MICRB 106 Elementary Microbiology PLET 380Introduction to Plastic Medical Devices1 PLET 481Plastic Product Development3 PLET 482Medical Product Development1 PLET 483Plastics in Medical Applications3 PLET 484Medical Manufacturing Methods3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Meeting event management certificate": {
        "program_description": "Program Description\n\n\nThis certificate will build on HM's and RPTM's core strengths, including their strategic teaching and service/outreach initiatives. Through coursework and experiential learning opportunities, students will be provided opportunities for engaged scholarship within the Commonwealth, across the United States, and in International contexts. This additional credential can help differentiate our graduates in the competitive job market across tourism and hospitality. Likewise the opportunity to expose more Penn State students to either of our fields through the certificate can enhance our diversity of students and awareness of our professional education programs.\n \nThe MEMC is intended to complement the professional certification programs offered by organizations such as Meeting Professionals International or the Professional Convention Management Association. It is designed for students interested in the academic and experiential components of the events and meeting industry. Emphasis is on engaging students in the industry prior to graduation and developing the management competencies necessary for success in the industry.\n \nTo obtain the Certificate students will be required to complete 9 core credits, including a 3 credit internship experience, and 6 supplemental credits in HM and/or RPTM for a total of 15 credits. Graduates will be competitive for positions as managers and planners in a variety of public, nonprofit and private businesses/agencies. The certificate credential delivery model for the Meeting and Events Management Certificate was selected over identifying a Meeting and Events Management minor so as to attract professionals, alumni, and others who are working in or or are interested in gaining credentials in the field of meeting and events management but who may not be enrolled in an undergraduate program at Penn State.\n\n\nWhat is Meeting and Event Management?\n\n\nThe Meeting and Events Management Certificate (MEMC) combines the practice and theory of event management, planning, coordination, and design. Students develop knowledge and skills that complement professional certifications (e.g., Certified Meeting Professional, Certified Festival and Event Executive). Through the combined expertise in the School of Hospitality Management (SHM) and the Department of Recreation, Park, and Tourism Management (RPTM), students develop, or augment knowledge and skills needed to work as event or event-related professionals in hospitality, entertainment, recreation and parks, corporate, medical, professional, social and governmental associations, sports, and more. Key skill areas include event design, marketing, budgeting and forecasting, contracting, supplier sourcing, risk assessment, sustainability practices, on-site management, event strategy and project and stakeholder management. Before pursuing the MEMC, students interested in strategic event management in diverse segments of hospitality management (e.g. lodging, food service, gaming) should contact SHM. Students interested in strategic event management related to recreation, community, amusement or entertainment, or health and sport should contact RPTM.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou recognize event strategy as a major component to 21st century business, marketing, community, and brand building initiatives.\n\n\nYou want to design events and meetings of various scales across industries (e.g. hospitality, entertainment, tourism, recreation, and sport), and communities in different context (e.g. convention centers, arenas, hotels, festivals).\n\n\nYou enjoy the process of assessing, developing, and operationalizing an organization or customer’s vision and purpose for an event or meeting.\n\n\nYou view events, gatherings, meetings and experiences as important components of social well-being and connectedness.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses HM 384Introduction to Meeting and Event Management3 RPTM 3563 or HM 485 Advanced Meeting and Event Management RPTM 3953 Select 6 credits from the following:6 HM 201Introduction to Management in the Hospitality Industry HM 271Hospitality Information Technology Fundamentals HM 484Hospitality Entrepreneurship and Innovation HM 442Hospitality Marketing HM 455 HM 485Advanced Meeting and Event Management RPTM 300YTourism and Leisure Behavior RPTM 334Non-profit Recreation Agency Operations or RPTM 370 Introduction to Arena Management RPTM 356 RPTM 410Marketing of Recreation Services RPTM 415Commercial Recreation Management"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Museum studies certificate": {
        "program_description": "Program Description\n\n\nThe Museum Studies Certificate program is designed to be an interdisciplinary introduction to theory and practice of museums, historic sties and other public collections. It is open to undergraduate students in any major and prepares them for higher-level pre-professional study in the field.\n\n\nWhat is Museum Studies\n\n\nThe museum studies certificate offers you the opportunity to learn about museums, from their history to how they work. Museum studies encompasses all types of museums, and you can tailor your classes to focus on such places as art museums, history museums, house museums, science and technology museums, fashion and product museums, or sports museums. The certificate uses courses and internship experience to give you both theoretical and hands-on knowledge of museums.\n\n\nYou Might Like This Program If...\n\n\nYou enjoy going to museums, are curious about how they work, and are interested in museum careers.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses ARTH 495Internship3 Select one of the following:3 AMST 480Museum Studies ANTH 380Anthropology Museum Studies ARTH 409Museum Studies Select 6 credits from the following:6 AED 101SIntroduction to Art Education AED 201WHistory and Philosophy of Art Education in Schools and Cultural Institutions AED 211Interpreting Art Experience: Social-cultural Perspectives AED 212Interpreting Art Experience: Educational Implications AED 488 AMST 480Museum Studies AMST 482Public Heritage Practices ANTH 220Anthropology and Art/ifacts ANTH 380Anthropology Museum Studies ANTH 433Archaeological Ethics and Law ART 409Museum Studies ART 411Seminar in Contemporary Art ART 477Curator's Workshop ARTH 100Introduction to Art ARTH 409Museum Studies ARTH 410Taste and Criticism in Art ARTH 495Internship ARTSA 301Introduction to Arts Administration ARTSA 402WStrategic Management and Planning for the Arts ARTSA 403Fundraising and Grant Writing HIST 112Introduction to Public History HIST 404Advanced Public History HIST 490Archival Management RPTM 300YTourism and Leisure Behavior RPTM 334Non-profit Recreation Agency Operations Up to 6 credits of Internship by permission of department"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Nanotechnology certificate": {
        "program_description": "Program Description\n\n\nThe primary goal of the program is to offer students and incumbent workers worldwide the opportunity to earn this 18-credit certificate, which will be available only online. All candidates are required to successfully complete the required courses.\n\n\nWhat is Nanotechnology?\n\n\nNanotechnology is inherently interdisciplinary and bridges across physics, biology, materials science, and chemistry. It is a general purpose, enabling technology that is already impacting a broad spectrum of human endeavors, from medicine and catalysis to textiles and quantum computing. The Nanotechnology certificate is designed to help prepare students from a broad range of disciplines for careers or graduate study in fields involving nanotechnology. It builds upon the strengths of Penn State's faculty, expertise, academic programs, and nanofabrication facilities, including its class 1 and class 10 cleanrooms. The curriculum provides students with fundamental knowledge and skills in nanoscale simulation, design, syntheses, characterization, properties, processing, manufacturing, and applications.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in gaining fundamental knowledge and skills in nanoscale simulation, design, syntheses, characterization, properties, processing, manufacturing, and applications.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses ESC 211Material, Safety and Equipment Overview for Nanotechnology3 ESC 212Basic Nanotechnology Processes3 ESC 213Materials in Nanotechnology3 ESC 214Patterning for Nanotechnology3 ESC 215Nanotechnology Applications3 ESC 216Characterization, Testing of Nanotechnology Structures and Materials3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "National security agency certificate": {
        "program_description": "Program Description\n\n\nThe NSA certificate indicates students have completed the courses representing the required knowledge units as specified by the National Security Agency and the Department of Homeland Security as part of Penn State’s designation as a National Center of Academic Excellence in Cyber Defense.\n\n\nWhat is National Security Agency?\n\n\nPenn State and the College of Information Sciences and Technology are designated as a national Center of Academic Excellence (CAE) in Cyber Defense by the National Security Agency and the Department of Homeland Security. As such, the College of IST is authorized to grant security certificates of recognition and achievement to graduating students who meet certain academic criteria. The certificates certify that the student graduated from an institution and program whose faculty, resources, curricula, and commitment were evaluated and found to be of high quality, as defined by NSA/DHS for cyber security professionals.\n\n\nMORE INFORMATION ABOUT NATIONAL SECURITY AGENCY\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to protect digital information, data stores, and computer networks from threats.\n\n\nYou want to learn the cyberdefense strategies used to anticipate, recognize, and defend against computer attacks.\n\n\nYou're passionate about how we can keep sensitive information out of the hands of hackers, cybercriminals, and terrorist organizations.\n\n\n\n\nMORE INFORMATION ABOUT WHY STUDENTS CHOOSE TO STUDY NATIONAL SECURITY AGENCY",
        "entrance_to_major": "Entrance to Certificate\n\n\nMust be enrolled in ISTBS, SRA, SRAAL, SRABK or SRACA major.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better IST 140Introduction to Application Development3 or CMPSC 101 Introduction to Programming IST 210Organization of Data3 IST 220Networking and Telecommunications3 IST 451Network Security3 IST 454Computer and Cyber Forensics3 IST 456Information Security Management3 SRA 111Introduction to Security and Risk Analysis 3 SRA 221Overview of Information Security3 STAT 200Elementary Statistics 4"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Nursing forensics certificate": {
        "program_description": "Program Description\n\n\nThis 12-credit certificate introduces students to forensic health sciences, forensic nursing, and the nursing role in the scientific investigation of violence. Through this course series, nurses gain foundational forensics knowledge and skills, including evidence collection and preservation; forensic documentation; recognition of domestic violence, assault, and stalking; related public policy and regulatory guidelines; and legal and ethical issues. This program prepares nurses to provide care that is more specialized for victims and perpetrators of physical, psychological, and social violence or abuse.\n\n\nWhat is Nursing Forensics?\n\n\nViolence impacts our communities at a local, national, and global level. It’s an unfortunate reality that a high number of patients who access healthcare services are the victims of violence, abuse, or neglect. When these victims enter the healthcare system, professionals trained in forensic nursing are often their first line of defense. In addition to providing routine medical care, forensic nurses must understand the legal and ethical implications of treating victims of violence and abuse. Forensic nurses must be skilled at injury identification, evaluation, and documentation. Proper observation, collection, and preservation of evidence is often critical in determining the legal outcome of traumatic events. Penn State’s Nursing Forensics certificate provides nurses with the knowledge and skills to effectively help these patients.\n\n\nYou Might Like This Program If...\n\n\nYou are interested in working with victims who have experienced violence or trauma. Forensic nurses are vital in bridging the gap between medical care and the legal system. Students will learn to identify signs of violence, understand the resources and interventions available to help, and provide compassionate care while preserving physical evidence that may assist in criminal investigations. Enrollment in this certificate allows Nursing students to gain an additional area of concentration while pursuing their degree. This certificate introduces forensic nursing and may serve as a starting point for \nSANE (Sexual Assault Nurse Examiner) certification\n.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses NURS 245Violence and the Impact on Society 3 NURS 409Introduction to Forensic Nursing3 NURS 410Forensic Evidence Collection and Preservation3 NURS 411Seminar in Forensic Nursing3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Nursing informatics certificate": {
        "program_description": "Program Description\n\n\nThis 9-credit course series is designed to provide nurses with informatics knowledge and to prepare them to practice in information and technology rich health care environments. Those who complete the certificate will be prepared to assist in the implementation of informatics tools in healthcare environments such as electronic health records, clinical decision support tools, database management and data mining, patient safety technologies such as Bar Code Medication Administration (BCMA), RFID technologies and smart pumps. The ethical management of private health information and legislative aspects such as HIPAA and the HITECH act are also included.\n\n\nWhat is Nursing Informatics?\n\n\nNursing informatics (NI) is the specialty that integrates nursing science with multiple information and analytical sciences to identify, define, manage and communicate data, information, knowledge and wisdom in nursing practice. For many people, NI, and healthcare informatics in general, are about technology. This is especially true of electronic health records (EHRs) that are required of all care facilities. (Source: American Nurses Association, Nursing Informatics: Scope and Standards of Practice, 2nd Edition, 2015)\n\n\nYou Might Like This Program If...\n\n\nThe Nursing Informatics Certificate might be for you if you are interested in increasing your knowledge of healthcare information technologies or want to maximize use within your organization, as well as better understand and overcome the barriers that arise with the integration of technology innovations into healthcare delivery. Enrollment in this certificate also allows Nursing students to gain an additional area of concentration while pursuing the B.S.N. degree.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses NURS 357Introduction to Nursing Informatics3 NURS 458Ethical Challenges in Healthcare Informatics3 NURS 460Advanced Concepts in Clinical Nursing Informatics3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Nursing management certificate": {
        "program_description": "Program Description\n\n\nThe Nursing Management Certificate Program includes a series of four three-credit courses designed to enhance the career opportunities for currently licensed R.N.s who are working in nursing. This program is designed for registered nurses who have, or aspire to hold, entry level nurse manager positions. The program will enrich participants' knowledge of basic health care organizations and administration; collection, analysis and management of nursing data; concepts and techniques for managing nursing personnel; and concepts and techniques for enhancing nursing managerial behaviors. Courses are aligned with the core curriculum and competencies for nurse managers, developed by the American Organization of Nurse Executives.\n\n\nWhat is Nursing Management?\n\n\nIn all healthcare facilities, there is demand for dedicated and experienced nurse leaders to competently manage employees, collaborate with other healthcare managers and make higher-level decisions for the betterment of the organization. Nursing managers must build and retain a quality staff, maintain a budget and ensure excellent patient care while supervising day-to-day operations. Additionally, effective nurse managers and supervisors must motivate and lead their staff through continual healthcare changes to meet the needs of various stakeholders which include clients, insurance companies and upper-level healthcare administration. Penn State’s Nursing Management Certificate is designed to equip nurses to advance into these roles by expanding their knowledge of management theories and styles, healthcare organizational structure, human resources, information systems and current issues.\n\n\nYou Might Like This Program If...\n\n\nThe Nursing Management Certificate may be for you if you are interested in pursuing a supervisory role in the healthcare field or are already working in a supervisory role and want to improve your management skills and better understand the structure of healthcare organizations and administration. Enrollment in this certificate allows Nursing students to gain an additional area of concentration while pursuing their degree.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses NURS 430Organization and Administration for the Nurse Manager3 NURS 431Data Management for Nurse Managers3 NURS 432Nursing Management of Human Resources3 NURS 433Seminar for Nurse Managers3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Operational excellence professionals certificate": {
        "program_description": "Program Description\n\n\nOperational Excellence for Professionals This certificate is designed for the adult learner who would like to gain knowledge of essential supervisory leadership concepts. These adult learners may already possess a degree in an occupational discipline, but need to augment their knowledge and resumes to advance their careers with their current employer or transition into a new job. Adult learners taking this certificate may also be taking post-secondary credit courses for the first time.",
        "entrance_to_major": "Entrance to Certificate\n\n\nAdmissions criteria for the certificate program follow standard University procedures for adult students.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses WFED 405Project Management for Professionals3 WFED 410Leadership Competencies for Professionals3 WFED 451Lean-Sigma for Professionals3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Organizational communication certificate": {
        "program_description": "Program Description\n\n\nThis program can help you improve internal and external communication in the context of your current position or prepare you to move into a new career as a communications professional. Because the curriculum focuses on research-based skills that go beyond mere technical expertise with presentation software, the practical insights presented in this program will hold their value throughout your career.\n\n\nWhat is Organizational Communication?\n\n\nIn today's complex world of information and knowledge, organizations large and small increasingly recognize that effective communication is an essential ingredient for success. The certificate program in organizational communication is designed to help you make practical improvements in this critical area in order to make communication with peers, supervisors, customers and other stakeholders as efficient and effective as possible. This program can help you improve internal and external communication in the context of your current position or prepare you to move into a new career as a communications professional. Because the curriculum focuses on research-based skills that go beyond mere technical expertise with presentation software, the practical insights presented in this program will hold their value throughout your career.\n\n\nYou Might Like This Program If...\n\n\nYou want to learn to improve internal and external communications in the context of your current position, or to prepare you to move into a new career as a communications professional.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses CAS 283Communication and Information Technology I 3 CAS 352Organizational Communication 3 Select 6 credits of the following:6 CAS 404Conflict Resolution and Negotiation CAS 452Organizational Communication Theory and Research CAS 475Studies in Public Address ENGL 419Advanced Business Writing"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Plastics processing certificate": {
        "program_description": "Program Description\n\n\nThis 16-17 credit program is designed to provide students with an understanding of the basics of the materials and processes used to produce plastic parts. Students learn modern processing techniques and testing methods for plastics.\n\n\nWhat is Plastics Processing?\n\n\nPlastics processing is the study of the materials and processes used to produce usable, cost-effective plastic parts and components. Because plastics are everywhere, graduates with plastics experience find employment in any industry sector that interests them. Automotive, aerospace, medical, electronics, computer, toy, and consumer products manufacturers are among the industries that value advanced knowledge of plastics processing.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to add plastics processing expertise to your major degree program.\n\n\nYou envision yourself working in an plastics-intensive industry such as toy- or consumer-products design or production.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses PLET 205Introduction to Plastics3 PLET 206WPlastic Materials and Properties3 PLET 222Introduction to Plastics Processing4 PLET 227Plastics Processing & Statistical Methods4 Select one of the following:2-3 PLET 50Computer Applications for Plastics Engineering Technology MET 107Computer Applications for Technologists EDSGN 100Cornerstone Engineering Design EDSGN 100SIntroduction to Engineering Design"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Presidential leadership academy certificate": {
        "program_description": "Program Description\n\n\nThe goal of the program is to prepare students to develop leadership fundamentals to thrive in an environment in which multiple dimensions of an issue are explored, diverse viewpoints are heard, and a fully informed and respectful discourse that leads to sound action. The opportunities available will lead to further development of critical thinking abilities necessary for leaders to implement decisions with sensitivity to the circumstances that led them there. Students will develop the ability to rethink decisions and even change course along the way.\n\n\nYou Might Like This Program If...\n\n\nYou are a Penn State undergraduate student who is interested in developing your leadership abilities and critical thinking skills and are interested in engaging with and learning from some of the university’s top faculty and administrators.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses HONOR 201Developing Critical Thinking for Leadership1-3 HONOR 301The Role of Knowledge in Society3 HONOR 401Honors Seminar1-6"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Product innovation entrepreneurship certificate": {
        "program_description": "Program Description\n\n\nLearn and practice the entrepreneurial mindset in the Product Innovation Entrepreneurship Certificate. This certificate prepares you to run an entrepreneurial venture or to be an intrapreneur where you utilize the entrepreneurial mindset within an existing organization. Learn and practice business fundamentals from an entrepreneurial perspective and deal with the challenges of leading a creative entrepreneurial organization and the associated ambiguity. The certificate is open to any student who has the goal to own their own business or wants to learn to think outside the box. This certificate will help the student work effectively within any organization, always looking for ways to be more creative and innovative.\n\n\nYou Might Like This Program If...\n\n\nYou want to take control of your career, whether working for yourself or within an existing organization. The students completing this program look for careers where they have the autonomy to make decisions and take pride in their accomplishments. This program helps you build confidence to pursue opportunities that you identify. The projects you work on in these classes are a fun way to put all your major skills to use in real-world activities.\n\n\nMORE INFORMATION ABOUT PRODUCT INNOVATION ENTREPRENEURSHIP",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses BA 250Small Business Management3 or ENGR 411 Entrepreneurship Business Basics Select 6 credits from the following:6 ENGR 310Entrepreneurial Leadership ENGR 407Technology-Based Entrepreneurship ENGR 415Launching Innovation: Ideas to Opportunities ENTR 300Principles of Entrepreneurship ENTR 430Entrepreneurship and New Product Development MGMT 427Managing an Entrepreneurial Start-Up Company MGMT 431Entrepreneurship and Small Business Management"
        },
        "electives": "Some of the classes in this program can be applied to the School of Engineering Design and Innovation graduate programs including the Master of Engineering in Engineering Design and the Master of Engineering in Leadership and Innovation Management, and as electives in other programs.",
        "supporting_courses": ""
    },
    "Professional snowsports education certificate": {
        "program_description": "Program Description\n\n\nThis nine credit certificate program introduces students to professional snowsports education and focuses on three components. First component, becoming a member of the Professional Ski Instructors of America- American Association of Snowboard Instructors (PSIA-AASI), preparing for and completing the level I certificate. Second component, learning about snowsports areas and leadership responsibilities when working in winter environments (including nutrition, group management, health and safety, fitness and physical conditioning). Final component, developing an understanding of leisure and the role it plays in people lives and theories that can help in enhancing the guest experience.\n\n\nWhat is Professional Snowsports Education?\n\n\nThe Snowsports Education Certificate program is a 9 credit certificate that guides students on a first step into teaching people about snowsports and understanding the snowsports industry. The program is available in a convenient hybrid format, with most course content taught on-line and a three day snow assessment course which can be taken in various snowsport resorts across the country.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy winter sports and spending time with people who are learning new skills.\n\n\nYou want to provide potential employers with a credential that shows your expertise in teaching about snowsports.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses RPTM 120Leisure and Human Behavior 3 RPTM 215Snowsports Education3 RPTM 115Leadership Development in Snowsports3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Project supply chain analytics certificate": {
        "program_description": "Program Description\n\n\nThe project and supply chain management job market remains strong, and the demand for analytics skills within the domain has been growing significantly. With the newly added electives, including \nSCM 340\n: Introduction to Supply Chain Analytics and \nMGMT 430\n: Project Risk Management, the analytics components within the PSCM program have been strengthened and emphasized. A Project and Supply Chain Analytics certificate will maximize the value of the course offerings and enhance student employability.\n\n\nWhat is Project and Supply Chain Analytics?\n\n\nProject and Supply Chain Analytics is an interdisciplinary field that integrates principles of project management, supply chain management, and data analytics to improve the flow of goods, services, and information. The certificate is designed to equip students with the comprehensive skills and knowledge required to effectively use analytics to generate solutions and insights for decision-making. This includes enabling students to apply analytical methods to solve real-world problems and to align project and supply chain strategies with organizational goals.\n\n\nYou Might Like This Program If...\n\n\nIf you're passionate about using data to solve problems, then you'll appreciate how this certificate teaches you to apply analytics to improve supply chain and project management processes. This certificate program covers essential skills, including analyzing and applying data, interpreting results, and communicating insights.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses MGMT 410Project Management3 MGMT 430Project Risk Management3 SCM 340Introduction to Supply Chain Analytics3 SCM 301Supply Chain Management3"
        },
        "electives": "The project and supply chain management job market remains strong, and the demand for analytics skills within the domain has been growing significantly. With the newly added electives, including",
        "supporting_courses": ""
    },
    "Public relations certificate": {
        "program_description": "Program Description\n\n\nThe Certificate in Public Relations offered at Penn State Behrend is designed for communication and business majors who wish to focus their supporting or non-business supporting coursework in a specific professional communication area. The certificate is also designed for working professionals interested in developing their skill-set in public relations. The foundation of the certificate is developed in the Media Writing, Introduction to Public Relations, and Public Relations Media and Methods courses. Students are then allowed to choose one additional advanced course to complete the 12 required hours.\n\n\nWhat is Public Relations?\n\n\nPublic relations is the art and science of trying to create strong relationships and goodwill between an individual or an organization and the public. It differs from advertising as it does not usually use paid messaging.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are creative.\n\n\nYou have strong oral and written communication skills.\n\n\nYou think strategically and can formulate plans quickly.\n\n\nYou are pursuing a communications- or business-related degree.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses COMM 315Applications for Media Writing3 COMM 370Public Relations3 COMM 471Public Relations Media and Methods3 COMM 472Public Relations Event Planning3 or COMM 473 Public Relations Campaigns"
        },
        "electives": "",
        "supporting_courses": ""
    },
    "Real estate analysis development certificate": {
        "program_description": "Program Description\n\n\nThe Real Estate Analysis and Development (RLESAD_UCT) certificate is designed to prepare students for a variety of careers in the real estate industry. It specifies coursework in advanced real estate analysis and investments. Students pursuing this certificate will be encouraged and better prepared to seek careers in commercial real estate development, analysis, investment, valuation, banking, and brokerage. They will be positioned to enter the financial management training programs of leading corporations. Strong demand exists from corporate recruiters for well-prepared graduates to enter these post-graduation training programs.\n\n\nWhat is Real Estate Analysis and Development?\n\n\nThe Real Estate Analysis & Development Certificate is designed to prepare students for opportunities to interact with the real estate industry in an intimate way. Students will gain an understating of the complexities of real estate resources, which will assist them in both personal and professional investment decisions. Skills that will be enhanced include negotiations, investment analysis, enhanced financial techniques and institutional knowledge of the real estate sector. By completing the READ Certificate, students will be given opportunities to participate in the Real Estate Boot Camp, which offers site visits, special guest lecture series, a REIT Case Competition and other special opportunities unique to the commercial real estate sector.",
        "entrance_to_major": "Entrance to Certificate\n\n\nThe RLESAD_UCT certificate is only open to students enrolled in a Smeal College of Business major. The RLESAD_UCT certificate is not open to students enrolled in the Risk Management major - Real Estate option.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses RM 303Real Estate Fundamentals3 RM 450Contemporary Issues in Real Estate Markets3 Select one of the following:3 RM 424Real Estate Law RM 460Real Estate Financial Analysis RM 470Real Estate and Capital Markets RM 475Quantitative Analysis for Business Non-Course Requirements Extracurricular Activities - While not a RLESAD_UCT requirement, students who enroll in the certificate are encouraged to participate in the extra-curricular Real Estate Boot Camp offered by the Institute for Real Estate Studies (IRES) which is housed in the Smeal College of Business. Students are also encouraged to join the Real Estate Society club while at Penn State."
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Science research distinction certificate": {
        "program_description": "Program Description\n\n\nThe certificate will provide an incentive for students to write a thesis based on an independent research project. Students may be entered into the certificate program upon identification of a research mentor. Members of the graduate faculty are eligible to be mentors. Emeritus faculty or non-tenure track faculty members may serve as mentors, subject to approval by the Associate Dean for Undergraduate Education. Students must engage in research activities over the course of at least 3 semesters or 2 semesters and a summer. Theses must be approved by the research mentor, a reader who is a faculty member eligible to serve as a research mentor, and the Department Head or Director of Undergraduate Studies of a unit within ECoS unless the department has a specific alternative policy in place for thesis approval. The schedule for submission of theses will be the same as Schreyer Honors Theses. Honors students cannot use a single thesis to earn both the distinction of honors and a Research Distinction Certificate but may earn both distinctions by production of independent theses.\n\n\nWhat is Science Research Distinction?\n\n\nThe Science Research Distinction program is available to students who are interested in working on an independent research project under the supervision of a faculty mentor, and documenting the results of their work in a research thesis.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are passionate about research in your field of study.\n\n\nYou want to design your own research project with the help of a faculty mentor.\n\n\nYou plan to go to graduate school.\n\n\nYour career path requires you to develop strong lab/field skills.\n\n\nYou want to write a thesis as a summary of your research accomplishments.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses SC 494Research Project Courses (section 002 in semester that thesis is approved)1 Select 6 credits in independent research in Eberly College of Science from the following:6 ASTRO 296Independent Studies ASTRO 496Independent Studies BIOL 296Independent Studies BIOL 496Independent Studies BMB 488Communities of Practice in Biochemistry and Molecular Biology BMB 496Independent Studies CHEM 294Special Problems and Research CHEM 494Chemical Research FRNSC 496Independent Studies MATH 296Independent Studies MATH 496Independent Studies PHYS 296Independent Studies PHYS 496Independent Studies STAT 496Independent Studies"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Security risk analysis certificate": {
        "program_description": "Program Description\n\n\nOur society operates through information and communication technology-based infrastructures from the Internet to cell phones to organization-specific information systems across all sectors of our economy. We use these infrastructures to communicate; to conduct business; to facilitate relationships between governments; to analyze data for trends in business, social, and international settings; and to use the outputs to make decisions in countless venues. These infrastructures hold data which holds clues to how we interact with society, government, and the economy. The SRA certificate provides introductory curriculum that covers information systems, information assurance (both digital and physical security) and intelligence analysis.\n\n\nWhat is Security and Risk Analysis?\n\n\nSecurity and risk analysis is a field that explores the integrated processes conducted to provide decision-makers with the information needed to understand factors that can negatively influence operations and outcomes, and make informed judgments concerning the extent of actions needed to reduce vulnerabilities, protect resources, and optimize investments. Security and risk analysis is a field of practice with two blended concentration areas: 1) security, which seeks to identify, understand, and analyze critical local, national and international security issues, and 2) risk, which includes risk assessment, risk characterization, risk communication, risk management, and the formulation of risk policy. In practice, the issues and processes for conducting of security and risk analytics are neither separate nor sequential. To be effective, the issues of security and risk must be addressed concurrently and synergistically.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou want to protect people, information, and assets from manmade and natural threats.\n\n\nYou want to understand the role of data in protecting individuals, organizations and our nation.\n\n\nYou are mission-oriented, a good critical thinker and wish to put your problem-solving skills to work to make the world a safer place.\n\n\nYou want to make informed strategic decisions that help to defend critical infrastructures that support our daily lives.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better IST 110Information, People and Technology 3 SRA 111Introduction to Security and Risk Analysis 3 SRA 211Threat of Terrorism and Crime3 SRA 221Overview of Information Security3 Select one of the following:3 CMPSC 101Introduction to Programming CMPSC 121Introduction to Programming Techniques IST 140Introduction to Application Development"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Small group conflict collaboration certificate": {
        "program_description": "Program Description\n\n\nThe undergraduate certificate in Small Group Conflict and Collaboration is designed and delivered by the World in Conversation (WinC), Penn State's undergraduate center for public diplomacy. Students who complete this 15-credit certificate will be trained dialogue facilitators: they will have an understanding of the forces that shape human communication on the interpersonal, societal, and global levels, and they will be able to apply this understanding by leading small group dialogues, applying a unique communication methodology developed by WinC over two decades. WinC is a laboratory for the sociological study of small groups and facilitation techniques that make communication across borders possible. As such, the study of facilitated dialogue that a student undertakes at WinC is truly \"applied sociology\"—because sociological concepts practically intersect with and shape communication technologies. The combination of mindset and skills that a facilitator develops as a result of this fusion of disciplines is what makes impossible conversations possible. While students at WinC are trained in the specific academic context of applied sociology, trained facilitators are necessary in all environments in which human beings conflict and collaborate. As such, the competencies developed through this certificate are relevant across all academic disciplines. This certificate will prepare students to take on key roles in high level decision-making in education, politics, business, or law. They might also use this credential to build a career in areas as varied as Science, Medicine, Organizational Change and Leadership, Social Policy, Business Management, Marketing, Social Work, and Education.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses LA 496Independent Studies6 SOC 369Foundational Theory and Practice in Small Group Facilitation 3-4 SOC 469Advanced Theory and Practice in Small Group Facilitation 6"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Smeal college business fundamentals certificate": {
        "program_description": "Program Description\n\n\nThe Smeal College Business Fundamentals Certificate provides non-Smeal students with the background and knowledge for careers in corporate and non-profit settings. Core courses are framed around an integrated approach to management, finance, global operations, product development and promotion, and legal aspects of business. Students gain practical skills needed to compete in today's rapidly changing business environment.\n\n\nWhat is Smeal College Business Fundamentals?\n\n\nThe Smeal College Business Fundamentals Certificate will add to your knowledge base across a range of critical business areas and add a Smeal-specific designation to your University transcript upon completion. If you are in a major that is not business related or if you are in a non-Smeal major with a business option or concentration, this certificate will allow you to pursue your interests outside of Smeal while broadening your undergraduate experience to develop fundamental business skills. Prerequisite courses in accounting, economics and statistics will lay the foundation for the core courses in management, marketing, finance and supply chain. In addition, a business elective in either business law or international business may be chosen. This certificate will help you develop the skills that will be needed in whatever career you choose to pursue.\n\n\nMORE INFORMATION ABOUT SMEAL COLLEGE OF BUSINESS FUNDAMENTALS",
        "entrance_to_major": "Entrance to Certificate\n\n\nStudents must be enrolled in a non-business baccalaureate program to pursue this certificate.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prerequisite Courses ACCTG 211Financial and Managerial Accounting for Decision Making4 ECON 102Introductory Microeconomic Analysis and Policy 3 Select three credits of 200-level statistics3 Prescribed Courses Prescribed Courses: Require a grade of C or better BA 301Finance3 BA 302Supply Chains3 BA 303Marketing3 BA 304Management and Organization3 BLAW 243Legal Environment of Business3 or IB 303 International Business Operations"
        },
        "electives": "The Smeal College Business Fundamentals Certificate will add to your knowledge base across a range of critical business areas and add a Smeal-specific designation to your University transcript upon completion. If you are in a major that is not business related or if you are in a non-Smeal major with a business option or concentration, this certificate will allow you to pursue your interests outside of Smeal while broadening your undergraduate experience to develop fundamental business skills. Prerequisite courses in accounting, economics and statistics will lay the foundation for the core courses in management, marketing, finance and supply chain. In addition, a business elective in either business law or international business may be chosen. This certificate will help you develop the skills that will be needed in whatever career you choose to pursue.",
        "supporting_courses": ""
    },
    "Social justice certificate": {
        "program_description": "Program Description\n\n\nThe Certificate in Social Justice provides concentrated study in the broad field of justice studies. Certificate awardees are required to take 12 credits of courses that examine how unequal power relationships shape human experience and structure life outcomes. These courses will pay particular attention to categories such as race, gender, sexuality, class, nation, faith, physical and mental ability, age, geography, linguistic heritage, citizenship status, and environment. Moving beyond cultural appreciation and difference, affiliated courses will focus on injustice, inequality, and the work of freedom. This certificate program is open to all students and is offered in collaboration with faculty from diverse academic disciplines. With an evidence-driven understanding of history, oppression, and structural inequality, this certificate program champions the ideals of equity, justice, and democracy. Above all, this certificate helps students work toward a future in which all members of our college community and society have been empowered with knowledge and understanding to reach their full potential. Certificate awardees will be better prepared to understand and address issues of injustice not only while in college, but also in their communities and future careers.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses SOC 205NCritical Race Theory in the Humanities and Social Sciences 3 Select 9 credits from the following:9 AFAM 101NAfrican American Women AMST 226NCritical Approaches to Hip-Hop CAS 222NFoundations: Civic and Community Engagement CAS 271NIntercultural Communication CAS 455Topics in Gender and Communication CAS 471Intercultural Communication Theory and Research CHEM 3Molecular Science With Laboratory CI 280Introduction to Teaching English Language Learners CRIMJ 406Sociology of Deviance CRIMJ 423Sexual and Domestic Violence CRIMJ 451Race, Crime, and Justice CRIMJ 453Women and the Criminal Justice System EARTH 2The Earth System and Global Change EDTHP 115ACompeting Rights: Issues in American Education ENGL 135Alternative Voices in American Literature ENGL 139African American Literature ENGL 182CLiterature and Empire ENGL 194Women Writers ENGL 236NInequality: Economics, Philosophy, Literature ENGL 472Current Theories of Writing and Reading HDFS 175NIntroduction to Youth Development and Arts-based Social Justice KINES 341The Historical, Cultural, and Social Dynamics of Sport MGMT 297Special Topics MGMT 497Special Topics NUTR 175ZHealthy Food for All: Factors that Influence What we Eat in the US PSYCH 441Health Psychology RHS 100Introduction to Disability Culture SOC 30Sociology of the Family SOC 119NRace, Ethnicity and Culture SOC 205NCritical Race Theory in the Humanities and Social Sciences STS 233ZEthics and the Design of Technology STS 245ZGlobalization, Technology, and Ethics SUST 242NIssues in Sustainability WMNST 100Introduction to Women's and Gender Studies WMNST 200Global Feminisms WMNST 116NFamily and Gender Roles in Modern History WMNST 117Women in United States History"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Space systems engineering certificate": {
        "program_description": "Program Description\n\n\nThis certificate program is designed to prepare students for careers in the space industry and for work on space systems. To achieve this, a minimum program of three space systems engineering related courses, a space systems engineering seminar, and project work is to be completed.\n\n\nYou Might Like This Program If...\n\n\nYou would like to explore a how to approach the engineering of complex systems; you have an interest in space, aerospace engineering, or satellites, or have an interest in working within the defense and/or aerospace industry.",
        "entrance_to_major": "Entrance to Certificate\n\n\nFor entrance into the certificate program, students must be at least 5th semester standing. The cumulative GPA considered for admission will be consistent with, or equivalent to, the GPA minimum of 2.00 for maintaining good academic standing.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Prescribed Courses: Require a grade of C or better EE 474Satellite Communications Systems3 Select one of the following:2-9 AERSP 401ASpacecraft Design--Preliminary AERSP 401BSpacecraft Design--Detailed AERSP 430Space Propulsion and Power Systems AERSP 450Orbit and Attitude Control of Spacecraft AERSP 492Space Astronomy and Introduction to Space Science AERSP 497Special Topics AERSP 550Astrodynamics AERSP 597Special Topics AERSP 597Special Topics EE 472Space Astronomy and Introduction to Space Science EE 474Satellite Communications Systems Select one of the following:3-9 AERSP 55Space Science and Technology AERSP 309Astronautics AERSP 540Theory of Plasma Waves EDSGN 597Special Topics EE 471Introduction to Plasmas EE 477Fundamentals of Remote Sensing Systems EE 534Conformal Antennas EE 541Manufacturing Methods in Microelectronics EE 576Inversion Techniques in Remote Sensing EE 579Microwave Radar Remote Sensing EE 580Linear Control Systems EE 581Optimal Control GEOSC 21Earth and Life: Origin and Evolution GEOSC 474Astrobiology METEO 477Fundamentals of Remote Sensing Systems NUCE 490Introduction to Plasmas NUCE 540Theory of Plasma Waves STS 55Space Science and Technology"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Spanish healthcare certificate": {
        "program_description": "Program Description\n\n\nA certificate in Spanish for Healthcare will benefit the students of Penn State Berks who wish to enhance their speaking, reading, writing, and translating skills to use as professionals in various Healthcare and Human Services fields. This certificate will complement Penn State Berks' Spanish minor, several other existing bachelor's degrees throughout Penn State, and Continuing Education programs. The certificate in Spanish for Healthcare may be started and/or completed at Penn State Berks or any other Penn State location offering these courses. The certificate can be completed in conjunction with a major or minor in Spanish, but will be available to all students, regardless of whether they are in a major, minor, associate degree, 2+2 program, or are non-degree seeking students. Upon completing the certificate in Spanish for Healthcare, given that students begin the four-course sequence with at least a 12-credit proficiency level, they should be able to: 1) Communicate (speak, read, write) in Spanish in healthcare settings at an intermediate to advanced level (depending on each student's background) and translate basic (non-specialized) documents accurately; 2) Employ knowledge of specialized healthcare terminology and services relevant to their particular fields; and 3) Recognize cultural practice, apply cultural knowledge, and practice cultural humility in healthcare settings, while considering regional differences in Hispanic cultures and cultural identity.\n\n\nWhat is Spanish for Healthcare?\n\n\nSpanish for Healthcare is a growing field that aims to increase your competence in using the Spanish language (speaking, writing, reading, translating) while working in a variety of healthcare and human services professions. Learning how to use Spanish on a professional level can complement a broad range of disciplines such as education, health sciences, human services, international relations, and many others.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy learning about cultures and languages.\n\n\nYou are interested in being able to use the Spanish language for your future job.\n\n\nYou have a major related to global or international studies, communication, education, or languages.\n\n\nYour major is related to human services, science, or healthcare.\n\n\nYou have some experience learning Spanish but need more instruction to use it in the real world.\n\n\nYou are a native, heritage, or bilingual speaker of Spanish and want to refine your communication skills.\n\n\nYou enjoy thinking between languages or learning new ones.\n\n\nYou are passionate about equal access to healthcare.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses SPAN 100BIntermediate Grammar and Composition for Students in Medical-Related Fields3 SPAN 200Intensive Grammar and Composition3 or SPAN 301 Intensive Grammar and Composition for Spanish Bilinguals SPAN 300BAdvanced Grammar and composition for Students in Medical-related Fields3 SPAN 412Translation3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Spatial analysis engineering design principles certificate": {
        "program_description": "Program Description\n\n\nThis certificate provides innovative instruction about the application of new design methods and processes in a variety of engineering disciplines. The certificate emphasizes how to use computer-aided design (CAD) software to create concise drawings to develop an effective design system to provide solutions for specific products, systems, components, or services. The certificate further investigates the significance of industry standards and the practices of spatial analysis and tolerance requirements in design. Contact Douglas Miller at Penn State DuBois, 814-375-4731 or \ndjm290@psu.edu\n.\n\n\nWhat is Spatial Analysis and Engineering Design Principles?\n\n\nSpatial analysis and design combines both technical and design skills to aid in the development methods for solving engineering problems. Starting with the basic methods and ethics of engineering design and developing computer-aided design (CAD) skills, this program is intended to help develop drafting, design, and CAD skills.\n\n\nYou Might Like This Program If...\n\n\nYou are good with technology, enjoy investigating the design behind parts and components, have every disassembled machines or appliances to see how they work, or have an interest in computer-aided design (CAD) software.\n\n\nEmployment opportunities upon completion of the certificate program have included employers seeking draftsmen, designers, and assistant entry-level engineering and engineering technology level opportunities.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses EDSGN 100Cornerstone Engineering Design3 EDSGN 110Spatial Analysis in Engineering Design2 EDSGN 210Tolerancing and Spatial Models2"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Sports administration certificate": {
        "program_description": "Program Description\n\n\nThis 15-credit interdisciplinary program offers students an introduction to different aspects of sports administration careers, broadly defined. Students who complete this certificate will enhance their portfolios and career opportunities to include working in the fields of sports management, business/retail, media, sporting teams, and recreational programs.\n\n\nWhat is Sports Administration?\n\n\nSport management is the broad field of business associated with athletics, sports teams and recreation.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy sports and recreation.\n\n\nYou desire to add this knowledge to your major program of study.",
        "entrance_to_major": "Entrance to Certificate\n\n\nStudents should be aware of possible course prerequisites for some of the listed courses.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses COMM 170Introduction to the Sports Industry3 Select 3 credits from the following:3 BA 495ABusiness Internship CAS 495Internship COMM 495Internship MGMT 495Internship PSYCH 495Internship Select 9 credits from one of the following tracks:9 Sports Business and Data Analytics ACCTG 211Financial and Managerial Accounting for Decision Making ECON 460Issues in Sports Economics FIN 301Corporation Finance MIS 345Introduction to Data Analytics Sports Event Planning and Promotion CAS 182NCommunication and Sport CAS 252Business and Professional Communication COMM 100NThe Mass Media and Society COMM 320Introduction to Advertising (Third Semester Standing) COMM 370Public Relations COMM 412Sports, Media and Society COMM 458Media Law and Ethics COMM 472Public Relations Event Planning COMM 476Sports Writing COMM 478Sports Information CRIMJ/CRIM/SOC 467Law and Society MGMT 433Leadership and Team Building MKTG 310Public Relations and Marketing MKTG 443Sports Marketing Sports Marketing COMM 100NThe Mass Media and Society COMM 458Media Law and Ethics CRIM/CRIMJ/SOC 467Law and Society MKTG 327Retailing MKTG 410Personal Selling MKTG 443Sports Marketing MKTG 449Sports Business Market Strategy MKTG 480Intermediate Social Media Marketing MKTG 485Business-to-Business Marketing Sports Health and Wellness Management KINES 24Lifetime Sports KINES 341The Historical, Cultural, and Social Dynamics of Sport KINES 395B/AMST 441Leadership Practicum: KINES KINES 441History of Sport in American Society NUTR 251Introductory Principles of Nutrition NUTR 407Nutrition for Exercise and Sports"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Sports journalism certificate": {
        "program_description": "Program Description\n\n\nThe program explores issues and trends through instruction, programming and research. The curriculum covers sports writing, sports broadcasting, sports information, sports ethics, sports media and society, sports industry, and sports and public policy. The \nCenter\n emphasizes media-related internships. Students are encouraged to complete co-curricular work at the student-run newspaper, the campus radio and TV stations, and the Athletic Department. Students must earn a minimum of six credits from \nCOMM 476\n, \nCOMM 477\n and/or \nCOMM 478\n and complete an on-campus sports media activity and/or internship.\n\n\nWhat is Sports Journalism?\n\n\nThirty-one varsity teams. The chance to cover them in any format: multimedia, photo, text and video. Penn State students interested sports communications and sports journalism careers are in the perfect spot to hone their skills. A combination of classroom instruction and co-curricular activities provide unrivaled opportunities to gain hands-on experience using the same hardware as professionals across the country, and often working side by side at major events with those professionals. Completing the certificate helps prepare students for opportunities with league, sport and team publicity and sports information operations, as well as members of the sports media in its varied formats.\n\n\nMORE INFORMATION ABOUT SPORTS JOURNALISM",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses Select 6 credits of the following:6 COMM 476Sports Writing COMM 477Sports Broadcasting COMM 478Sports Information"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Supervisory leadership professionals certificate": {
        "program_description": "Program Description\n\n\nSupervisory Leadership for Professionals This certificate is designed for the adult learner who would like to gain knowledge of essential supervisory leadership concepts. These adult learners may already possess a degree in an occupational discipline, but need to augment their knowledge and resumes to advance their careers with their current employer or transition into a new job. Adult learners taking this certificate may also be taking post-secondary credit courses for the first time.",
        "entrance_to_major": "Entrance to Certificate\n\n\nAdmissions criteria for the certificate program follow standard University procedures for adult students.",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses WFED 310Leadership Competencies for Supervisors3 WFED 411Occupational Safety and Health for Workforce Education and Development Professionals3 WFED 450Cultural Diversity in the Workplace3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Supply chain management certificate": {
        "program_description": "Program Description\n\n\nThe certificate program in logistics and supply chain management introduces you to key concepts in the field, such as systems analysis, trade-off analysis, transport systems, procurement, inventory management, and supply chain integration and strategy. The program provides an overview of logistics and supply chain management and addresses the needs of manufacturers, wholesalers, retailers, merchandisers, transportation and warehousing firms, and government agencies. The implications of e-commerce in relation to supply chain management are also explored.\n\n\nWhat is Supply Chain Management?\n\n\nSupply chain management pertains to the flow of goods and services. It includes the movement and storage of raw materials, work-in-process inventory, and finished goods from point of origin to point of consumption.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou enjoy thinking about process and organization within business.\n\n\nYou want an introduction to supply chain management that you can earn in a short time.\n\n\nYou want to add supply chain skills to your major program of study.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses SCM 301Supply Chain Management3 SCM 320Transport Systems3 SCM 416Warehousing and Terminal Management3 SCM 460Purchasing and Materials Management3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Trauma studies certificate": {
        "program_description": "Program Description\n\n\nThis 18 credit certificate will provide the core information and competencies for students interested in pursuing research and applied experiences in trauma studies. The certificate is open to all majors; students will be provided with an interdisciplinary understanding of the psychological, historical, sociocultural, political, and physiological aspects of the effects of trauma. It will also provide students a greater understanding of the unique economic, occupational, physical, medical, and interpersonal needs of those recovering from trauma. The certificate is consistent with psychology program goals to develop clear career tracks for current students interested in the applied fields of psychology.\n\n\nWhat is Trauma Studies?\n\n\nExperiencing a traumatic event such as war, urban violence, child abuse, sexual assault, domestic violence, accident, or natural disaster, is known to likely lead to a negative impact on psychological and physical health. Unfortunately, most people experience traumatic events during their lifetimes, making trauma studies one of the fastest growing areas in the social sciences.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a Psychology major interested in a counseling or psychotherapy career.\n\n\nYou are interested in research related to trauma and recovery.\n\n\nYou are interested in interdisciplinary explanations of human behavior and recovery after trauma.\n\n\nYou are in an allied health field and would like to better understand the impact of trauma on people’s lives.\n\n\nYou recognize that people recovering from trauma have unique emotional-health needs and want to help them.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses PSYCH 100Introductory Psychology 3 PSYCH 442Trauma and Resiliency3 Select two of the following:6 CI 433Teaching with Trauma in Mind: Implications for Instruction and Classroom Practices HDFS 108NArt and Science of Human Flourishing HDFS 258NIntroduction to Child Maltreatment and Advocacy Studies HDFS 448Death and Bereavement KINES 81Wellness Theory KINES 82Action Methods for Stress Management NURS 464Dying and Death PSYCH 150NHuman Nature: The Science of Extreme Altruism and Violence PSYCH 217NThe Science of Human Resilience PSYCH 243Introduction to Well-being and Positive Psychology PSYCH 270Introduction to Abnormal Psychology RHS 433Trauma-informed care for school & human service professionals SOC 5Social Problems SOC 12Criminology SOC 13Juvenile Delinquency SOC 409Racial and Ethnic Inequality in America SOCW 205Diversity, Equity, Inclusion, and Justice WMNST 103Racism and Sexism WMNST 266YSexuality and Violence in Nineteenth-Century America WMNST 423Sexual and Domestic Violence Select two of the following:6 AFAM 100NBlack Freedom Struggles AFAM 152African American History ASIA 105War and Memory in Asia: Twentieth Century and beyond CAS 373The Rhetorics of War and Peace CMLIT 128NThe Holocaust in Film and Literature CMLIT 143Human Rights and World Literature ENGL 245Introduction to LGBTQ Studies GLIS 102NGlobal Pathways HIST 121History of the Holocaust 1933-1945 HIST 130Introduction to the Civil War Era, 1848 through 1877 HIST 140The History of the Israel-Palestine Conflict (1917-Present) HIST 144The World at War: 1939-1945 HIST 173Vietnam in War and Peace HIST 177Rise of Modern Southeast Asia HIST 444The United States in Civil War and Reconstruction--1850-1877 PLSC 14International Relations PLSC 132The Politics of International Intolerance PLSC 155Understanding Tyranny PLSC 223NEthnic and Racial Politics PLSC 290NComparative Violence: Political and Criminological Perspectives PLSC 291Introduction to Peace and Conflict Studies PLSC 436Civil Wars PLSC 437War in World Politics PLSC 439The Politics of Terrorism"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Turfgrass management advanced certificate": {
        "program_description": "Program Description\n\n\nThis 30-credit certificate program is a comprehensive course of study that builds upon the basic turfgrass management certificate program. It's ideal for those who already have a bachelor's degree in another field and for those who are working toward a bachelor's degree in turfgrass.\n\n\nWhat is Turfgrass Management?\n\n\nThe Turfgrass Management Certificates includes basic and applied plant sciences with a focus on practical turfgrass management. The advanced certificate includes an internship to prepare students for careers as decision makers in golf course, sports field, and landscape construction and management.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are working in the turfgrass industry and want to improve your technical knowledge of turfgrass.\n\n\nYou want to advance your career in golf course or sports turf management.\n\n\nYou want to use your technical expertise to solve problems related to plants and the environment.\n\n\nYou have a sense of accomplishment seeing your work appreciated by others.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses TURF 230Turfgrass Pesticides1 TURF 235The Turfgrass3 TURF 490Colloquium1 TURF 495Internship1-18 Select 21-22 credits from additional courses:21-22 ENT 317Turfgrass Insect Pest Management PPEM 412Turfgrass Disease Management SOILS 101Introductory Soil Science TURF 238Turf and Ornamental Weed Control TURF 307Golf Course Irrigation and Drainage TURF 425Turfgrass Cultural Systems TURF 434Turfgrass Edaphology TURF 435Turfgrass Nutrition TURF 436WCase Studies in Turfgrass Management"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Turfgrass management certificate": {
        "program_description": "Program Description\n\n\nStudents in this program will build the knowledge and skill necessary to assess, treat, and manage turf in any climate or terrain. This program addresses pest management, turfgrass cultural systems, and turfgrass edaphology and culminates in a series of case studies in turfgrass management.\n\n\nWhat is Turfgrass Management?\n\n\nThe Turfgrass Management Certificates includes basic and applied plant sciences with a focus on practical turfgrass management. The advanced certificate includes an internship to prepare students for careers as decision makers in golf course, sports field, and landscape construction and management.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are working in the turfgrass industry and want to improve your technical knowledge of turfgrass.\n\n\nYou want to advance your career in golf course or sports turf management.\n\n\nYou want to use your technical expertise to solve problems related to plants and the environment.\n\n\nYou have a sense of accomplishment seeing your work appreciated by others.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses TURF 230Turfgrass Pesticides1 TURF 235The Turfgrass3 Select 11-13 credits from the following courses:11-13 ENT 317Turfgrass Insect Pest Management PPEM 412Turfgrass Disease Management TURF 238Turf and Ornamental Weed Control TURF 307Golf Course Irrigation and Drainage TURF 425Turfgrass Cultural Systems TURF 434Turfgrass Edaphology TURF 435Turfgrass Nutrition TURF 436WCase Studies in Turfgrass Management"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Weather forecasting certificate": {
        "program_description": "Program Description\n\n\nStudents in this program will have an opportunity to become a better-informed, critical consumer of weather-related news. Students will also have a chance to use powerful, web-based forecasting tools. There are no formal calculus or physics requirements for entrance to the program.\n\n\nWhat is Weather Forecasting?\n\n\nWeather forecasting uses science (understanding of atmospheric processes) and data (such as temperature, humidity, precipitation, and wind) to predict future weather conditions. Use the program's innovative forecasting techniques and conceptual approaches to learn about meteorology, enrich your hobby, supplement your professional career, or build a preparatory foundation for future study or work. As a student in this program, you will have the opportunity to become a better-informed, critical consumer of weather-related news. Whether you are an amateur weather enthusiast or a weather-related industry professional, enrolling in this 12-credit certificate program can help you refine your skills to predict the weather more effectively.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are a weather enthusiast seeking a preparatory foundation in order to pursue an undergraduate degree in meteorology.\n\n\nYou are a communications major looking for a stepping stone into the broadcasting profession.\n\n\nYou are a secondary school teacher who aspires to enhance your understanding of meteorology.\n\n\nYou are a sailing enthusiast or pilot who relies on meteorological data to chart courses or plan flights.\n\n\nYou are in a business that is affected by weather and want a deeper understanding of meteorology.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Prescribed Courses METEO 101Understanding Weather Forecasting3 METEO 241Fundamentals of Tropical Forecasting3 METEO 361Fundamentals of Mesoscale Weather Forecasting3 METEO 410Advanced Topics in Weather Forecasting3"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Worklink strategies employability certificate": {
        "program_description": "Program Description\n\n\nThe WorkLink program is a fully integrated, 2-year certificate program, in WorkLink Strategies and Employability, at Penn State University (University Park). The WorkLink program provides the opportunity for individuals with Intellectual Disabilities (ID) to participate in postsecondary experiences and education alongside their peers. WorkLink program objectives are to support students with ID in developing work and independent living skills.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses RHS 93WorkLink Seminar I1-12 RHS 193WorkLink Seminar II1-12 RHS 295AWorkLink Internship1-12"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    },
    "Youth development social justice certificate": {
        "program_description": "Program Description\n\n\nThe 12-credit certificate program was designed to help understand the unique challenges facing adolescents and young adults. Intended for counselors, educators, family therapists, social workers and other professionals dedicated to serving the developmental needs of youth in contemporary society, the program provides an overview of the major issues that impact youth development from a social justice perspective.\n\n\nWhat is Youth Development and Social Justice?\n\n\nThe Youth Development and Social Justice (YDSJ) program focuses on the promotion of positive youth development within the context of social justice. The YDSJ framework views young people as assets and active change agents with the capacity to transform their lives and the world toward equity and justice.\n\n\nThe program provides an overview of the interconnectedness between youth development and youth resistance to social injustice. Students in the YDSJ minor will: 1) analyze issues of equity and oppression in relation to youth development, 2) work directly with youth in the community, and 3) apply theory to practice to build on the strengths of communities and youth. The program is experiential in nature and students learn by doing in trainings, workshops, and community settings.\n\n\nYou Might Like This Program If...\n\n\n\n\nYou are interested in youth empowerment and social change.\n\n\nYou want to study big questions, such as such as: 'what does equitable education look like?' and 'how does youth organizing translate to social policy?'.\n\n\nYou want to make a difference in the lives of youth and communities.\n\n\nYou want to learn about the impacts of discrimination and oppression on youth development.\n\n\nYou want to pursue a career in behavioral health, social work, education, advocacy, nonprofit administration, community development, public policy, community organizing, or criminal justice.",
        "entrance_to_major": "Not found",
        "degree_requirements": {
            "option": null,
            "core_requirements": "Code Title Credits Required Courses HDFS 345CONTEMPORARY URBAN ISSUES AND SOCIAL JUSTICE FRAMEWORKS 3 Select two of the following:6 HDFS 175NIntroduction to Youth Development and Arts-based Social Justice HDFS 239Adolescent Development HDFS 433Developmental Transition to Adulthood PSYCH 412Adolescence Select one of the following:3 CAS 471Intercultural Communication Theory and Research COMM 222NSocial Justice and the Image CRIM 441The Juvenile Justice System EARTH 111 ERM 210Environmental Factors and Their Effect on Your Food Supply HDFS 239Adolescent Development HDFS 301Values and Ethics in Health and Human Development Professions HDFS 400Youth Development and Social Justice Capstone Seminar HDFS 410Communities and Families HDFS 411The Helping Relationship HDFS 432Developmental Problems in Childhood and Adolescence PLSC 1American Politics: Principles, Processes and Powers PLSC 291Introduction to Peace and Conflict Studies PLSC 491Peace and Conflict Studies Seminar PSYCH 231Introduction to the Psychology of Gender PSYCH 424Applied Social Psychology PSYCH 432Multicultural Psychology in America PSYCH 441Health Psychology PSYCH 479The Psychology of Gender SOC 5Social Problems"
        },
        "electives": "Not found",
        "supporting_courses": "Not found"
    }
}